[
    {
        "id": "f92abf88-e16a-4c17-b2b3-6738db48d3a3",
        "type": "article",
        "domaine": "mathematics",
        "titre": "The exceptional Jordan algebra (2020)",
        "url": "https://cp4space.hatsya.com/2020/10/28/the-exceptional-jordan-algebra/",
        "description": "In the early 1930s, Pascual Jordan attempted to formalise the algebraic properties of Hermitian matrices. In particular: Hermitian matrices form a real vector space: we can add and subtract Hermiti…",
        "source": "Hatsya.com",
        "author": null,
        "date_pub": "2025-03-17T07:30:26Z",
        "contenu": "In the early 1930s, Pascual Jordan attempted to formalise the algebraic properties of Hermitian matrices. In particular:\nNow, this symmetrised product  is commutative by definition, and is also (bi)linear: . What other algebraic properties must this product satisfy? The important ones are:\nThe second of these conditions means that we can say that an element of the Jordan algebra is ‘nonnegative’ if it can be expressed as a sum of squares. (In the familiar context of real symmetric matrices, this coincides with the property of the matrix being positive-semidefinite.) The nonnegative elements form a ‘cone’ closed under multiplication by positive real scalars and addition.\nJordan, von Neumann, and Wigner proceeded to classify all of the finite-dimensional algebras of this form (known as formally real Jordan algebras). They showed that every such algebra is a direct sum of ‘simple’ algebras, each of which is isomorphic to [at least] one of the following:\nThe qualification ‘at least’ is because there are some isomorphisms here:\nSimple formally real Jordan algebras, showing the four infinite families and the exceptional Jordan algebra\nExactly one of these simple formally real Jordan algebras fails to fit into any of the four infinite families. This exceptional Jordan algebra is , the 3-by-3 self-adjoint octonionic matrices endowed with the symmetrised product. Viewed as a real vector space, it is 27-dimensional: an arbitrary element can be described uniquely by specifying the three diagonal elements (which must be real) and three lower off-diagonal elements (which can be arbitrary octonions); the three upper off-diagonal elements are then determined.\nGiven a formally real Jordan algebra, we can consider the idempotent elements satisfying . For the Jordan algebras built from n-by-n real, complex, or quaternionic matrices, these are the matrices with eigenvalues 0 and 1.\nWe get a partial order on these ‘projection’ matrices: A ‘contains’ B if and only if . This partially-ordered set can be identified with the stratified collection of subspaces in the (n−1)-dimensional projective space over the base field:\nThe exceptional Jordan algebra gives us the octonionic projective plane, discovered by Ruth Moufang. We can’t get any higher-dimensional octonionic projective spaces because Desargues’ theorem is false in the octonionic projective plane, whereas it’s true in any plane that can be embedded in a 3-dimensional projective space. We mentioned this seven years ago.\nThis hints at why 4-by-4 and higher octonionic matrices have no hope of forming a formally real Jordan algebra: we’d be able to define an octonionic projective 3-space, which is impossible.\nWhat about the spin factors? The idempotents in  are:\nIn other words, these correspond to spheres! Recall that the real, complex, quaternionic, and octonionic projective lines are (as topological manifolds) just the 1-, 2-, 4-, and 8-spheres, respectively; we can think of the spin factors as ‘projective lines’ built from arbitrary-dimensional spheres.\nAs for non-simple formally real Jordan algebras, the corresponding ‘projective spaces’ are just Cartesian products of the ‘projective spaces’ corresponding to the direct summands.\nIn August of this year, Blake Stacey posted the following comment on John Baez’s essay:\n\nNow for some context: it is possible to define the determinant of a 3-by-3 octonionic Hermitian matrix, and the group of linear operators (viewing  as a 27-dimensional real vector space) that preserves the determinant is a noncompact real form of the Lie group E6.\nThis group E6 is transitive on the positive-definite matrices of determinant 1. The subgroup fixing any one of these (without loss of generality, the identity matrix) is the compact real Lie group F4, which also preserves the Jordan product. This means that it maps idempotents to idempotents, so can be seen as acting on the octonionic projective plane as its group of projective transformations.\nThis group F4 is transitive on the rank-1 idempotent matrices, and the subgroup fixing any one of these is Spin(9). (As a result, we can describe the octonionic projective plane as the quotient F4 / Spin(9). Elie Cartan proved that all compact Riemannian symmetric spaces are quotients of compact Lie groups.)\nWhat’s the analogy for familiar (3+1)-dimensional Minkowski spacetime?\nIt is natural to consider the ‘integer points’ in this spacetime, namely the octonionic Hermitian matrices where the off-diagonal elements are Cayley integers and the diagonal elements are ordinary integers. John Baez mentions that this is the unique integral unimodular lattice in (26+1)-dimensional spacetime, and it can be seen as the direct sum  of the exceptional Lorentzian lattice with a copy of the integers.\nThis lattice was thoroughly investigated in a marvellous paper by Noam Elkies and Benedict Gross. Possibly the most surprising discovery in this paper is that whilst E6 acts transitively on the positive-definite matrices of determinant 1, this no longer holds when you ‘discretise’! More precisely, the positive-definite ‘integer points’ of determinant 1 form two distinct orbits under the discrete subgroup of E6 that preserves the lattice.\nOne of these orbits contains the identity matrix; the other contains the circulant matrix with elements {2, η, η*} where . [Note: there’s a 6-dimensional sphere of octonionic square-roots of -7. You’ll need to choose one that results in η being a Cayley integer.] If you use this other matrix E as your quadratic form instead of the identity matrix I, this leads to a very natural construction of the Leech lattice.\nSpecifically, as shown in the Elkies-Gross paper, triples of Cayley integers with the norm  form an isometric copy of the Leech lattice! By contrast, the usual inner product  using the identity matrix as the quadratic form gives the direct sum  — again an even unimodular lattice in 24 dimensions, but not as exceptional or beautiful or efficient as the Leech lattice.\nTo get a full understanding of the octonions, Cayley integers, and exceptional Jordan algebra, I recommend reading all of the following:\nRobert Wilson has also constructed the Leech lattice from the integral octonions (see here and here). Wilson’s construction also involves , so it may be possible to show reasonably directly that it’s equivalent to the Elkies-Gross construction.\nPingback: The exceptional Jordan algebra (2020) by gone35 – HackTech.info\nPingback: Hacker News 今日TOP 20| 2025-03-17 - 出海掘金，无限可能。为独立开发者、跨境电商从业者、海外自媒体提供最新出海资讯和资源-出海掘金，无限可能。为独立开发者、跨境电商从业者、海外自媒体\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n",
        "keywords": [
            "Pascual Jordan attempted",
            "real Jordan algebras",
            "formally real Jordan",
            "exceptional Jordan algebra",
            "Jordan algebra",
            "real Jordan",
            "Jordan",
            "Pascual Jordan",
            "exceptional Jordan",
            "octonionic projective"
        ]
    },
    {
        "id": "6cc997cc-2560-4505-9823-443167b185bf",
        "type": "article",
        "domaine": "mathematics",
        "titre": "Top Math Prize Recipient Wedded Algebra and Calculus to Found a New Field",
        "url": "https://www.scientificamerican.com/article/top-math-prize-recipient-wedded-algebra-and-calculus-to-found-a-new-field/",
        "description": "Masaki Kashiwara, this year’s Abel Prize winner, co-founded a new field of mathematics called algebraic analysis",
        "source": "Scientific American",
        "author": "Manon Bischoff",
        "date_pub": "2025-03-26T16:30:00Z",
        "contenu": "March 26, 2025\n7 min read\nAbel Prize Goes to Pioneer Whose ‘Math Toolbox’ Can Be Used to Describe the Natural World\nMasaki Kashiwara, this year’s Abel Prize winner, co-founded a new field of mathematics called algebraic analysis\nBy Manon Bischoff edited by Gary Stix\nMasaki Kashiwara—Abel Prize Laureate 2025.\nPeter Badge/Typos1/The Abel Prize\nOne of the landmarks of Kyoto, the home of mathematician Masaki Kashiwara, is the Kamo River. At certain points, there are stepping stones that allow residents to cross the river away from the bridges. If you take a closer look at these stones, you can see how the water forms swirls and small eddies around them. Describing this flow of a liquid is not easy. You have to solve complicated equations that have been known for centuries but still pose many mysteries today: Do the equations always have a solution? How can they be calculated? And what properties do they have? It seems that mathematicians have reached a limit with the tools of their trade. To make progress, a new toolbox is needed. The Japanese mathematician Masaki Kashiwara developed such a toolbox for similarly difficult questions in the 1970s.\nKashiwara introduced proven methods from algebra into analysis—the theory underlying calculus that explores functions, limits and other concepts—and, together with his colleagues, founded an entirely new branch of mathematics: algebraic analysis. This led to significant advances in various fields. For example, Kashiwara succeeded in solving one of the problems posed by mathematician David Hilbert in the early 20th century and developed new techniques that are now used in modern physics.\nKashiwara “has proved astonishing theorems with methods no one had imagined. He has been a true mathematical visionary,” read a recent press release from the Norwegian Academy of Sciences and Letters, which honored him with this year’s Abel Prize—one of the highest honors in mathematics.\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\nKashiwara was born near Tokyo in 1947. He discovered his passion for mathematics at an early age through traditional Japanese puzzles known as tsurukamezan. These puzzles involve correctly calculating the number of cranes and turtles: Suppose x heads and y legs are visible. How many cranes and turtles are there? Kashiwara’s parents didn’t have much exposure to the abstract subject, but the young Masaki enjoyed solving this problem using algebraic methods.\nHere’s one example: Each crane and turtle respectively has two and four legs (y)—and both have one head (x). To calculate the number of cranes (k)and turtles (s), one must solve the following equations: 2k + 4s = y and k + s = x. For example, if 16 legs and five heads are visible, then there must be two cranes and three turtles.\nKashiwara realized he enjoyed generalizing such questions. He excelled in school with his achievements. When he met the late mathematician Mikio Sato when he was Sato’s student at the University of Tokyo, he devoted himself to this type of problem-solving. Kashiwara was in the right place at the right time: Sato and his colleagues were then developing a completely new branch of mathematics that combines two distinct fields: analysis and algebra.\nKashiwara worked with his mentor on differential equations. In our world, everything is in motion; nothing remains permanently still. Even a gigantic mountain range such as the Himalayas grows or shrinks over time. Such changes can be expressed mathematically with the help of derivatives. All of physics is based on equations that contain derivatives, so-called differential equations. These can be used to describe the population of living organisms, the trajectory of the moon or the flow velocity of the Kamo River.\nWhile differential equations can be written down quickly, they are much more difficult to solve. In some special cases, the solution is known. In others, however, it is not even clear whether a problem can be solved at all. One of the most important unsolved problems in mathematics revolves around the question of whether the Navier-Stokes equations, which describe the flow behavior of fluids, always have a solution. Despite centuries of research in the field of analysis, many of the most pressing problems remain unsolved.\nWhen you’re stuck on a problem, it sometimes helps to look at it from a different perspective. Often it’s helpful to step back and examine the problem from a distance. In this case, the exact details may become blurred, but the general structure of the topic becomes visible. This approach is not only helpful for practical, everyday problems but can also be useful in mathematics.\nA Japanese research group led by Sato pursued a similar approach. The team wanted to examine differential equations from a different perspective. To do so, the researchers left the field of analysis and turned instead to algebra. Algebra is generally much more abstract: the focus is not necessarily the mathematical objects—in this case, the equations and their derivatives—but rather their behavior. Just as, in physics, one studies a new particle by examining its interactions with other particles, the interplay of different equations should reveal new insights. That is the idea underlying algebraic analysis.\nSo instead of picking out a specific differential equation and examining it in detail, Sato and his colleagues devoted themselves to an entire class of such equations. They also allowed the differential equations to move not only on a plane but also on curved surfaces—as if trying to describe a river on an oddly shaped planet. This approach may seem quite complex, but it actually opens up entirely new possibilities. This allows general properties to be derived for the class of differential equations under consideration that are not apparent for individual equations.\nAt the end of the 1960s, Sato organized a weekly seminar in which participants worked together to develop the concepts of the new theory. Among all the experts was Kashiwara, then a young student, who eagerly participated.\nIn 1970 Kashiwara began his master’s thesis under Sato. His task was to develop algebraic tools for investigating objects from analysis. Then only 23 years old, Kashiwara introduced so-called D-modules, which make it possible to extract valuable information from differential equations. D-modules can be used, for example, to determine whether the solutions to equations contain “singularities—that is, whether there are regions where they assume infinite values. The modules can also be used to calculate how many solutions the equations have.\nThe results of Kashiwara’s master’s thesis shaped the emerging field of algebraic analysis. He had written his research in Japanese, however—it took a full 25 years before it was translated into English and thus made accessible to a wider audience.\nAfter graduating, Kashiwara went to Kyoto University, where he continued his collaboration with Sato and earned his doctorate. In doing so, he further developed the new methods he had established in his master's thesis. “From 1970 to 1980, Kashiwara solved almost all the fundamental questions of D-module theory,” recalled his French colleague Pierre Schapira in a 2008 preprint paper that was based on a 2007 talk. After completing his doctorate, Kashiwara accepted a position at Nagoya University, conducted research for a year at the Massachusetts Institute of Technology and then returned to Japan in 1978 to accept a professorship at Kyoto University.\nWith the help of D-modules, Kashiwara solved one of the most important problems in the field in 1980, a problem that Hilbert presented in his famous centenary address at the International Congress of Mathematicians in Paris in 1900. Among the 23 problems that Hilbert considered groundbreaking for 20th-century research, the 21st problem deals with differential equations. The German mathematician wanted to know whether it would always be possible to find a differential equation whose solution possessed singularities on a given curved surface. Kashiwara was able to prove that this is indeed possible for certain types of surfaces—in these cases, a suitable differential equation can be calculated.\nD-modules have led to advances in many different areas of mathematics. But they are also proving helpful in physics. In 2023 mathematician Anna-Laura Sattelberger of the Max Planck Institute for Mathematics in the Sciences in Leipzig, Germany, and other experts used D-modules to evaluate quantum physical “path integrals.” These are used to calculate which processes take place in particle accelerators, for example, when two protons collide, creating a series of new particles. The extremely complex integrals can be viewed as solutions of differential equations, which is why the methods of algebraic analysis can help to determine their properties.\nKashiwara also had a significant influence on other areas of mathematics. One of these is representation theory, which is used to describe symmetries. An object is considered symmetric if it looks the same after certain transformations (such as rotations or reflections). For example, an equilateral triangle can be rotated by multiples of 120 degrees without changing its shape. Representation theory enables experts to calculate symmetry transformations: What happens, for example, if you combine a 270-degree rotation with a reflection along the y-axis? Such questions can be answered particularly well if you represent the symmetry transformations using matrices: the combination of transformations corresponds to the multiplication of the corresponding matrices.\nSuitable representations cannot be found for all types of symmetries, however. In the course of his work, Kashiwara focused extensively on continuous symmetries, known in mathematics as Lie groups. He made significant progress in investigating their representations.\nHe also explored discrete “quantum groups” that are not continuous. Such discrete quantum groups play an important role in quantum physics. At the microscopic level, most quantities appear only in small pieces; the world appears to be quantized at the smallest scale. To describe the symmetries of quantized quantities, Kashiwara introduced the concept of crystal bases. These allow quantum groups to be represented by directed networks. This offers enormous advantages, allowing questions of representation theory to be answered through combinatorial considerations (arranging objects in a finite set), which are generally much simpler. These concepts have since proven their worth in both mathematics and physics.\n“For over 50 years Masaki Kashiwara has reshaped and deeply enriched the fields of algebraic analysis and representation theory,” the Norwegian Academy of Sciences and Letters wrote in its recent press release. The mathematician has already been honored with numerous awards for all of this impressive research. This year’s Abel Prize, which honors a mathematician’s lifetime achievement, marks a culmination of what he has accomplished. The Abel Prize is modeled on the Nobel Prizes, which do not include mathematics, and comes with 7.5 million Norwegian kroner (approximately $710,000).\nThe 78-year-old does not seem to be thinking about retirement: he still regularly publishes new research findings and tries to enrich mathematics with new stepping stones.\nThis article originally appeared in Spektrum der Wissenschaft and was reproduced with permission.\nManon Bischoff is a theoretical physicist and an editor at Spektrum der Wissenschaft, the German-language sister publication of Scientific American.\nLearn and share the most exciting discoveries, innovations and ideas shaping our world today.\nFollow Us:\nScientific American is part of Springer Nature, which owns or has commercial relations with thousands of scientific publications (many of them can be found at www.springernature.com/us). Scientific American maintains a strict policy of editorial independence in reporting developments in science to our readers.\n© 2024 SCIENTIFIC AMERICAN, A DIVISION OF SPRINGER NATURE AMERICA, INC.ALL RIGHTS RESERVED.",
        "keywords": [
            "Abel Prize",
            "Kashiwara",
            "Masaki Kashiwara",
            "Abel Prize Laureate",
            "mathematician Masaki Kashiwara",
            "differential equations",
            "equations",
            "Abel Prize winner",
            "Prize",
            "Abel"
        ]
    },
    {
        "id": "6565ef7d-2c2a-4c29-a86f-03d3bb182b11",
        "type": "article",
        "domaine": "mathematics",
        "titre": "Matrix Calculus (For Machine Learning and Beyond)",
        "url": "https://arxiv.org/abs/2501.14787",
        "description": "This course, intended for undergraduates familiar with elementary calculus and linear algebra, introduces the extension of differential calculus to functions on more general vector spaces, such as functions that take as input a matrix and return a matrix inve…",
        "source": "Arxiv.org",
        "author": null,
        "date_pub": "2025-03-29T20:00:33Z",
        "contenu": "Help | Advanced Search\narXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\nBoth individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\nHave an idea for a project that will add value for arXiv's community? Learn more about arXivLabs.\n\n\narXiv Operational Status \n                    Get status notifications via\n                    email\n                    or slack\n",
        "keywords": [
            "Advanced Search arXivLabs",
            "Advanced Search",
            "arXiv features directly",
            "Search arXivLabs",
            "collaborators to develop",
            "develop and share",
            "features directly",
            "Advanced",
            "Search",
            "arXiv features"
        ]
    },
    
 
   
    {
        "id": "bbc5f77c-1fb2-4faf-92c0-c974ff3ff1c5",
        "type": "article",
        "domaine": "mathematics",
        "titre": "Mathematician wins 2025 Abel prize for tools to solve tricky equations",
        "url": "https://www.newscientist.com/article/2473330-mathematician-wins-2025-abel-prize-for-tools-to-solve-tricky-equations/",
        "description": "Masaki Kashiwara has won the 2025 Abel prize, seen by some as the Nobel of mathematics, for his contributions to algebraic analysis and representation theory",
        "source": "New Scientist",
        "author": "Matthew Sparkes",
        "date_pub": "2025-03-26T11:00:29Z",
        "contenu": "Advertisement\nMasaki Kashiwara has won the 2025 Abel prize, seen by some as the Nobel of mathematics, for his contributions to algebraic analysis and representation theory\nBy Matthew Sparkes\n\n                                    26 March 2025\n                                                                    \nMasaki Kashiwara’s work is seen as highly abstract but vitalPeter Bagde / Typos1 / The Abel Prize\nMasaki Kashiwara’s work is seen as highly abstract but vital\nPeter Bagde / Typos1 / The Abel Prize\nMasaki Kashiwara has won the 2025 Abel prize, sometimes called the Nobel prize of mathematics, for his work on algebraic analysis.\nKashiwara, a professor at Kyoto University, Japan, received the award “for his fundamental contributions to algebraic analysis and representation theory, in particular the development of the theory of D-modules and the discovery of crystal bases”.\n Read moreMathematicians find 27 tickets that guarantee UK National Lottery win \nRead more\nMathematicians find 27 tickets that guarantee UK National Lottery win\nAdvertisement\nHis work involves the use of algebra to investigate geometry and symmetry, and has focused on using those ideas to find solutions for differential equations, which involve relationships between mathematical functions and their rates of change. Finding solutions to such equations can be particularly tricky, especially in the case of functions that have several variables and therefore several rates of change – these are known as partial differential equations (PDEs).\nKashiwara’s vital work on D-modules, a highly specific area of algebraic analysis involving linear PDEs, was done surprisingly early in his career, during his PhD thesis. He has worked with over 70 collaborators. Kashiwara told New Scientist he was happy to win the Abel prize, but is still actively working and hopes to make further contributions.\n“I am now working on the representation theory of quantum affine algebras and its related topics,” he says. “There is a nice conjecture: [the] ‘affine quiver conjecture’, but I still have no clue how to solve it.”\nThe latest science news delivered to your inbox, every day.\nDavid Craven at the University of Birmingham, UK, says Kashiwara’s work is extremely abstract, far from direct real-world applications, and understanding even a basic summary would require a mathematics PhD as a bare minimum. “That’s the level of difficulty these things are at,” he says. “It’s incredibly esoteric.”\n Read moreMathematicians have discovered a mind-blowing new kind of infinity \nRead more\nMathematicians have discovered a mind-blowing new kind of infinity\nBut Craven says Kashiwara has made a huge impact in his field: “The stuff that he’s done permeates representation theory. You can’t get away from Kashiwara if you want to do geometric representation theory, it’s just everywhere.”\nGwyn Bellamy at the University of Glasgow, UK, says “all the big results in the field [algebraic analysis] are due to him, more or less”, and the Abel prize win for Kashiwara has been a long time coming. “It’s given for lifetime achievement, and he’s achieved a lot of in his lifetime,” he says. “He’s still revolutionising the field even now, I would say.”\nThe Abel prize, named after Norwegian mathematician Niels Henrik Abel, is awarded each year by the King of Norway. Last year, it was won by Michel Talagrand for his research into probability theory and the extremes of randomness.\nTopics:\nAdvertisement\nReceive a weekly dose of discovery in your inbox! \n            We'll also keep you up to date with New Scientist \n            events and special offers.\nExplore the latest news, articles and features\nNews\nFree\nNews\nSubscriber-only\nNews\nFree\nNews\nFree\nTrending New Scientist articles\nAdvertisement\nDownload the app",
        "keywords": [
         
            "Masaki Kashiwara",
            "Abel",
            "Kashiwara",
            "Abel prize win",
            "prize",
            "algebraic analysis",
            "National Lottery win",
            "representation theory",
            "Niels Henrik Abel"
        ]
    },
   
  
   
    
   
    {
        "id": "c0ed115c-cc71-41f1-8d05-dfbf0e9f0a1d",
        "type": "article",
        "domaine": "mathematics",
        "titre": "The Calculated Typer",
        "url": "https://bahr.io/pubs/entries/calctyper.html",
        "description": "We present a calculational approach to the design of type checkers,\nshowing how they can be derived from behavioural specifications using equational\nreasoning.  In addition, we show how the calculations can be simplified by\ntaking an algebraic approach based …",
        "source": "Bahr.io",
        "author": "Patrick Bahr",
        "date_pub": "2025-03-18T03:31:36Z",
        "contenu": "We present a calculational approach to the design of type checkers,\nshowing how they can be derived from behavioural specifications using equational\nreasoning.  In addition, we show how the calculations can be simplified by\ntaking an algebraic approach based on fold fusion, and further improved by\ntaking a constraint-based approach to solving and composing fusion\npreconditions.  We illustrate our methodology with three examples of increasing\ncomplexity, starting with a simple expression language, then adding support for\nexceptions, and finally considering a version of the lambda calculus.\nCategories: Type Systems, Formal Verification\nTags: Program Calculation, Type Checker",
        "keywords": [
            "equational reasoning",
            "present a calculational",
            "derived from behavioural",
            "behavioural specifications",
            "specifications using equational",
            "calculational approach",
            "Formal Verification",
            "type checkers",
            "approach",
            "algebraic approach based"
        ]
    },
  
    {
        "id": "c0461e6b-d2e3-4def-8e50-b791342dc93f",
        "type": "article",
        "domaine": "mathematics",
        "titre": "Loader's Number",
        "url": "https://googology.fandom.com/wiki/Loader%27s_number",
        "description": "View full site to see MathJax equation Loader's number is the output of loader.c, a C program by Ralph Loader that came in first place for the Bignum Bakeoff contest, whose objective was to write a C program (in 512 characters or less) that generates the l…",
        "source": "Fandom.com",
        "author": "Contributors to Googology Wiki",
        "date_pub": "2025-04-05T16:18:12Z",
        "contenu": "View full site to see MathJax equation\nLoader's number is the output of loader.c, a C program by Ralph Loader[1] that came in first place for the Bignum Bakeoff contest, whose objective was to write a C program (in 512 characters or less) that generates the largest possible output on a theoretical machine with infinite memory.A layman's explanation of the ideas behind loader.c can be found in the last two videos of this Youtube playlist on the Bignum Bakeoff contest.\n\nRalph Loader explains in the document of the program[3] that the program implements a parser, type-checker, interpreter and proof-search for the Huet-Coquand \"Calculus of Constructions\" (CoC), a particularly expressive lambda calculus, and David Moews stated that the program diagonalizes over the CoC, but there is no actual written proof for their statements. Its output, affectionately nicknamed Loader's number, is defined as \\(D^5(99)=D(D(D(D(D(99)))))\\), where \\(D(k)\\) is an accumulation of all possible typing judgements (a statement that an expression has a some type under some context) provable within approximately \\(\\log(k)\\) inference steps in the calculus of constructions (encoding proofs as binary numbers and expressions as power towers). The proof strength and expressiveness of the calculus of constructions makes the output of \\(D(k)\\) grow very large for sufficiently large k.\n\nDavid Moews has stated that the behavior of \\(D(99)\\) can be simulated to show that it is larger than \\(2↑↑30,419\\) (where ↑↑ is tetration), and that \\(D^2(99)\\) would be much larger than \\(f_{\\varepsilon_0+\\omega^3}(1,000,000)\\) in the fast-growing hierarchy using Cantor's definition of fundamental sequences, on the basis that the number of this size can be expressed by building upon \"The Expressiveness of Simple and Second-Order Type Structures\" by Fortune et al..[2] Although there is no accessible proof of either claims, if this is true, then \\(D^2(99)\\) is much larger than the output of Marxen.c, which is upper bounded at the aforementioned \\(f_{\\varepsilon_0+\\omega^3}(1,000,000)\\).\n\nThe final output of \\(D^5(99)\\) is the Loader's number, which is much larger than \\(D^2(99)\\) but comparison to other large numbers is not easy.[note 1] Loader's function is computable, so \\(\\Sigma(n) > D^5(99)\\) for relatively small n, say, n = 2000, where \\(\\Sigma(n)\\) is the Busy beaver function.\n\nUpquark11111 elaborates the code.[4]\n\n\nRalph Loader also provided a human-readable version of the above code with the macros expanded and with more expressive variable names and comments.\n\nIt outputs a number that in binary would be represented as <binary representation of y>1000...0 where the number of 0s after the 1 is equal to x. Notice that you can deduce both x and y by looking at the value of P(x,y).\n\nIn loader.c the function is used to create a tree with y denoting the left subtree and x denoting the right subtree.\n\nIt's defined as y - ~y << x, which is just (2*y+1)*2^x.\n\nThe functions Z(x) and L(x) help extract the right and left subtrees from a tree x.\n\nIt's defined as follows:\n\nNote that this is just the number of 0s at the end of the binary representation of x, which is exactly the way that the right subtree is encoded in x.\n\nIt's defined as the integer part of division (x/2)/2^(Z(x)).\n\nNote that this is just the number you get by removing the 0s at the end of x along with the 1 preceding the 0s, which is exactly the way the the left subtree is encoded in x. Since Z(x) stores the return value in a variable r, when calling Z(x) we get the left subtree as output and the right subtree is automatically stored in the variable r.\n\nIt's defined as follows:\n\nIt's defined as follows:\n\nIt's really confusing, but what's proved is that D(0) = 8 646 911 284 551 352 321 and D(3) can crash a computer.\n\nPrograms for calculating Loader's number, other than the original program.\n",
        "keywords": [
            "Bignum Bakeoff contest",
            "Loader number",
           
            "Ralph Loader",
         
            "Loader",
           
            "number",
            "Bakeoff contest",
            "nicknamed Loader number"
        ]
    }
   
   
]