[
    {
        "id": "d79963a2-8a9f-4c28-a077-d735655db7ae",
        "type": "article",
        "domaine": "engineering",
        "titre": "River-Inspired Interior Gives a Train a Softer and Gentler Character",
        "url": "https://www.yankodesign.com/2025/03/28/river-inspired-interior-gives-a-train-a-softer-and-gentler-character/",
        "description": "River-Inspired Interior Gives a Train a Softer and Gentler CharacterThe thundering approach of a high-speed train typically conjures images of sleek metal, industrial power, and mechanical precision—a marvel of engineering that seems worlds apart...",
        "source": "Yanko Design",
        "author": "JC Torres",
        "date_pub": "2025-03-28T10:07:27Z",
        "contenu": "\nThe thundering approach of a high-speed train typically conjures images of sleek metal, industrial power, and mechanical precision—a marvel of engineering that seems worlds apart from nature’s gentle rhythms. Yet beneath this technological exterior lies an unexpected parallel: like a river carving its path through the landscape, trains flow along their predetermined routes with a similar sense of purpose and grace. This poetic connection between mechanical transport and natural waterways has inspired a breathtaking reimagining of France’s iconic TGV high-speed rail service.\nThe TGV Inoui’s fifth-generation interior design embraces this surprising kinship between train and river, transforming the passenger experience through thoughtful elements that evoke water’s soothing qualities. Launched after a comprehensive design project that began in 2016, this revolutionary approach challenges our expectations of train travel, replacing clinical efficiency with organic warmth and industrial hardness with inviting softness. The result is a traveling environment that feels less like transportation and more like a gentle journey through flowing spaces.\nDesigners: Nendo, AREP\n\n\n\n\n\n\n\nStepping aboard the redesigned carriages reveals an immediate sense of serenity, with a fluid horizon line that extends throughout the interior, creating visual continuity that mimics the surface of water. This horizontal element serves multiple purposes—establishing perspective, orienting passengers within the space, and subtly reinforcing the river concept without resorting to obvious thematic elements. The effect feels natural rather than forced, a sophisticated interpretation rather than a literal translation.\n\n\n\n\n\n\n\n\nThe seating arrangements draw inspiration from smooth river pebbles, with rounded forms that have been shaped by imaginary currents over time. These organic contours replace the rigid geometries typically found in train interiors, offering passengers embracing comfort that seems to cradle the body. The tactile upholstery further enhances this sensation, with textures and colors that evoke the tranquil depths of flowing water, creating a multisensory experience that transcends mere transportation.\n\n\n\nPerhaps the most delightful expressions of the river theme appear in the lighting elements, where playful lamp designs capture the bubbly, effervescent quality of water’s surface. These luminous accents provide both practical illumination and whimsical visual interest, punctuating the serene environment with moments of joy. The interplay between these vibrant details and the overall calm atmosphere creates a balanced environment that feels simultaneously energizing and relaxing.\n\n\nTraveling at speeds exceeding 350 kilometers per hour, passengers experience a curious paradox: extreme velocity wrapped in exceptional comfort. The environmental considerations embedded in the design enhance this sense of mindful travel, with 97% recyclable materials and light-colored exteriors that improve albedo and reduce energy consumption during summer months. These sustainable elements align perfectly with the river concept, honoring natural systems while embracing technological advancement.\n\n\nThe redesigned TGV Inoui represents a fundamental shift in how we perceive train interiors, moving away from purely functional spaces toward environments that prioritize human comfort and emotional well-being. By softening the industrial character of high-speed rail travel through nature-inspired design, the project creates what the designers call “a more personal bubble of comfort in a shared space.” This transformation acknowledges that transportation isn’t merely about moving from point A to point B—it’s about the quality of the journey itself.\n\nI’ve always been a fan of tech that blends seamlessly into everyday use. When smart speakers were first introduced, they weren’t designed to look like…\nMeet the Dynamic Folio – a case from the folks at MOFT that elevates your iPad. Literally. And at multiple heights and angles, that too….\nCreating a nursery can be an enjoyable process for expectant parents but anticipating the needs of a yet-to-arrive child is a daunting challenge. After all,…\nThe Patatras is a new way to store books – a wheel of knowledge if you will. Made of expanded polypropylene in a range of…\nOn 24 May 2007, Brick: the exhibition will open at the Groot Handelsgebouw in Rotterdam during the manifestation Rotterdam 2007, City of Architecture. Brick: the…\nDo you know what the future of architecture looks like? Smart, sustainable, and self-sufficient! You shouldn’t have to choose between a smart modern home and…\nWe’re an online magazine dedicated to covering the best in international product design. We have a passion for the new, innovative, unique and undiscovered. With our eyes firmly focused on the future.\nEditorial Standards and Ethics / Privacy Policy",
        "keywords": [
            "typically conjures images",
            "train typically conjures",
            "sleek metal",
            "conjures images",
            "images of sleek",
            "marvel of engineering",
            "TGV Inoui",
            "iconic TGV high-speed",
            "TGV high-speed rail",
            "high-speed train typically"
        ]
    },
  
    {
        "id": "41905b84-a625-4406-8577-413c05a5e789",
        "type": "article",
        "domaine": "engineering",
        "titre": "Levitating Lego Generator Runs On Air",
        "url": "https://hackaday.com/2025/03/31/levitating-lego-generator-runs-on-air/",
        "description": "[Jamie] decided to build a generator, and Lego is his medium of choice. Thus was created a fancy levitating generator that turns a stream of air into electricity.  The basic concept is simple enoug…",
        "source": "Hackaday",
        "author": "Lewin Day",
        "date_pub": "2025-03-31T20:00:53Z",
        "contenu": "[Jamie] decided to build a generator, and Lego is his medium of choice. Thus was created a fancy levitating generator that turns a stream of air into electricity. \nThe basic concept is simple enough for a generator—magnets moving past coils to generate electricity. Of course, Lego doesn’t offer high-strength magnetic components or copper coils, so this generator is a hybrid build which includes a lot of [Jamie’s] non-Lego parts. Ultimately though, this is fun because of the weird way it’s built. Lego Technic parts make a very crude turbine, but it does the job. The levitation is a particularly nice touch—the build uses magnets to hover the rotor in mid-air to minimize friction to the point where it can free wheel for minutes once run up to speed. The source of power for this contraption is interesting, too. [Jamie] didn’t just go with an air compressor or a simple homebrew soda bottle tank. Instead, he decided to use a couple of gas duster cans to do the job. The demos are pretty fun, with [Jamie] using lots of LEDs and a radio to demonstrate the output.  The one thing we’d like to see more of is proper current/voltage instrumentation—and some measurement of the RPM of this thing!\nWhile few of us will be rushing out to build Lego generators, the video nonetheless has educational value from a mechanical engineering standpoint. Fluids and gases really do make wonderful bearings, as we’ve discussed before. Video after the break.\n\n\nMust put out a lot of power to run a Stargate, even a small one like that.\nThe ZPM is hidden under the table :)\nWell I was going to comment on how ridiculous it is that we are still selling refrigerants in a can as air dusters, with them having such a high global warming potential, so I went looking for the Safety Data Sheet for this air duster by searching the product number (from 0:33 in the video) which is PFS5130 along with SDS.\nI found to my surprise listed in the SDS (after being translated from Polish) the main constituents are: 70-80\npercent butane, and 20-30 percent propane…\nSo, uhhhhh. Nothing to see here, move along folks.\nNext video will be the combustion gas turbine version\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "build Lego generators",
            "medium of choice",
            "Jamie",
            "Lego Technic parts",
            "Lego",
            "generator",
            "Lego generators",
            "fancy levitating generator",
            "build",
            "Lego Technic"
        ]
    },
    {
        "id": "3a0ca651-559e-42e6-999a-b1e866d34762",
        "type": "article",
        "domaine": "engineering",
        "titre": "Recreating the Analog Beauty of a Vintage Tektronix Oscillator",
        "url": "https://hackaday.com/2025/03/29/recreating-the-analog-beauty-of-a-vintage-tektronix-oscillator/",
        "description": "Tektronix must have been quite a place to work back in the 1980s. The company offered a bewildering selection of test equipment, and while the digital age was creeping in, much of their gear was st…",
        "source": "Hackaday",
        "author": "Dan Maloney",
        "date_pub": "2025-03-29T11:00:16Z",
        "contenu": "Tektronix must have been quite a place to work back in the 1980s. The company offered a bewildering selection of test equipment, and while the digital age was creeping in, much of their gear was still firmly rooted in the analog world. And some of the engineering tricks the Tek wizards pulled off are still the stuff of legend.\nOne such gem of analog design was the SG505, an ultra-low-distortion oscillator module that [Paul] is trying to replicate with modern parts. That’s a tall order since not only did the original specs on this oscillator call for less than 0.0008% total harmonic distortion over a frequency range of 20 Hz to 20 kHz, but a lot of the components it used are no longer manufactured. Tek also tended to use a lot of custom parts, especially mechanical ones like the barrel switch used to select attenuation levels in the SG505, leaving [Paul] no choice but to engineer his way around them.\nSo far, [Paul] has managed to track down most of the critical components or source suitable substitutes. One major win was locating the original J-FET Tek used in the oscillator’s AGC circuit. One part that’s proven more elusive is the potentiometer that Tek used to adjust the frequency; who knew that finding a dual-gang precision wirewound 10k single-turn pot with no physical stop would be such a chore?\n[Paul] still seems to be very much in the planning stages of this project yet, and that’s probably for the best since projects such as these live and die on proper planning. We’re keen to see how this develops, and we’re very much looking forward to seeing the FFT results. We also imagine he’ll be busting out his custom curve tracer at some point in the build, too.\nThere are very few JFETs left in production. There are even fewer low noise parts to choose from.\nI’m happy to see that TI introduced JFE150 and JFE2140 recently.\nNever used JFETs before. Are they very different from MOSFETs? Anything cool that I can do with them?\nJFETs are on with no bias, and turn off when gate voltage is applied (negative in the case of N-channel JFETs, positive in the case of P-channel JFETs).  I have used this characteristic several times in designs where a signal had to get through when the power was off (bypassing the active circuitry), and take a different route (through the active circuitry) when the power was on.  There’s an analog range in between of course.\nIn a JFET the gate and the channel form a diode, which is mean to be biassed so that no current flows in the diode. Driving the diode into conduction clamps the gate voltage, probably not a good idea.\nMOSFETs work by adjusting an inversion channel under the gate dielectric, while jFETs control the cross section of a non-inverted conducting zone bounded by depletion regions.\nInterfaces are trouble because they are “dirty” with defects that affect carrier transport, which gives rise to noise on different timescales. In jFETs, the channel resides deep in the bulk of the semiconductor.\njFETs can be built for power applications, but building good MOSFETs for low noise applications is a different challenge.\nI’ve run into the same problem.  Wow, thank you for the heads-up on the JFE150 and JFE2140!!\nTektronix was making legendary equipment by the time I first became aware of them in 1968, I think on of the scopes we used at the radio station cost $25,000 the EET’s told me.  The company goes back to around 1950, the EET’s considered Tek above the Gold Standard. Located in Portland Oregon at the time if my memory is correct.\nTek was the standard bearer for O-scopes back then, and HP was the equivalent in the world of RF test equipment, particularly with spectrum analyzers. Gold standard? More like the unobtainium standard, when it came to buying one.\nI can assure you, Tektronix WAS quite a place to work in the 1980s.  I worked in a field office, starting on 7000-series oscilloscopes and 465/475 portables, then moving up to spectrum analyzers in the 7L series and 492/496 portables.  Every instrument was a work of art as well as a technological marvel, and I’ve never been more proud of my work than during that period.  By the time I left for (sigh) bigger opportunities, the 2215 and 2465 had replaced the 465b, and the 494 and 495 spectrum analyzers were demonstrating what stability really meant.  The newer ‘scopes didn’t use tunnel diodes any more for super sharp triggering, because a) newer technologies were as good or better, and b) they were running out of tunnel diodes.\nWhat a place to be and what a time to be there.\nI can only fathom what this was used for, but in my head I immediately recognized that this would be fantastic for making techno music\nThis is the graddaddy forum thread on low distortion oscilators. Its currently 10,000+ messages with lots on good info and a whole lot of responses as well. https://www.diyaudio.com/community/threads/low-distortion-audio-range-oscillator.205304/\nThe tuning pots need to be low distortion for the system to deliver low distortion. Many pots are not that good. Same for the caps.\nThe AGC is the most sensitive component once the basics are attented to. Victors oscillator has the best implementation currently. His circuit was published in that long thread.\nThe digital readout can send noise back through everything if not very carefully implemented. Lots of shielding and isolation help. You will be generating 3V+ signal and the nises will be at less than 3 microvolts, a really serious challenge. I’ll be watching for your success.\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "Tek",
            "JFETs",
            "Paul",
            "low distortion",
            "low",
            "work",
            "oscillator",
            "good",
            "Tek wizards pulled",
            "time"
        ]
    },
    {
        "id": "9a57e339-d8bb-4946-8e11-2093f1667b29",
        "type": "article",
        "domaine": "engineering",
        "titre": "Charging electric vehicles 5x faster in subfreezing temps",
        "url": "https://news.umich.edu/charging-electric-vehicles-5x-faster-in-subfreezing-temps/",
        "description": "A modified manufacturing process for electric vehicle batteries, developed by University of Michigan engineers, could enable high ranges and fast charging in cold weather, solving problems that are turning potential EV buyers away.",
        "source": "Umich.edu",
        "author": null,
        "date_pub": "2025-04-05T00:38:20Z",
        "contenu": "Study: Enabling 6C fast charging of Li-ion batteries at sub-zero temperature via interface engineering and 3D architectures (DOI: 10.1016/j.joule.2025.101881)\nA modified manufacturing process for electric vehicle batteries, developed by University of Michigan engineers, could enable high ranges and fast charging in cold weather, solving problems that are turning potential EV buyers away.\n“We envision this approach as something that EV battery manufacturers could adopt without major changes to existing factories,” said Neil Dasgupta, U-M associate professor of mechanical engineering and materials science and engineering, and corresponding author of the study published in Joule.\n“For the first time, we’ve shown a pathway to simultaneously achieve extreme fast charging at low temperatures, without sacrificing the energy density of the lithium-ion battery.”\nLithium-ion EV batteries made this way can charge 500% faster at temperatures as low as 14 F (-10 C). The structure and coating demonstrated by the team prevented the formation of performance-hindering lithium plating on the battery’s electrodes. As a result, batteries with these modifications keep 97% of their capacity even after being fast-charged 100 times at very cold temperatures.\nCurrent EV batteries store and release power through the movement of lithium ions back and forth between electrodes via a liquid electrolyte. In cold temperatures, this movement of the ions slows, reducing both battery power as well as the charging rate.\nTo extend range, automakers have increased the thickness of the electrodes they use in battery cells. While that has allowed them to promise longer drives between charges, it makes some of the lithium hard to access, resulting in slower charging and less power for a given battery weight.\nPreviously, Dasgupta’s team improved battery charging capability by creating pathways—roughly 40 microns in size—in the anode, the electrode that receives lithium ions during charging. Drilling through the graphite by blasting it with lasers enabled the lithium ions to find places to lodge faster, even deep within the electrode, ensuring more uniform charging.\nThis sped up room-temperature charging significantly, but cold charging was still inefficient. The team identified the problem: the chemical layer that forms on the surface of the electrode from reacting with the electrolyte. Dasgupta compares this behavior to butter: you can get a knife through it whether it’s warm or cold, but it’s a lot harder when it’s cold. If you try to fast charge through that layer, lithium metal will build up on the anode like a traffic jam.\n“That plating prevents the entire electrode from being charged, once again reducing the battery’s energy capacity,” Manoj Jangid, U-M senior research fellow in mechanical engineering, and co-author of the study.\nThe team needed to prevent that surface layer from forming. They did this by coating the battery with a glassy material made of lithium borate-carbonate, approximately 20 nanometers thick. The addition of this coating sped up cold charging significantly, and when combined with the channels, the team’s test cells were 500% faster to charge in subfreezing temperatures.\n“By the synergy between the 3-D architectures and artificial interface, this work can simultaneously address the trilemma of fast charging at low temperature for long-range driving,” said Tae Cho, a recent Ph.D. graduate in mechanical engineering and first author of the study.\nIn the past two decades, EVs have become more commonplace on roadways as consumers look for better environmental options, but AAA survey results showed that the momentum is hard to maintain. From 2023 to 2024, the number of U.S. adults who would be “likely” or “very likely” to buy a new or used EV dropped from 23% to 18%.\nAnd 63% said they would be “unlikely” or “very unlikely” to make an EV their next vehicle purchase. Part of the concerns are range drops over the winter, combined with slower charging, which was widely reported during the January 2024 cold snap.\n“Charging an EV battery takes 30 to 40 minutes even for aggressive fast charging, and that time increases to over an hour in the winter. This is the pain point we want to address,” Dasgupta said.\nFollow-on work to develop factory-ready processes is funded by the Michigan Economic Development Corporation through the Michigan Translational Research and Commercialization (MTRAC) Advanced Transportation Innovation Hub.\nThe devices were built in the U-M Battery Lab and studied at the Michigan Center for Materials Characterization.\nThe team has applied for patent protection with the assistance of U-M Innovation Partnerships. Arbor Battery Innovations has licensed and is working to commercialize the channel technology. Dasgupta and the University of Michigan have a financial interest in Arbor Battery Innovations.\n\n                    412 Maynard St.\n                    Ann Arbor, MI 48109-1399\nEmail[email protected]\nPhone734-764-7260\nAbout Michigan News\n\nOffice of the Vice President for Communications\n                © 2025 The Regents of the University of Michigan",
        "keywords": [
            "charging",
            "battery",
            "fast charging",
            "Arbor Battery Innovations",
            "Li-ion batteries",
            "Michigan",
            "Battery Innovations",
            "cold",
            "cold charging",
            "lithium"
        ]
    },
    {
        "id": "4a868c3a-ec20-4fd8-bc91-8cc59f308906",
        "type": "article",
        "domaine": "engineering",
        "titre": "Fully Functional LEGO Cuckoo Clock Has a Self-Winding Design, Pendulum, and Pop-out Cuckoo Bird",
        "url": "https://www.yankodesign.com/2025/03/19/fully-functional-lego-cuckoo-clock-has-a-self-winding-design-pendulum-and-pop-out-cuckoo-bird/",
        "description": "Fully Functional LEGO Cuckoo Clock Has a Self-Winding Design, Pendulum, and Pop-out Cuckoo BirdIs it just me or does that cuckoo bird look a lot like Perry the Platypus?? LEGO sets have long flirted with mechanical complexity, but...",
        "source": "Yanko Design",
        "author": "Sarang Sheth",
        "date_pub": "2025-03-19T19:15:46Z",
        "contenu": "\nIs it just me or does that cuckoo bird look a lot like Perry the Platypus??\nLEGO sets have long flirted with mechanical complexity, but this cuckoo clock takes things to a different level. It doesn’t just mimic a clock—it is a clock. The movement is weight-driven, using components borrowed from LEGO’s Liebherr Crawler Crane set, and the mechanism is intricate enough to make even seasoned Technic builders take a step back in admiration. A motorized system keeps the clock wound, so it doesn’t run out of power every few minutes. And then there’s the pièce de résistance: the cuckoo, triggered by a proximity sensor that detects the second hand, ensuring it bursts out at just the right moment. It’s whimsical, precise, and completely unnecessary in the best possible way.\nDesigner: marginibuilds\n\n\n\n\n\n\n\nWhat makes this so incredibly fascinating is the level of detail crammed into the design. The clock face features a Black Forest-esque clock design with Roman numerals, a charmingly old-school touch. The hands can be manually adjusted with a side knob, keeping it rooted in the tactile charm of traditional timepieces. And then there are the feet, which are, for reasons unknown, made from LEGO frog pieces and gold Hagrid hair. This is the kind of design choice that reminds you LEGO builders operate on a different wavelength from the rest of us.\n\n\n\n\n\n\n\nThis clock feels like a love letter to LEGO’s greatest hits. It blends the intricate engineering of Technic sets with the nostalgic appeal of LEGO’s more decorative models, like the retro typewriter or grand piano. But it’s also deeply rooted in history—cuckoo clocks trace their origins to the Black Forest region of Germany, where master clockmakers spent centuries perfecting their designs. The LEGO version pays homage to that legacy while simultaneously flipping it on its head.\n\nIt’s a Technic-heavy build, sure, but it also requires a certain level of patience and problem-solving. It forces you to engage with the mechanics of time itself, watching as gears and weights interact to keep things moving. And, of course, every 60 seconds, you’re rewarded with the satisfying cuckoo! of a tiny LEGO bird emerging from its plastic sanctuary. I’m not saying you have to give it a top-hat, but if you did, it would absolutely look like a Perry The Platypus Cuckoo Clock!\n\nAs much as this set would be an engineering marvel, it also taps into something deeper: the way LEGO continues to surprise us. At this point, it should be impossible to be shocked by what people can build with these bricks. Yet, time and time again, a project like this comes along and rewires our expectations. A fully functional cuckoo clock should be an absurd proposition, something relegated to the realm of “wouldn’t it be cool if?” Yet, here it is, proving that LEGO’s true magic lies in its ability to turn the impossible into something tangible.\n\nThe real question now is whether LEGO will actually greenlight this as a set. There’s precedent—complex, nostalgia-driven builds aimed at adult fans have been a growing trend. But even among LEGO’s most intricate designs, this one stands out. It’s not just a display piece; it’s something you’d actually use. And that alone makes it one of the most compelling LEGO ideas in years.\n\nI’ve always been a fan of tech that blends seamlessly into everyday use. When smart speakers were first introduced, they weren’t designed to look like…\nMeet the Dynamic Folio – a case from the folks at MOFT that elevates your iPad. Literally. And at multiple heights and angles, that too….\nThe Spielbein chair was designed with vertical legs on one side and two tilted ones on the other to solve group seating arrangements. Its basic…\nEmotional attachment with worldly goods in not healthy! Look at me; I’m a wreck coz I broke my favorite coffee mug. Curse the moment when…\nWith all the comfort of Herman Miller’s Embody with none of its neurotic over-engineering, the 35 H Lounger from Designer Frédéric Sofia lets the eye…\nImagine sinking into a couch that envelopes you from the sides and gives you true “quiet space.” This multifunctional couch called the Transformer SHELL Sofa…\nWe’re an online magazine dedicated to covering the best in international product design. We have a passion for the new, innovative, unique and undiscovered. With our eyes firmly focused on the future.\nEditorial Standards and Ethics / Privacy Policy",
        "keywords": [
           
            "LEGO",
           
            "with",
            "clock",
            "Perry the Platypus",
            "Liebherr Crawler Crane",
            
            "cuckoo"
        ]
    },
    {
        "id": "1de5b3ea-3d0a-4fda-827a-79b1c5cd52d3",
        "type": "article",
        "domaine": "engineering",
        "titre": "Engineers redefine how heat transfers on advanced surfaces",
        "url": "https://www.sciencedaily.com/releases/2025/03/250326154428.htm",
        "description": "Scientists have developed a new theory to explain heat transfer on advanced surfaces. The theory is critical to the researchers' work to develop innovative surfaces for applications such as harvesting water from air without electricity.",
        "source": "Science Daily",
        "author": null,
        "date_pub": "2025-03-26T19:44:28Z",
        "contenu": "When University of Texas at Dallas researchers tested a new surface that they designed to collect and remove condensates rapidly, the results surprised them.\nThe mechanical engineers' design collected more condensates, or liquid formed by condensation, than they had predicted based on a classic physics model.\nThe finding revealed a limitation in the existing model and inspired the researchers to develop a new theory to explain the phenomenon, which they outline in an article published online March 13 in the physical science journal Newton.\nThe theory is critical to the researchers' work to develop innovative surfaces for applications such as harvesting water from air without electricity.\n\"This new theory can help us better design surfaces that condense water or other fluids,\" said Dr. Xianming (Simon) Dai, the study's corresponding author and associate professor of mechanical engineering in the Erik Jonsson School of Engineering and Computer Science.\nDai develops surfaces for a range of applications, including water harvesting and refrigeration. His goal is to develop a surface that collects and removes condensed droplets quickly in a continuous process.\nThe researchers' new theory addresses rolling droplets, or small droplets that roll off a surface during dropwise condensation, a process in which vapor condenses on a surface and forms tiny liquid droplets. Dropwise condensation is favorable for surfaces that aim to shed condensates quickly because the drops roll off and clear the surface faster, making room for the surface to collect more condensates.\nDeepak Monga PhD'24, a research scientist in Dai's lab, noticed that a new surface he was working on contained areas that did not show visible droplets. Indeed, conventional theory does not consider condensation in those areas.\nAfter further investigation, the researchers discovered that the areas actually had contributed to condensation, counter to the half-century-old theory's prediction. The droplets were so early in the formation process that they are invisible. The classical theory did not consider the speed at which the new surface could collect and shed these condensates.\n\"It's all about speed. The classical heat transfer theory does not account for the high speed at which our newer surface removes condensates,\" said Monga, the paper's lead author. \"In the new model, we included disappearing frequency to accommodate the high-speed rolling.\"\nDr. Yaqing Jin, assistant professor of mechanical engineering, led the experiments to measure and visualize the activity of the tiny water droplets by integrating a time-resolved particle image velocimetry system with a long-distance microscope, which records the flow and motions of microscopic particles inside a small droplet.\n\"The system has a very high resolution, which allows you to see the flow velocity and distribution of a small droplet, so we can understand how this small droplet is rolling or sliding across a surface,\" Jin said.\nMonga has used the new theory to design a surface, which he presented at The American Society of Mechanical Engineers' 2024 Summer Heat Transfer Conference and earned a best presentation award.\nThe research was supported by a Defense Advanced Research Projects Agency Young Faculty Award, a National Science Foundation Faculty Early Career Development Program (CAREER) award, and the Department of Energy.\nOther co-authors of the paper include mechanical engineering doctoral student Dylan Boylan; research associate Dhanush Bhamitipadi Suresh MS'21, PhD'24; Jyotirmoy Sarma MS'18, PhD'22; and Dr. Pengtao Wang from Oak Ridge National Laboratory.\nStory Source:\nMaterials provided by University of Texas at Dallas. Original written by Kim Horner. Note: Content may be edited for style and length.\nJournal Reference:\nCite This Page:\nStay informed with ScienceDaily's free email newsletter, updated daily and weekly. Or view our many newsfeeds in your RSS reader:\nKeep up to date with the latest news from ScienceDaily via social networks:\nTell us what you think of ScienceDaily -- we welcome both positive and negative comments. Have any problems using the site? Questions?",
        "keywords": [
            "surface",
            "Dai develops surfaces",
            "Dallas researchers tested",
            "theory",
            "droplets",
            "results surprised",
            "remove condensates rapidly",
            "Erik Jonsson School",
            "surfaces",
            "surface removes condensates"
        ]
    },
    {
        "id": "4d41ed4d-3b6c-46dd-b232-b01073932ae6",
        "type": "article",
        "domaine": "engineering",
        "titre": "Pivot Robotics (YC W24) Is Hiring",
        "url": "https://www.ycombinator.com/companies/pivot-robotics/jobs/0sRNlmU-robotics-software-engineer",
        "description": "Roles and Responsibilities\nDesign and develop robust, scalable, and maintainable software for industrial robotic systems.\nImplement motion planning, trajectory optimization, and real-time control algorithms.\nDevelop vision-based automation by integrating sens…",
        "source": "Hacker News",
        "author": null,
        "date_pub": "2025-03-12T12:00:28Z",
        "contenu": "AI for Robot Arms in Factories\nPivot Robots (YC W24) is building the AI brain for robot arms for high-mix manufacturing.\nPivot Robots combines off-the-shelf robots and vision sensors with recent breakthroughs in foundation vision models to give industrial robot arms the power to adapt. Our first product directly addresses the dangerous and unpopular task of grinding metal parts. Currently, our software is being deployed on 10+ robots at a large cast iron foundry.\n© 2025 Y Combinator",
        "keywords": [
            "Robot Arms",
            "Pivot Robots",
            "industrial robot arms",
            "Arms in Factories",
            "Pivot Robots combines",
            "Robots",
            "Factories",
            "Arms",
            "Robot",
            "give industrial robot"
        ]
    },
    {
        "id": "68823ee7-81ab-481a-a460-7ff32c1cd839",
        "type": "article",
        "domaine": "engineering",
        "titre": "I started a nonprofit to fight ALS after my husband's death. Here's how tech and AI can help us find a cure.",
        "url": "https://www.businessinsider.com/indu-navar-nonprofit-everything-als-ai-tech-silicon-valley-2025-3",
        "description": "After her husband passed away from ALS, Indu Navar started an organization that uses AI to study ALS and other neurological diseases.",
        "source": "Business Insider",
        "author": "Katie Balevic",
        "date_pub": "2025-03-30T19:58:06Z",
        "contenu": "This is an As-Told-To essay based on a conversation with Indu Navar, the CEO and Founder of EverythingALS. It has been edited for length and clarity.\nBoth my husband and I have been on the ground floor building technology that changed the world.\nI have degrees in electrical engineering and computer science. I started my career at NASA and was on the founding team of what is today's WebMD. Then, I started another company that I ran for 14 years. After that, I was investing and advising. I've always been fascinated with big data and building analytics on top of it. My husband, Peter Cohen, worked at Amazon for about 18 years. He joined around 1996 or 1997 and built Amazon Mechanical Turk, a crowd-sourcing marketplace.\nLife was really good. Here we are making change. He was still in his late forties, and then he started saying, \"Hey, I think something is wrong with my ankle. It's not dorsal flexing.\"\nWe're like, \"Oh, no big deal, it's just an ankle issue.\" No, it was a spine issue. Oh no, it was a brain issue. It took us two years to figure out that it was actually ALS, which is degenerative. The method of diagnosing ALS is called elimination, so you eliminate other diseases and problems. I think we spent over $100,000 just to diagnose it.\nEvery 90 minutes, somebody is getting diagnosed with ALS, and they're hearing the same diagnosis they heard 80 years ago. You have 2 to 5 years to live from your first symptom. That's what shocked me. It takes a long time to get diagnosed, and we diagnose late compared to other diseases, like cancer. A lot of people pass away without even being diagnosed.\nPeter was diagnosed in 2018 and passed away in 2019. It shook us. It shook us in a way that, as entrepreneurs and as problem solvers, we ask how this is in such a dire state where we haven't done something about it in 80 years? This problem is very opaque until you've gone through it.\nI started a nonprofit in his name called the Peter Cohen Foundation. My goal is to be able to say that he helped cure ALS with what he went through. We used to talk all the time about what we would do differently if we knew this problem existed before it happened to us.\nOur goal with the Peter Cohen Foundation and EverythingALS is to bring technology innovations to ALS and other neurodegenerative diseases. We do everything from monitoring and assessing what is happening in clinical trials and using sensors to predict what will happen. The sensors measure patients' speech, breathing, walking, and fine motor skills.\nToday, we don't actually have the tools to figure out if the drug you give a patient is really working because the way they evaluate your deterioration is by asking you, \"On a scale of 1 to 4, how is your speech? How is your walking? How easy is it for you to cut your food?\" For us, we're vegetarians. We don't cut our food, so how would we know how to answer that? It's called a patient-reported outcome, and a lot of the questioning has not evolved in years.\nBy using sensors, we don't have to wait for you to get to the point where you can't do things. We can actually predict where you're going to be in 3, 6, 9, or 12 months. We'll use them for early diagnosis. We've digitized a lot, and our algorithm is in clinical trials.\nWe call it citizen-driven research because we go directly to patients and do research with people who are being affected by the disease, so we can get thousands of people involved. We send the sensors to them, they wear them, and we monitor them remotely.\nWe have an EverythingALS app that lets patients talk to others who have ALS and have gone through this journey. They can also talk to our LLM-based generative AI tool, but it's not like talking to ChatGPT. Our AI is really walled off and trained only with the data we have and the 220 hours of experts who have spoken to us. It's a very trusted dataset.\nRight now, we are moving to applying our process to our first other disease, which is Alzheimer's. Huntington's and Parkinson's will be in the near future as well. Our goal is to move the needle and fill the gap. We just felt like there was an unmet need in terms of how we care for people, and if you don't care for people, you'll never come up with a cure.\nJump to",
        "keywords": [
            "Indu Navar",
            "CEO and Founder",
            "conversation with Indu",
            "Peter Cohen Foundation",
            "essay based",
            "Peter Cohen",
            "ALS",
            "years",
            "Navar",
            "Indu"
        ]
    },
    {
        "id": "58660cd9-f97d-479a-981e-fe7d4626e5d7",
        "type": "article",
        "domaine": "engineering",
        "titre": "Industrial Design Case Study: Speck Design Tackles a Smart Frying Pan",
        "url": "https://www.core77.com/posts/135980/Industrial-Design-Case-Study-Speck-Design-Tackles-a-Smart-Frying-Pan",
        "description": "When a startup called Smartypans wanted to create a smart cooking pan, they contracted industrial design and engineering consultancy Speck Design. The firm brought six of their skillsets to bear on the project, which aimed to combine technology with user-frie…",
        "source": "Core77.com",
        "author": "Rain Noe",
        "date_pub": "2025-03-21T14:00:00Z",
        "contenu": "When a startup called Smartypans wanted to create a smart cooking pan, they contracted industrial design and engineering consultancy Speck Design. The firm brought six of their skillsets to bear on the project, which aimed to combine technology with user-friendly design.\nElectrical Engineering\n \n \n \n\n \n\n \n \n\n\n\n \n\n\n \n \nYou can see more of Speck Design's work here. \n\n\nA frying pan with an app...NOPE.\nTest it out; it only takes a single click to unsubscribe\nY Studios is an award-winning Industrial Design and Research consultancy in San Francisco with exten...\nShark Design is a full service product development company with offices in Hong Kong, Shenzhen (Chin...\nFounded by an award-winning team with over 20 years of combined product design experience, Hatch Duo...\nANDESIGN is an industrial design consultancy based in Orange County California and Austin Texas.\n\nAN...\nWhat is your future in a connected world?\n\nWe create impactful strategies and build beautiful connec...\nAnvil Studios is a product design firm for the real world.\n\nAnvil is Treasure Hinds and Greg Janky. ...\nWe design unique products for startups, companies, and everything in between. We believe good design...\n\nDon't have an account? Join Now\nCreate a Core77 Account\nAlready have an account? Sign In\n\r\n        By creating a Core77 account you confirm that you accept the Terms of Use\n\nPlease enter your email and we will send an email to reset your password.\nTest it out; it only takes a single click to unsubscribe",
        "keywords": [
            "called Smartypans wanted",
            "startup called Smartypans",
            "called Smartypans",
            "Smartypans wanted",
            "smart cooking pan",
            "design",
            "engineering consultancy Speck",
            "Speck Design",
            "contracted industrial design",
            "smart cooking"
        ]
    },
    {
        "id": "8ba1c552-0600-43dc-ba35-c3cdeab55435",
        "type": "article",
        "domaine": "engineering",
        "titre": "AV1 is supposed to make streaming better, so why isn’t everyone using it?",
        "url": "https://www.theverge.com/tech/635020/av1-streaming-netflix-youtube-google-adoption",
        "description": "When you jump into a video on YouTube or Netflix, a lot happens very quickly behind the scenes. Video data is rapidly downloaded to your device, which then has to unpack and normalize that information into a smooth, hiccup-free stream. The process of encoding…",
        "source": "The Verge",
        "author": "Emma Roth",
        "date_pub": "2025-04-02T23:39:53Z",
        "contenu": "Tech’s biggest players are all in on AV1, but competing codecs and technical limitations might be holding it back.\nTech’s biggest players are all in on AV1, but competing codecs and technical limitations might be holding it back.\nby  Emma Roth\nWhen you jump into a video on YouTube or Netflix, a lot happens very quickly behind the scenes. Video data is rapidly downloaded to your device, which then has to unpack and normalize that information into a smooth, hiccup-free stream. The process of encoding and decoding video data has changed greatly over the years, with H.264 (AVC) and its successor H.265 (HEVC) remaining two of the most widely used codecs for streaming.\nBut in 2015, tech giants including Netflix, Microsoft, Google, Amazon, and Meta banded together to develop video compression’s latest evolution: AV1. The companies, which are part of the overarching Alliance for Open Media (AOMedia), say the video codec is around 30 percent more efficient compared to other standards like HEVC and the Google-developed VP9, allowing it to deliver higher-quality video at a lower bandwidth. AOMedia also claims that it’s royalty-free, meaning streaming device makers and video providers shouldn’t have to pay patent holders for using the technology.\nThat all should have been enough for AV1 to take over the video landscape. But even with all these improvements and the backing of some of the biggest names in tech, the codec hasn’t become ubiquitous. Many major names in streaming, including Max, Peacock, and Paramount Plus, still haven’t adopted AV1.\nSince AV1’s debut in 2018, we’ve seen big players hop on board and use the codec for streaming high-resolution content in 4K and 8K. Google began testing AV1 on YouTube in 2018, while Netflix added support for AV1 in 2021. Amazon Prime Video also adopted AV1 in 2021, and the codec is used in Instagram Reels as well as for screensharing in Microsoft Teams. Discord launched support in 2023, and Twitch is working on its implementation. Browsers like Google Chrome, Safari, Microsoft Edge, and Firefox have adopted AV1, too.\nA flurry of devices have adopted AV1 decoders, including TVs, phones, and streaming devices\nAs for everyone else, there are a few reasons why they may not have adopted AV1 yet, and a simple one is hardware. For AV1 to work properly, a device has to have the hardware to support it — or otherwise run potentially resource-intensive software that can handle decoding AV1 content instead. \nWithin the past five years or so, a flurry of devices have adopted AV1 decoders, including TVs, phones, and streaming devices like the latest Amazon Fire TV Stick 4K Max. Chip makers like Nvidia, AMD, and Intel have launched GPUs with the tech. Meanwhile, Apple built an AV1 decoder into its iPhone with the launch of the iPhone 15 Pro in 2023, and it later added AV1 support across the entire iPhone 16 lineup last year. But not every device maker has been keen to adopt the AV1 codec, as Roku accused Google of coercing the company into supporting the standard in 2021, claiming it would drive up costs to consumers.\n“In order to get its best features, you have to accept a much higher encoding complexity,” Larry Pearlstein, an associate professor of electrical and computer engineering at the College of New Jersey, tells The Verge. “But there is also higher decoding complexity, and that is on the consumer end.”\nThere are solutions for devices that don’t have a dedicated AV1 hardware decoder, but they’re just not as efficient. Google, for instance, lets Android app developers enable dav1d, an AV1 decoder developed by VideoLAN. YouTube is just one of the apps that use dav1d, which allows it to beam AV1 videos to users on older or mid-range phones. However, some users on YouTube have reported issues with phone battery life following the implementation.\nRight now, AOMedia says around 95 percent of Netflix’s content is encoded with AV1, as opposed to 50 percent of videos on YouTube. “It’s always going to be the chicken and egg, right?” Hari Kalva, chair and professor of Florida Atlantic University’s department of electrical engineering and computer science, tells The Verge. “Who should build this technology before the [AV1] content exists, versus do they have enough players to play this content?”\nOther standards have emerged in the video compression space, too. VVC, also known as H.266, was developed by the Moving Picture Experts Group (MPEG) and the Video Coding Experts Group (VCEG) — the same groups behind HEVC and AVC. It was finalized in 2020 and is supposed to compress video using 50 percent less data compared to HEVC, a bit more than AV1’s promise of 30 percent efficiency savings. But, unlike AV1, VVC isn’t royalty-free.\nEven with more efficient video compression, AV1 comes with some tradeoffs that could hamper adoption. For one, compressing videos using AV1 takes more time and energy. “In order to get that higher compression, you have to spend more time getting there,” Pierre-Anthony Lemieux, the executive director of AOMedia, said during an interview with The Verge. “As codecs get more efficient, they require more power.”\nThough Lemieux says that AV1 implementers have agreed not to charge for the use of the codec, the group’s royalty-free claim might not be as clear-cut as it’s presented. For years, the companies that implement video compression codecs have had to pay a fee to use the standards, typically through patent pools. Patent pools allow companies to license a group of patents for a certain technology all at once, rather than having to negotiate with individual patent holders. Companies like the Via Licensing Alliance, Access Advance, and Sisvel manage access to patent pools for technologies like HEVC and VVC.\n“Video compression, in particular, is an area that has had many, many smart people working on it for a long time,” Robert Moore, the Principal of Moore IP Solutions, tells The Verge. “The innovations that those people have created are what I would call an IP thicket — basically a very, very challenging environment for anyone to develop technology that is a standard that’s commercially viable.”\n“Our members are working on the next big thing”\nSome pools have since emerged and are claiming royalties on patents used by AV1, as outlined by Streaming Media, with the most recent forming in January 2025. AOMedia responded to the news of the first licensing program in 2019, saying it was “founded to leave behind to leave behind the very environment that the announcement endorses and had settled ‘patent licensing terms up front.’”\nThe European Union also opened an investigation into AOMedia’s licensing policy in 2022 over concerns that its “mandatory royalty-free cross licensing” agreement could stifle innovation, as it could affect “innovators that were not a part of AOM at the time of the creation of the AV1 technical, but whose patents are deemed essential to (its) technical specifications,” according to Reuters. It closed its investigation in 2023 for “priority reasons.”\nThat uncertainty still isn’t stopping AOMedia and its adopters from plowing ahead with AV1 as the future of online streaming — and working on its potential successor. “AV1 is going to be here for forever, probably,” Lemieux says. “But, of course, our members are working on the next big thing, and I expect something later this year.”\nA weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.\n© 2025 Vox Media, LLC. All Rights Reserved",
        "keywords": [
            "video",
            "video compression",
            "streaming",
            "technical limitations",
            "Emma Roth",
            "codec",
            "competing codecs",
            "HEVC",
            "Verge",
            "technical"
        ]
    },
    {
        "id": "e0fea480-130d-4f78-a964-e25467208ee7",
        "type": "article",
        "domaine": "engineering",
        "titre": "Chip Glitching 101 with [Hash]",
        "url": "https://hackaday.com/2025/03/30/chip-glitching-101-with-hash/",
        "description": "Ever want to get into reverse engineering but don’t know where to start? You’re in luck — [Hash] just dropped a case study in chip glitching that should get you off on the right f…",
        "source": "Hackaday",
        "author": "Dan Maloney",
        "date_pub": "2025-03-30T08:00:45Z",
        "contenu": "Ever want to get into reverse engineering but don’t know where to start? You’re in luck — [Hash] just dropped a case study in chip glitching that should get you off on the right foot.\nThe object of this reverse engineering effort in the video below is a Microchip SAM4C32C, removed from one of the many smart electrical meters [Hash] loves to tear into. This microcontroller was supposed to be locked to prevent anyone from sniffing around in the code, but after soldering the chip to a target board and plugging it into a Chip Whisperer, [Hash] was able to find some odd-looking traces on the oscilloscope. Of particular interest was an unusual pattern on the scope while resetting the chip, which led him to an AI-assisted search for potential vulnerabilities. This allowed him to narrow down the target time for a power glitch, and in only a few seconds, the chip was forced to bypass its security bit and drop into its boot loader. With the keys to the kingdom, [Hash] was able to read the firmware and find all sorts of interesting tidbits.\nObviously, chip glitching isn’t always as easy as this, and even when a manufacturer leaves a vector like this in the chip, exploiting it does take some experience and finesse. But, if you’re going to get started glitching, it makes sense to start with the low-hanging fruit, and having [Hash] along for the ride doesn’t hurt either.\n\n\nI’ve always wanted to get into this great video!\nIt blows my mind to this day all the kids with reset glitch hacked Xboxes without realising the insanity of the engineering that went into them.\nAgreed! As much as I love soft mods too, some small part of me will definitely miss RGH as Tony Hax comes for the remaining boxes lol.\nThat said, I haven’t owned a 360 since 2012 after my 5th RROD. My modded launch model 60GB backwards compatible PS3 is still working great though, even after being shipped across the country multiple times!\nIf youve read grimdoomers blog or watched MrMario2011 video, youll know the new “exploit” doenst replace the great 1337 RGH3, especially due to it taking alott of time and low success rate. Its a new way to dump and flash your nand tho, less soldering required overall. But rgh3 wins the speed and reliability game.\n“Today I’m going to show you how I found…” vs AI assisted search. Well – algorithm did find this for you so you are here just for a free ride.\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "Hash",
            "chip",
            "reverse engineering",
            "chip glitching",
            "reverse engineering effort",
            "Chip Whisperer",
            "engineering",
            "reverse",
            "glitching"
        ]
    },
    {
        "id": "17b465d7-e961-4491-b79e-59951fa592e5",
        "type": "article",
        "domaine": "engineering",
        "titre": "Linear Pluggable Optics Save Energy in Data Centers",
        "url": "https://semiengineering.com/linear-pluggable-optics-save-energy-in-data-centers/",
        "description": "New OIF electrical standards will enable interoperability, adding another option for faster and more efficient data movement.",
        "source": "SemiEngineering",
        "author": "Bryon Moyer",
        "date_pub": "2025-03-08T19:02:34Z",
        "contenu": "New OIF electrical standards will enable interoperability, adding another option for faster and more efficient data movement.\nLinear pluggable optics (LPO) is garnering more attention as a way to quickly and efficiently move data in and out of server racks, but a lack of standards for connecting the optical modules is slowing adoption at a time when there is growing pressure to reduce power in data centers.\nLPO is the newest of two approaches to solving the power wall problem in data centers. Co-packaged optics (CPO),  a technology whose development precedes LPO, moves optics out of an octal small form-factor pluggable (OSFP) module and into the electrical-component package, eliminating the pluggable module. LPO, in contrast, moves only the DSP functionality out of the pluggable module and places it into a top of rack (ToR) switch so that electrical signals can directly drive the module.\nAlthough LPO saves less power than CPO, one advantage is that it provides better protection from thermal effects, which can cause optical signals to drift, than CPO does.\n“You have to control the temperature of the device in the rack,” said Dick Otte, CEO of Promex. “We’ve seen cases where people are trying to control the temperature of optical devices to as fine as one-tenth of a degree centigrade.”\nThe challenge with LPO is how to ensure that these modules are interoperable. But that’s about to change. The Optical Internetworking Forum (OIF) currently is preparing electrical standards to boost interoperability.\nFiber moves further into the data center\nAlthough fiber has long been employed for intercontinental and other long-haul communications, its utility is growing with shorter links. It has been used to interconnect different buildings within a data center campus for a while, and now it’s being deployed to interconnect server racks.\n“Optical communication/interconnect has continually scaled down in distance while moving closer to the ASIC [that’s sending and receiving signals]. We have seen the transition from long-haul to metro to local-area networks and then into the data center,” said Suresh Jayaraman, senior director of package development at Amkor Technology. “More recently we have seen a flurry of activity in HPC.”\nCopper still pervades within the rack, but fiber connects the ToR switches. The leaf-and-spine network architecture is popular in the data center, with the ToR switch acting as the leaf switch and using fiber to connect to other racks through the spine switches.\n\nFig. 1: Leaf-spine network architecture in a data center. Servers within a rack connect to a top-of-rack) switch that communicates with other racks over fiber through spine switches. Source: Bryon Moyer/Semiconductor Engineering\n“Whenever you have to go from one rack to another rack, you hop through a switch,” said Priyank Shukla, director of product management for interface IP at Synopsys. “This is typically where an optical interface is used.”\nFiber predominantly enters the switches through OSFP modules. “The fiber goes to the top of the racks,” said Otte. “There is relatively little optics within a rack today, and that is sort of one of the next big steps that we’re going to see.”\nThose OSFP modules plug into the switch at the front plate. But the signals driving the fiber originate further inside the switch, so an electrical path is necessary between that source and the plug at the edge. That path is typically an electrical SerDes link, and it contributes significantly to energy consumption.\nThe electrical signals that the SerDes carries drive a DSP chip in the OSFP module, and that chip cleans up the signal, including retiming it, performing equalization, and implementing forward error correction (FEC) and other functions intended to improve reception at the far end of the fiber.\n“Electro-optical interfaces today are based on linear retimed interfaces because the signal you are receiving here gets conditioned in such a way that you recover a clock,” said Shukla. “An optical module generally has one CMOS chip with a physical layer and the digital signal processing.”\nThat DSP chip then converts the digital signals to analog, which drives the optical engine, which modulates a light signal and transmits it. Upon receiving a signal, the DSP retimes and cleans up the received signal before sending it to the switch over the SerDes link.\n\nFig. 2: Simplified traditional optical switch connection. Signals remain in the digital domain as processed in the switch ASIC and sent across the SerDes to the edge of the switch where an optical module is plugged. Source: Bryon Moyer/Semiconductor Engineering\nOne DSP will do\nAlthough this arrangement works, the DSP consumes a significant amount of energy. Its power is roughly 50% of that of the entire pluggable module. That makes it a target for savings.\nMeanwhile, the switch ASIC has its own DSP for sending signals onto and receiving them from the SerDes. “As the technologies have evolved, the switch SerDes has so much DSP that the functions you have [in the pluggable module] can be implemented by the switch itself,” said Shukla.\nIn other words, the switch’s DSP has become powerful enough to handle both its tasks and the ones being performed in the pluggable module. The promise of LPO is that the DSP in the module is eliminated. What remains is some basic equalization and a transimpedance amplifier (TIA) — and a significant power reduction. “Your switch is directly driving the optics,” said Shukla.\n\nFig. 3: LPO pluggable module. The DSP functionality once in the pluggable module is now in the switch ASIC. What remains in the pluggable module is conversion to analog, the TIA, and continuous-time linear equalization (CTLE). Source: Bryon Moyer/Semiconductor Engineering\nMost LPO implementations today are in closed systems, where a single company can ensure that all the pieces work together to maximize the power reduction. “Broadcom has publicly shared that they have about 35% power saving,” said Shukla.\nBut for interoperable pluggable optics, LPO in its current form can be difficult. The characteristics of the electrical signals arriving at the module have not yet been specified to guarantee that any LPO module will work in any socket.\n“The challenge of this approach is interoperability,” said Shukla. “The whole premise of the data center is you take one component from one vendor and you can replace it with others. But now, because you don’t have this retiming function, the interoperability between these two has become challenging.”\nStandards for interoperability\nThree standardization projects addressing LPO interoperability are underway. First, there’s now a draft multi-source agreement (MSA) for LPO. MSAs aren’t technically standards. They’re contractual agreements between vendors to produce mutually interoperable components (in a manner that presumably avoids collusion concerns). So they’re de facto standards, and they’re common in the telecom world.\nBeyond that, the OIF has taken up two projects to establish standards that companies not part of the MSA can follow. The first, called the Common Electrical I/O – 112G-Linear Project, sets up electrical standards to ensure interoperability. In addition to LPO, it also serves CPO and near-package optics (NPO) applications. CPO on its own doesn’t require it, however. “LPO defines linear optics for a pluggable form factor, whereas CPO suggests co-packaging electrical and optical dies together,” said Shukla. “It does not mandate linear/non-retimed implementations.”\nA team from the OIF — Jeff Hutchins, vice chair, physical and link layer working group, energy-efficient interfaces at OIF; Yi Tang, vice chair, physical and link-layer working group, electrical at the OIF; and Nathan Tracy, president of the OIF — explained the group’s motivation. “The OIF initiated its linear project prior to the LPO MSA with the specific objective to define an electrical interface that would allow interoperable non-retimed optical modules to enable system-level power savings,” they said.\nThe second project, called the Retimed TX Linear RX (RTLR) Project, sets up a retimer for transmission only. The lack of a retimer in LPO constrains the distance that signals can run while still being recoverable. The old architecture retimes the received signal to clean it up after its journey, but the new retimed transmit/linear receive (RTLR) approach retimes the SerDes signal in the pluggable module prior to sending it out on fiber. That is intended to improve the quality of the fiber signal, allowing it to be recovered without further retiming on the receive side.\n“State-of-the-art RX SerDes can equalize channels,” said the OIF team. “Many of the SerDes use linear equalization techniques, but optical modulators can introduce some nonlinear distortion. This would suggest that signal distortions remaining before the [TX] electro-optical conversion will be somewhat non-linearly transformed. Linear RX techniques therefore cannot compensate for all of that. RTLR cleans up the signal prior to conversion and therefore should improve interop and reach. In addition, the presence of the TX retimer should make the overall system more tolerant to variations between the host and module and provide an opportunity for including diagnostic capability over LPO, something that the hyperscalers like to see.”\nRTLR puts another block back into the module, which will raise power somewhat. While the OIF doesn’t provide power numbers, given the dependency on technology and vendors, it did note some numbers quoted by a well-regarded figure in the industry. “Andy [Bechtolsheim] at Arista has publicly presented 18 pJ/b for [traditional] retimed, 12 pJ/b for RTLR, and 6 pJ/b for non-retimed,” said the OIF team. “Others suggest slightly better or worse numbers, e.g. 18 – 15 pJ/b for retimed.”\n\nFig. 4: RTLR pluggable module. This is similar to LPO, but a retimer in the pluggable module cleans up the transmit signal prior to converting to optical. The signal quality should then be good enough to receive it without retiming. Source: Bryon Moyer/Semiconductor Engineering\nWhat’s unusual about these standards is that, typically, electrical standards are set by various IEEE groups while the OIF specifies optical standards. “The OIF is defining electrical parameters for optical compliance,” said Shukla. “This is the first time the ecosystem is saying, ‘If you do this electrically, you will need this optical spec.’”\nAs to spec availability, the linear spec is close to ready. “It’s in draft stage, but it’s a technically complete draft,” said Shukla. The OIF wasn’t specific on expected availability, however. RTLR will follow the linear one, and it will have multiple parts. “RTLR has been separated into two efforts, one at 112G and another at 224G,” said the OIF team. “The 112G will be available sooner than the 224G.“\nAhead of, but not replacing, CPO\nThe question remains as to how LPO and CPO will coexist once CPO achieves commercial traction. CPO has taken the spotlight for years with the promise of eliminating the SerDes link altogether and saving yet more energy. But it still faces development challenges, and the newer LPO is likely to be commercialized ahead of it.\nNevertheless, given the promise of yet more energy savings, work on CPO is expected to continue. “Linear CPO will definitely save more power than LPO as the channel between electrical and optical die is extremely small in CPO,” said the OIF team.\nMeanwhile, LPO should be able to run initially from a half to a full meter — plenty to get from one part of the PCB to the other. But it may also be improved to run many meters, making it usable more widely within a data center campus. Whether CPO will eventually take over is unclear. Experience with LPO ahead of CPO’s availability should help determine whether there are markets for both.\nReferences:\n\nFig. 5: Small Form-factor Pluggable. Photography by Christophe Finot, CC BY-SA 3.0, https://commons.wikimedia.org/w/index.php?curid=50571220\nRelated Reading\nSilicon Photonics Manufacturing Ramps Up\nThe promise of photonics ICs is spurring innovation, but complex processes and a lack of open foundries are keeping it from reaching its full potential.\nPhotonics Could Reduce The Cost Of Lidar\nKnown as the workhorse technology for long-haul communications, photonics now plays a very different kind of role.\nComment * \nName*(Note: This name will be displayed publicly)\nEmail*(This will not be displayed publicly) \n \n\n\n\nΔ",
        "keywords": [
            "LPO",
            "pluggable module",
            "OIF",
            "module",
            "CPO",
            "LPO pluggable module",
            "optical",
            "switch",
            "pluggable",
            "DSP"
        ]
    },
    {
        "id": "84885f07-ebe2-4fd1-ba52-3959ee32b385",
        "type": "article",
        "domaine": "engineering",
        "titre": "Meet Jensen Huang, Nvidia's founder and CEO",
        "url": "https://www.businessinsider.com/jensen-huang",
        "description": "Nvidia founder and CEO Jensen Huang rose from his first job at Denny's, where the idea for his company was born, to leading a chipmaking giant.",
        "source": "Business Insider",
        "author": "Sarah Jackson",
        "date_pub": "2025-03-18T04:30:01Z",
        "contenu": "The AI arms race has been good business for Nvidia, which supplies the highly in-demand chips used by many Big Tech giants and startups alike to train AI models.\nThat's also been good news for Nvidia founder and CEO Jensen Huang. In 2024, he shot into Forbes' list of the world's 10 wealthiest people as business boomed for Nvidia.\nHuang and fellow Nvidia founders Curtis Priem and Chris Malachowsky planted the seed for Nvidia at a Denny's in northern California in 1993. Today, it's a household name in the AI industry, and Huang is the billionaire businessman leading it.\nHere's a look at Jensen Huang's career rise and background.\nHuang was born in Taiwan in 1963. He spent some of his childhood there and in Thailand before his parents sent Huang and his brother to the US to live with an uncle in Tacoma, Washington.\nHis uncle sent him to Oneida Baptist Institute in Kentucky but after Huang's parents immigrated to the US, the family lived in Oregon. He graduated from high school at age 16 before going to college. Huang got his bachelor's degree in electrical engineering from Oregon State University and his master's degree in electrical engineering from Stanford University.\nHuang got his first job at 15. He washed dishes and bussed and waited tables at a Denny's in Portland.\nBefore founding Nvidia, Huang worked at computer chip manufacturer LSI Logic from 1985 to 1993 and at semiconductor company AMD, or Advanced Micro Devices, from 1984 to 1985.\nAt a Denny's in 1993, Huang and his Nvidia co-founders, Curtis Priem and Chris Malachowsky, came up with the idea that would eventually lead to Nvidia's creation.\nIn 1999, the company released the GeForce 256, which it called the first graphics processing unit, or GPU.\nToday, Nvidia is instrumental in the generative AI industry, supplying the coveted chips that tech companies use to train AI models.\nInterest in Nvidia's chips amid the AI boom has pushed the company to new heights.\nIn one notable milestone, Nvidia's market cap passed $3 trillion in 2024 to briefly overtake Apple as the world's most valuable company.\nHuang's net worth is $105.4 billion, according to Forbes.\nHuang's management and leadership style sees him skipping 1-on-1 meetings, managing around 60 direct reports as CEO, giving feedback publicly, and sending his staff hundreds of emails a day.\nCurrent and former Nvidia employees previously told BI that Huang is a hands-on boss with high expectations and meticulous attention to detail who values owning up to your mistakes.\nHuang has said he has workaholic tendencies, logging 14-hour days and working on holidays.\nHe has a tattoo of Nvidia's logo on his shoulder, which he agreed to get when the company's stock price hit $100 per share.\nHuang's black leather jacket has also become a famous part of his wardrobe — a staple piece he often wears when giving keynotes or showing off a new product.\nNvidia's other founders, meanwhile, have stayed further out of the spotlight than Huang.\nPriem was Nvidia's chief technical officer from 1993 to 2003, and Malachowsky is a senior technology executive at Nvidia.\nAfter Nvidia went public in 1999, Priem put more than three-quarters of his Nvidia shares into his Priem Family Foundation and by 2006, he'd sold the rest of his shares. He was left with a fortune of roughly $30 million, Forbes estimated in 2023.\nHuang met his now-wife, Lori, while still attending Oregon State University. The couple share two children: Madison Huang is a director of product and technical marketing at Nvidia, and Spencer Huang is a product line manager at the company.\nHuang and Lisa Su, CEO of Nvidia's rival chip giant AMD, are distant cousins.\nHe has a home in Silicon Valley, as Nvidia is headquartered in Santa Clara, California.\nHuang has been president, CEO, and a member of Nvidia's board of directors since the company's creation. He and Nvidia haven't said much about succession planning.\nHe was elected to the National Academy of Engineering in 2024 and has received the Semiconductor Industry Association's highest honor, the Robert N. Noyce Award.\nIn past years, The Economist has named Huang the world's best CEO, Fortune has dubbed him its Businessperson of the Year, and TIME has included him in its yearly list of the world's 100 most influential people.\nAs of March 2024, Huang owned roughly 3.79% of the company's outstanding shares, according to a proxy statement. He is Nvidia's largest individual shareholder.\nJump to",
        "keywords": [
            "Nvidia",
            "Huang",
            "CEO Jensen Huang",
            "Big Tech",
            "Oregon State University",
            "Big Tech giants",
            "Jensen Huang",
            "highly in-demand chips",
            "Nvidia founders Curtis",
            "company"
        ]
    },
    {
        "id": "dbe8ac5f-b16e-4be2-93a8-c6ec2c705ae6",
        "type": "article",
        "domaine": "engineering",
        "titre": "Turning Down the Noise on SMPS",
        "url": "https://hackaday.com/2025/03/17/turning-down-the-noise-on-smps/",
        "description": "On paper, electricity behaves in easy-to-understand, predictable ways. That’s mostly because the wires on the page have zero resistance and the switching times are actually zero, whereas in real life …read more",
        "source": "Hackaday",
        "author": "Bryan Cockfield",
        "date_pub": "2025-03-17T23:00:01Z",
        "contenu": "On paper, electricity behaves in easy-to-understand, predictable ways. That’s mostly because the wires on the page have zero resistance and the switching times are actually zero, whereas in real life neither of these things are true. That’s what makes things like switch-mode power supplies (SMPS) difficult to build and troubleshoot. Switching inductors and capacitors tens or hundreds of thousands of times a second (or more) causes some these difficulties to arise when these devices are built in the real world. [FesZ Electronis] takes a deep dive into some of the reasons these difficulties come up in this video.\nThe first piece of electronics that can generate noise in an SMPS are the rectifier diodes. These have a certain amount of non-ideal capacitance as well as which causes a phenomenon called reverse current, but this can be managed by proper component choice to somewhat to limit noise.\nThe other major piece of silicon in power supplies like this that drives noise are the switching transistors. Since the noise is generally caused by the switching itself, there is a lot that can be done here to help limit it. One thing is to slow down the amount of time it takes to transition between states, limiting the transients that form as a result of making and breaking connections rapidly. The other, similar to selecting diodes, is to select transistors that have properties (specifically relating to inherent capacitances) that will limit noise generation in applications like this.\nOf course there is a lot more information as well as charts and graphs in [FesZ]’s video. He’s become well-known for deep dives into practical electrical engineering topics like these for a while now. We especially like his videos about impedance matching as well as a more recent video where he models a photovoltaic solar panel in SPICE.\n\n\nWhen the subject at hand is noise, it strikes me as fortunate that the switching times AREN’T “actually zero”. The faster the edge, the higher the harmonic content. Sure, fast switches are more efficient – but they also generate more RF energy at higher frequencies.\nI find that a fun thought experiment. At what point for getting switching times shorter/more square would a device necessarily be emitting gamma rays as harmonics.\n“Switching” is modulating the current or flow of electrons in a circuit.  That raises the question of “What does modulating current even mean, when the wavelength is smaller than an atom?”\nI thought FesZ was mostly for RF and filter stuff but I am pleasantly surprised to find power electronics as well.\nAnother high recommendation for power electronics is professor Sam Ben-Yaakov\nWell, if he’s coming from the filter/RF side, that explains the use of gate resistors. As an energy guy you try your best to minimize them. You choose a beefy gate driver (which is completely defeated by even a 15 Ohm gate resistor) and low gate capacitance FETs to get as steep as possible switching, and to keep the voltage spikes on the power side under control, you design low inductance current paths to the filter capacitors. This automatically reduces emitted noise. To get more efficiency (and lower noise) you leverage some resonances to get zero voltage switching or zero current switching.\nIf you f’d up the design and have no time to do another iteration, the gate resistors may buy you some db of noise by killing efficiency, but if you use them as the main part of your noise control, you may as well use a linear regulator.\nThe gate resistors can also be used to reduce the likelihood of oscillation and ringing. Yes, that’s mostly a problem in the analog realm, but it’s my understanding that it can also appear transiently in switching applications, showing up as ‘messy’ edges.\nCarefully chosen ferrite beads on the gate leads can be a good compromise here. And whether you’re using resistors or ferrite, as you mentioned you need to pay close attention to gate capacitance. I wonder how many power supplies behave erratically after they’ve been repaired because that “exact replacement” MOSFET wasn’t exact enough.\nIf you want a really deep dive, MIT have put up their course 6.622, Power Electronics on You Tube. Here’s the first lecture from David Perreault, and another 37 follow that.\nhttps://www.youtube.com/watch?v=f7oXhDatwtY\nIf you want to jump ahead, methods of soft-switching to reduce the switching spikes are discussed in lectures 33 and 34.\nCan’t recommend these lectures enough.\nAre diodes and switching component susceptible to age with time, and can this degrade the performances and increase noise? In other words, when repairing or restauring an old SMSP, is replacing diodes or switching driver should be considered?\nI’m looking forward to how other folks here may answer  your question. In my experience diodes, MOSFETs, and other semiconductors don’t really age unless they’ve been subjected to excess heat, current, or voltage – the latter includes static discharges.\nIt’s possible for just about any semiconductor to be damaged in such a way that its characteristics change, and/or it fails some arbitrary amount of time after the damage occurs. But in general, outside of what i might call “stress damage” they don’t age in the same way that capacitors and other passive components do. As far as I can tell…\nThermal cycles and humidity may cause ageing, too, where the thermal cycles have to be seen on die level (the heat transfer from die to case goes with the thermal gradient, so with a constant case temperature, a little conduction losses and lots of switching losses the die temperature jumps around a lot during normal operation); the cycles may cause crack propagation on bond wires and enclosure sealing, which in turn may start to allow humidity to creep into and degrade the silicon. The housing may also crack due to mechanical stress, so don’t bend the diodes legs too close to the glass body. That said, I haven’t yet heard of semiconductor ageing outside high performance circuitry (megawatt scale inverters…) as common problem, too.\nI wouldn’t worry too much about that.  I worked in applications engineering in the mid-1980’s in a place that made VHF and UHF power transistors, mostly for military radars and communications.  I did not get involved with the wafer fab and certain details of they physics, only the application.  When someone in the lab would have a tiny transistor putting out short pulses of hundreds of watts for a radar, the whine from the violent expansion and contraction cycle from the power pulses could be heard all over the lab, yet these things had a respectable lifetime.  As for humidity, the dice (ie, the actual silicon chips) were passivated, which I understand is kind of like coating them with a few nanometers of glass.\nAround 1993, I designed a Maxim switching-regulator IC into one of our products for aircraft.  A couple of years after we had it in production, Maxim changed the process, making the switching edges faster, without telling us.  Suddenly we had a whole batch of assembled PC boards that made a lot of electrical noise that was getting into the aircraft radios.  We couldn’t afford to scrap the boards and take the time for a re-design, so we had to manually modify them by soldering capacitors directly to IC leads, with no lead length (because of lead inductance), and put ferrite beads over interface wires.  Subsequent designs incorporated what I learned there, by adding SMT ferrite beads and an extra LxC filter at the output.\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "switching",
            "noise",
            "switching times",
            "power",
            "gate",
          
            "power electronics",
            "power supplies",
            "time",
            "gate resistors"
        ]
    },
    {
        "id": "0ad51e41-10f8-4f31-92fd-bb48069a63a7",
        "type": "article",
        "domaine": "engineering",
        "titre": "Open Source Hardware Certifications for March 2025",
        "url": "https://makezine.com/article/technology/open-source/open-source-hardware-certifications-for-march-2025/",
        "description": "Check out four excellent new open source hardware certifications for March 2025.\nThe post Open Source Hardware Certifications for March 2025 appeared first on Make: DIY Projects and Ideas for Makers.",
        "source": "Makezine.com",
        "author": "Laura Rivet",
        "date_pub": "2025-04-04T17:00:00Z",
        "contenu": "Read about the latest maker projects, skills, tool reviews and more.\nGet hands-on with kits, books, and more from the Maker Shed\nFind projects for young makers\nSkill builder, project tutorials, and more\nSubscribers' Digital Portal\nFind a faire.\nFind a Makerspace near you\nStart a local Maker Faire\nShare a book or article proposal\nA podcast from Make: founder, Dale Dougherty\nBecome a Make: Ambassador\nMaker Shed, the official store of Make:\nSubscribe to the premier DIY magazine today\nA comprehensive community driven directory\nAn archive of faires and projects across the globe\nLaura Rivet loves all things harm reduction and has worked with communities across New York State to improve accessibility to health care and educate folks about harm reduction techniques that empower and reinforce positive change. She loves solar energy, composting and hates single use plastics. Laura spends most of her time connected to the outdoors- hiking, camping, bird watching, swimming and drinking dirty martinis.\nAvinash Baskaran is a skilled researcher and engineer dedicated to integrating accessible, scalable open hardware and health technologies to save lives. In the private sector, he designed and fabricated open-source autonomous robots that prevented life-threatening injuries and disease transmission both in the U.S. and abroad. As a NASA Space Grant Ph.D. Fellow at Auburn University, Avinash conducted cutting-edge research in computational neuromechanics and robust optimal control of robotic exoskeletons for astronaut health and performance. He also led Internal Review Board (IRB)-approved human participant protocols, leveraging advanced technologies like surface electromyography (sEMG), electroencephalography (EEG), inertial measurement units (IMUs), functional electrical stimulation (FES), and robotic exoskeletons. Avinash’s career has been defined by driving innovation at the forefront of human knowledge, driven by his belief that open-source medical hardware can break down barriers to life-saving technologies where they are needed most.\nThe Open Source Hardware Association (OSHWA) runs a free program that allows creators to certify that their hardware complies with the community definition of open source hardware.  Whenever you see the certification logo, you know that the certified hardware meets this standard.\nCurrently, the certification database boasts an impressive 2992 individual certifications! In March, we added a fabulous array of 20 new certifications, ranging from smart tennis rackets to mini wind tunnels — talk about variety! We were thrilled to see new and recurring names pop up. \nHere are four certifications that we think are absolutely worth checking out today.\nUID CZ000006\nImagine diving into a whirlwind adventure with the amazing wind tunnel setup! Comprising three cool units — the wind tunnel, the control, and the measuring unit connected to a PC — it lets you experience airflow magic up to 5 m/s. The measuring unit, powered by the versatile Arduino UNO with Rev.P, is a techie’s dream come true. The 3D printing of wind-tunnel parts makes construction and assembly a breeze and customizing it for future upgrades is a piece of cake! You’ll need some experience with the Arduino platform and guidance from a savvy electrical engineering pro to make the most of this fun-packed setup.\nUID IN000056\nThe team at Maker’s Asylum wanted to tackle the issue of visually impaired individuals struggling with traditional walking sticks. Driven by innovation, they embarked on creating a new smart aid that would revolutionize mobility for the blind.\nTheir journey began with a standard walking stick, to which they attempted to attach sensors, motors, and various electronic components like ESP32 boards, wires, breadboards, and a power supply. They dedicated a day to this endeavor, but with guidance from their mentors, realized their project would encounter more flaws than they could address. They discovered that integrating a new detection system onto an existing one was not the most effective approach.\nUndeterred, the team continued to explore creative solutions, excited by the prospect of making a significant impact on the lives of visually impaired individuals.\nUID US002729\nAdafruit’s TLV320DAC3100 I2S DAC is enchanting to the ears! This little gem offers stereo headphone and mono speaker output, delivering crisp, top-notch audio directly to 16-ohm headphones and 4-8 ohm speakers without the need for an external amplifier. Perfect for all-in-one audio projects! Though it doesn’t need an MCLK signal and can use BCLK as the PLL input, it does require some I2C magic. Fear not, adventurers! A microcontroller paired with Adafruit’s library (compatible with Arduino, CircuitPython, or Python) will set the stage for your audio marvels.\nUID IN000063\nThere are plenty of attempts to add tech to sports gear, but this Smart Tennis Racket is one we Luv! Aahan Prajapati built it to make training more informed without getting in the way of the game. It tracks swing data, impact points, and other useful metrics using onboard sensors, offering a practical way to reflect on your performance. It’s not trying to be flashy — just useful, especially for players who want to improve through feedback, not guesswork.\nYou can keep up with updates on all the latest certifications by following our certification bot on Mastodon or submit your project to be certified today.\n\nWhat will the next generation of Make: look like? We’re inviting you to shape the future by investing in Make:. By becoming an investor, you help decide what’s next. The future of Make: is in your hands. Learn More.\nLaura Rivet loves all things harm reduction and has worked with communities across New York State to improve accessibility to health care and educate folks about harm reduction techniques that empower and reinforce positive change. She loves solar energy, composting and hates single use plastics. Laura spends most of her time connected to the outdoors- hiking, camping, bird watching, swimming and drinking dirty martinis.\nAvinash Baskaran is a skilled researcher and engineer dedicated to integrating accessible, scalable open hardware and health technologies to save lives. In the private sector, he designed and fabricated open-source autonomous robots that prevented life-threatening injuries and disease transmission both in the U.S. and abroad. As a NASA Space Grant Ph.D. Fellow at Auburn University, Avinash conducted cutting-edge research in computational neuromechanics and robust optimal control of robotic exoskeletons for astronaut health and performance. He also led Internal Review Board (IRB)-approved human participant protocols, leveraging advanced technologies like surface electromyography (sEMG), electroencephalography (EEG), inertial measurement units (IMUs), functional electrical stimulation (FES), and robotic exoskeletons. Avinash’s career has been defined by driving innovation at the forefront of human knowledge, driven by his belief that open-source medical hardware can break down barriers to life-saving technologies where they are needed most.\nADVERTISEMENT\nADVERTISEMENT\nADVERTISEMENT\nADVERTISEMENT\nOur websites use cookies to improve your browsing experience. Some of these are essential for the basic\n\t\tfunctionalities of our websites. In addition, we use third-party cookies to help us analyze and understand\n\t\tusage. These will be stored in your browser only with your consent and you have the option to opt-out. Your\n\t\tchoice here will be recorded for all Make.co\n\t\t\tWebsites.",
        "keywords": [
            "Make",
            "Maker Shed",
            "hardware",
            "maker",
            "Internal Review Board",
            "Avinash",
            "Open Source Hardware",
            "NASA Space Grant",
            "health",
            "technologies"
        ]
    },
    {
        "id": "5941c0d8-cd2f-46d5-94ef-26d394cff50e",
        "type": "article",
        "domaine": "engineering",
        "titre": "Speech now streaming from brains in real-time",
        "url": "https://www.theregister.com/2025/04/02/speech_now_streaming_from_brains/",
        "description": "Boosted human-computer interface promises better communication for patients who lost ability to speak\nSome smart cookies have implemented a brain-computer interface that can synthesize speech from thought in near real-time.…",
        "source": "Theregister.com",
        "author": "Thomas Claburn",
        "date_pub": "2025-04-02T07:24:13Z",
        "contenu": "Some smart cookies have implemented a brain-computer interface that can synthesize speech from thought in near real-time.\nDescribed in a paper published in Nature Neuroscience this week, the neuroprosthesis is intended to allow patients with severe paralysis and anarthria – loss of speech – to communicate by turning brain signals into synthesized words.\n\"Our streaming approach brings the same rapid speech decoding capacity of devices like Alexa and Siri to neuroprostheses,\" said Gopala Anumanchipalli – assistant professor of electrical engineering and computer sciences at University of California, Berkeley and co-principal investigator of the study, done in conjunction with UC San Francisco – in a statement.\n\"Using a similar type of algorithm, we found that we could decode neural data and, for the first time, enable near-synchronous voice streaming. The result is more naturalistic, fluent speech synthesis.\"\nThe project improves on work published in 2023 by reducing the latency to decode thought and turn it into speech, which at the time took about eight seconds to produce a sentence.\nAs demonstrated in this video, below, the new process works roughly 8x faster, operating in near real-time.\n\nYoutube Video\n\nIt begins by reading the patient's electrical brain signals after the intent to speak has been formed but before the thought has produced a vocal muscle response.\n\"We are essentially intercepting signals where the thought is translated into articulation and in the middle of that motor control,\" said co-lead author Cheol Jun Cho, UC Berkeley PhD student in electrical engineering and computer sciences, in a statement.\n\"So what we’re decoding is after a thought has happened, after we’ve decided what to say, after we’ve decided what words to use and how to move our vocal-tract muscles.\"\nThe neuroprosthesis works by passing 80ms chunks of electrocorticogram (ECoG) data through a neural encoder and then using a deep learning recurrent neural network transducer model to convert brain signals to sounds. The researchers used a recording of the patient's pre-injury voice to make the model's output sound more like natural speech.\nWhile this particular neuroprosthesis requires a direct electrical connection to the brain, the researchers believe their approach is generalizable to other interfaces, including surgically implanted microelectrode arrays (MEAs) and non-invasive surface electromyography (SEMG).\nThe work builds on research funded by Facebook that the social media biz abandoned four years ago to pursue more market-friendly SEMG wrist sensors. Edward Chang, chair of neurosurgery at the UCSF, who oversaw the Facebook-funded project is the senior co-principal investigator of this latest study.\nCode for the Streaming Brain2Speech Decoder has been posted to GitHub, in case anyone is looking to reproduce the researchers' results. ®\nSend us news\nThe Register   Biting the hand that feeds IT\n\n                        Copyright. All rights reserved © 1998–2025\n\n                    ",
        "keywords": [
            "smart cookies",
            "cookies have implemented",
            "implemented a brain-computer",
            "Nature Neuroscience",
            "speech",
            "synthesize speech",
            "brain signals",
            "Gopala Anumanchipalli",
            "University of California",
            "San Francisco"
        ]
    },
    {
        "id": "0018dddd-00e5-4972-8060-5f42b8dd8359",
        "type": "article",
        "domaine": "engineering",
        "titre": "Risk to Crew Health Due to Electrical Shock (Electrical Shock Risk)",
        "url": "https://www.nasa.gov/directorates/esdmd/hhp/electrical-shock-risk/",
        "description": "It is important to protect humans from unintended electrical current flow during spaceflight. The thresholds for contact electrical shock are well established, and standards and requirements exist that minimize the probability of contact electrical shock. Cur…",
        "source": "NASA",
        "author": "Robert E. Lewis",
        "date_pub": "2025-03-11T20:48:12Z",
        "contenu": "1 min read\nIt is important to protect humans from unintended electrical current flow during spaceflight. The thresholds for contact electrical shock are well established, and standards and requirements exist that minimize the probability of contact electrical shock. Current thresholds were chosen (vs. voltage thresholds) because body impedance varies depending on conditions such as wet/dry, AC/DC, voltage level, large/small contact area, but current thresholds and physiological effects do not change. By addressing electrical thresholds, engineering teams are able to provide the appropriate hazard controls, usually through additional isolation (beyond the body’s impedance), current limiters, and/or modifying the voltage levels. Risk assessment determined that the probability of an event was extremely low, and the most serious consequence is expected to be involuntary muscle contraction.\n+ DAG File Information (HSRB Home Page)\n+ Electrical Shock Risk DAG and Narrative (PDF)\n+ Electrical Shock Risk DAG Code (TXT)\n\nHumans In Space\n\n\n\nMissions\n\n\n\nInternational Space Station\n\n\n\nSolar System\n\n\nNASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery.",
        "keywords": [
            "Electrical Shock Risk",
            "Shock Risk DAG",
            "electrical shock",
            "contact electrical shock",
            "min read",
            "electrical",
            "Shock Risk",
            "Risk DAG Code",
            "Risk DAG",
            "DAG File Information"
        ]
    }
]