[
    {
        "id": "4419cef0-29d7-4b5b-93d5-1381e867fda0",
        "type": "article",
        "domaine": "science",
        "titre": "In Baby Steps, I stumbled through a refreshing kind of open world",
        "url": "https://www.theverge.com/games/638179/baby-steps-preview-ps5-steam",
        "description": "âIs the rage boiling over?â Bennett Foddy asks me as I fall down a wooden plank for the dozenth time. The creator of QWOP and Getting Over It is known for games that can be both frustrating and meditative, pairing challenging physics with thoughtful desig…",
        "source": "The Verge",
        "author": "Andrew Webster",
        "date_pub": "2025-03-28T14:37:38Z",
        "contenu": "The next release from the creators of QWOP and Ape Out launches later this year.\nThe next release from the creators of QWOP and Ape Out launches later this year.\nby  Andrew Webster\n“Is the rage boiling over?” Bennett Foddy asks me as I fall down a wooden plank for the dozenth time. The creator of QWOP and Getting Over It is known for games that can be both frustrating and meditative, pairing challenging physics with thoughtful design. The latest, Baby Steps, is similar — but a whole lot bigger.\nI had a chance to play a chunk of the early portion of Baby Steps at 2025’s Game Developers Conference earlier this month. The game is developed by a trio made up of Foddy, Maxi Boch, and Ape Out creator Gabe Cuzzillo. It starts out pretty silly: you play as a slacker named Nate who is transported to a strange world with little choice but to hike. There are cutscenes where he babbles in confusion at his situation and a handful of characters who aren’t especially helpful. At one point, someone offers Nate a map, and he refuses; there is no gear that aids your adventure in Baby Steps.\nInstead, the game is perhaps the most literal definition of a walking simulator. You move by controlling Nate’s two legs individually to take steps. At first, I couldn’t take more than a few steps before falling flat on my face, which, to be fair, was often hilarious. The physics makes the wipeouts in Baby Steps entertaining to watch. But it was also infuriating. Walking is supposed to be the easy part of a video game; you push the stick forward and go where you want to. But here, even the tiniest obstacle proved troublesome. The first time I saw a small staircase, I wondered how I’d ever make it.\nBut slowly, through a lot of trial and error, I fell into a rhythm. It reminded me a bit of Death Stranding, where I had to carefully pay attention to my movements if I wanted to get anywhere. For just regular walking up a path, this meant timing my steps just right so that I didn’t stumble. For obstacles like logs or staircases, it meant taking my time and carefully placing my foot where it needed to go. It never got easy, but at least I felt in control of my movements after a while.\nBaby Steps takes place in what seems like a fairly large and open world, the kind of place where you can see something on the horizon and go there. The trick, of course, is being able to actually walk toward it. Early on, I came to a fork in the road: on one side was a gently sloping hill that led further up the mountain; on the other, a wooden plank across a muddy slope that led right back down to the bottom. After some deliberation, I attempted to get across the plank and, two steps later, found myself sliding in the mud.\nThe developers tell me that Baby Steps is built on the idea of “self guided play,” meaning there are no artificial obstacles in your way, and you don’t have to worry about things like health or death. It’s just you and the environment. And while it might not seem like it at first, the game isn’t really designed to be punishing. As an example, when I had my big fall down the mountain, it didn’t send me back to the beginning but instead brought me somewhere new that I wouldn’t have seen otherwise. It also taught me an important lesson about taking on challenges I’m ready for.\nI played for less than an hour, but I could already feel myself settling into a contemplative style of exploration I’ve experienced in games like Death Stranding and Breath of the Wild. There were no quests to complete or to-do lists to check off. Just me, my legs, and a serene mountain full of risks and rewards.\nBaby Steps launches later this year on Steam and the PS5.\nA weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.\n© 2025 Vox Media, LLC. All Rights Reserved",
        "keywords": [
            "QWOP and Ape",
          
          
           
            "creators of QWOP",
            "Ape Out launches",
           
            "QWOP",
            "Ape",
            "Andrew Webster"
        ]
    },
    
   
    {
        "id": "23a61372-67b1-4346-946b-8595b6593abb",
        "type": "article",
        "domaine": "science",
        "titre": "$115 million just poured into this startup that makes engineering 1,000x faster — and Bezos, Altman, and Nvidia are all betting on its success",
        "url": "https://venturebeat.com/ai/115-million-just-poured-into-this-startup-that-makes-engineering-1000x-faster-and-bezos-altman-and-nvidia-are-all-betting-on-its-success/",
        "description": "Rescale secures $115 million in Series D funding to accelerate AI physics technology that speeds up engineering simulations by 1000x, backed by tech luminaries including Bezos and Altman.",
        "source": "VentureBeat",
        "author": "Michael Nuñez",
        "date_pub": "2025-04-07T22:26:08Z",
        "contenu": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\nRescale, a digital engineering platform that helps companies run complex simulations and calculations in the cloud, announced today that it has raised $115 million in Series D funding to accelerate the development of AI-powered engineering tools that can dramatically speed up product design and testing.\nThe funding round, which brings Rescale’s total capital raised to more than $260 million, included investments from Applied Ventures, Atika Capital, Foxconn, Hanwha Asset Management Deeptech Venture Fund, Hitachi Ventures, NEC Orchestrating Future Fund, Nvidia, Prosperity7, SineWave Ventures, TransLink Capital, the University of Michigan, and Y Combinator.\nThe San Francisco-based company has drawn support from an impressive roster of early backers including Sam Altman, Jeff Bezos, Paul Graham, and Peter Thiel. This latest round aims to propel Rescale’s vision of transforming how products are designed across industries by combining high-performance computing, intelligent data management, and a new field the company calls “AI physics.”\n“Rescale was founded with the mission to empower engineers and scientists to accelerate innovation by running computations and simulations more efficiently,” Joris Poort, Rescale’s founder and CEO, said in an interview with VentureBeat. “That’s exactly what we’re focused on today.”\nThe company’s origins trace back to Poort’s experience working on the Boeing 787 Dreamliner more than 20 years ago. He and his co-founder Adam McKenzie were tasked with designing the aircraft’s wing using complex physics-based simulations.\n“My co-founder, Adam, and I were working at Boeing, running large-scale physics simulations for the 787 Dreamliner,” Poort told VentureBeat. “It was the first fully carbon fiber commercial airplane, which posed significant engineering challenges. Most airplanes before had always been built out of aluminum, but carbon fiber has many different layers and variables that needed to be optimized.”\nThe challenge they faced was a lack of sufficient computing resources to run the millions of calculations needed to optimize the innovative carbon fiber design. “We couldn’t get enough compute resources. This was 20 years ago, before cloud computing existed,” he recalled. “We had to bootstrap together and cobble together resources from different organizations just to run these large-scale simulations over the weekend.”\nThis experience led directly to Rescale’s founding mission: build the platform they wished they had during those Boeing years.\n“Rescale was founded to build the platform we wish we had, because it took us many years to develop all these capabilities,” Poort explained. “We were really just engineers trying to design the best possible plane, but we had to become applied mathematicians and computer scientists, doing all this infrastructure work just to solve engineering problems.”\nCentral to Rescale’s ambitions is the concept of “AI physics” — using artificial intelligence models trained on simulation data to dramatically accelerate computational engineering. While traditional physics simulations might take days to complete, AI models trained on those simulations can deliver approximate results in seconds.\n“With AI physics, you train AI models on simulation data sets, allowing you to run these simulations over 1,000 times faster,” Poort said. “The AI model provides probabilistic answers—essentially estimates—whereas traditional physics calculations are deterministic, giving you exact results.”\nHe offered a concrete example from one of Rescale’s customers: “General Motors motorsports, they’re designing the external aerodynamics of a Formula One vehicle. They may run thousands of these sort of fluid dynamics, aerodynamic calculations. Normally, these may take, like, about three days on, say, 1000 compute cores. Now, with an AI model, they’re able to do this in like less than a second.”\nThis thousand-fold acceleration allows engineers to explore design spaces much more rapidly, testing many more iterations and possibilities than previously feasible.\n“The really unique advantage of AI physics is that you can verify the answers. It’s just math,” Poort emphasized. “This is different from LLMs, where you might encounter hallucinations that are difficult to validate. Many questions don’t have definitive answers, but in physics, you have concrete, verifiable solutions.”\nThe funding comes amid increasing enterprise investments in technologies that speed up product development. The high-performance computing market has grown to approximately $50 billion, with simulation software reaching $20 billion and product lifecycle data management about $30 billion, according to figures shared by Rescale.\nWhat differentiates Rescale is its “compute recommendation engine,” which optimizes workloads across different cloud architectures in real-time.\n“Our unique differentiation is our technology called the compute recommendation engine. This allows us to optimize workloads in real time across different architectures available across all public clouds,” Poort said. “We support 1,150 different applications with many versions, operating systems, and hardware architectures. When combined together, this creates more than 50 million different possible configurations.”\nThe company’s enterprise customers, which include Arm, General Motors, Samsung, SLB (formerly Schlumberger), and the U.S. Department of Defense, collectively spend over $1 billion annually to power their virtual product development and scientific discovery environments.\nRescale is accelerating its roadmap in three key areas. First, expanding its library of over 1,250 applications and network of more than 500 cloud datacenters. Second, establishing unified data management and digital thread capabilities for all computing workflows. Third, enabling faster engineering through AI.\n“We also have a product called Rescale Data, which focuses on creating an intelligent data layer,” Poort explained. “This is sometimes called the digital thread. Throughout the product lifecycle—whether you’re developing an aircraft, a car, or in life sciences, a medical device or drug—you need to track all that data. If an issue arises, you can look back to see when that data was created, what the input files were, and related information.”\nApplied Materials, one of the investors in this round, has been working with Rescale to enhance its simulation capabilities. Rather than simply accelerating existing processes, the partnership suggests a more profound shift in how engineering knowledge is captured and applied.\nThe most intriguing aspect of Rescale’s approach is how it handles the transition between traditional physics simulations and AI approximations. Unlike language models where verifying accuracy can be subjective, engineering simulations have clear mathematical answers that can be checked. This verification creates a safer pathway for introducing AI into fields where precision and reliability are paramount.\nWhile Poort acknowledges that the concept of a “foundational physics model” — an AI system trained on vast amounts of physics simulation data that could potentially discover new physics — remains aspirational, the company is focused on delivering practical value today through narrow, domain-specific AI models.\n“For quantum computing, it’s still in the commercialization phase,” Poort said, distinguishing his approach from that technology. “At Rescale, our AI physics approach is fundamentally customer-centric. We’re focused on addressing concrete problems that recent advances in AI can solve today, delivering immediate, measurable ROI to our customers.”\nRescale has benefited from the guidance of its high-profile early investors. Paul Graham, who wrote the first check into the company, continues to provide advice on company culture. Sam Altman offers insights into AI and infrastructure. Jeff Bezos brings perspective from his Blue Origin space venture, while Peter Thiel provides counsel on scaling enterprise businesses and working with government customers.\n“Paul Graham was the first investor in the company—the first person who really believed in what we were doing. If you follow his essays, you know he’s been a great mentor, and I still talk to him regularly,” Poort told VentureBeat. “Sam Altman has been a supporter since the early days. He’s an incredibly smart mind in AI, and a valuable resource for understanding the latest developments in infrastructure, AI, and even energy—where all this technology is heading.”\nPoort also elaborated on Bezos’s involvement: “Jeff Bezos brings an interesting perspective because of his space company, Blue Origin,” Poort explained. “We initially worked with space companies as our customers, addressing how aerospace companies could leverage cloud computing technologies.”\nHe added: “Jensen has a unique ability to understand both the technical elements and the future direction of technology. Having partners with long-term vision is super critical. All these individuals are very long-term thinkers, and I’m incredibly grateful to have such enduring partners in the business.”\nAs geopolitical tensions affect industries like semiconductors and defense, Rescale is positioning itself to help customers navigate emerging regulations and shifting supply chains. The company has developed capabilities to work with sovereign clouds — country-specific cloud environments that maintain data within national borders.\n“There is an emergence of sovereign clouds,” Poort noted. “Many countries are developing their own cloud infrastructure for specific use cases. Our strategy is to partner with these providers to deliver services according to customer preferences. If a Japanese customer wants to run on a Japanese cloud, for example, we can accommodate that.”\nWith less than 20% of the high-performance computing market currently in the cloud, Rescale sees significant growth potential as more engineering workflows migrate to cloud environments. The company’s AI physics approach could transform how products are designed across industries, potentially reducing development time and costs while improving performance.\n“The key insight is that with sufficient compute capability, we can achieve much better designs,” Poort said, reflecting on his Boeing experience. What started as a frustrating challenge with limited computing resources has evolved into a vision for how engineers might work in the future. The $115 million investment signals confidence that the gap between design imagination and technical reality is narrowing – not through quantum leaps in physics, but through smarter use of existing data and simulations.\nAnd that 787 Dreamliner wing that started it all? “If you’ve ever flown on a 787 Dreamliner,” Poort said, “you’ll notice its distinctive curved wing design. That’s the wing we helped develop, resulting in an aircraft that’s 20% more fuel efficient.”\n\nIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\nRead our Privacy Policy\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\nAn error occured.\nJoin leaders in enterprise AI for networking, insights, and engaging conversations at the upcoming stops of our AI Impact Tour. See if we're coming to your area!\n© 2025 VentureBeat. All rights reserved.\n\n\t\t\t\t\t\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\t\t\t\t\t\nAn error occured.",
        "keywords": [
            "Rescale",
            "Poort",
            "physics",
            "simulations",
            "data",
            "company",
            "physics simulations",
            "Deeptech Venture Fund",
            "cloud",
            "simulation data"
        ]
    },
   
    {
        "id": "70a55855-228e-448b-a8b5-164e2912e24b",
        "type": "article",
        "domaine": "science",
        "titre": "Wild Video Shows Solar Winds Spiraling Millions of Miles From the Sun",
        "url": "https://gizmodo.com/wild-video-shows-solar-winds-spiraling-millions-of-miles-from-the-sun-2000580999",
        "description": "The ESA/NASA Solar Orbiter's instruments captured an extreme stream of wind from our host star.",
        "source": "Gizmodo.com",
        "author": "Isaac Schultz",
        "date_pub": "2025-03-30T14:00:08Z",
        "contenu": "Behold, the piping host particles of solar wind streaming from our Sun, caught in new footage from the ESA/NASA Solar Orbiter.\nThe video was captured by the orbiter’s Metis instrument, a coronagraph which blocks light directly from the Sun in order to see fainter phenomena in its outer atmosphere, or corona. New research describing the observations was published today in The Astrophysical Journal.\n“In this paper, we present observations by Metis during its perihelion passage of a striking helical radial structure that extended from 1.5 to 3 [solar radii] and lasted for more than 3 hr,” the team wrote. “To the best of our knowledge, these observations are unique, in that they appear to show directly the long-duration outflow of Alfvénic solar wind into the heliosphere.”\nThe solar radius is 432,690 miles (696,347 kilometers), so the structure described by the team extended as far as 1,298,070 miles (2,089,041 kilometers)—it’s a pretty large structure!\nThe video was taken by Metis on October 12, 2022. Metis is the only instrument capable of seeing such subtle features of the solar wind, according an ESA release. The Solar Orbiter regularly catches quirks of the Sun’s extreme physics; just last month, the spacecraft witnessed (and recorded) tiny jets produced near the Sun’s South Pole.\nSolar wind is constantly hitting Earth, with particles sometimes kickstarting aurorae in our planet’s skies. But Metis’ unique capabilities allow researchers to study the solar wind at its source, shedding light not just on the wind but also on the Sun’s inner corona, which produces the particles.\nThe current plan is to keep Solar Orbiter operational through 2026, though the mission could be extended until 2030. We’ll almost certainly have more remarkably intimate looks into our host star before then.\n\nESANASASolar OrbiterSolar windthe Sun \n\r\n          Get the best tech, science, and culture news in your inbox daily.\r\n        \n\r\n          News from the future, delivered to your present.\r\n        \n\r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n    \n\n          Isaacman is Trump’s pick for NASA administrator, marking a major shift for the space agency. The hearing starts today at 10:00 a.m. ET.\n        \n\n          \"It's kind of like losing a best friend.\"\n        \n\n          Mmmm, dusty.\n        \n\n          The rare event revealed never-before-seen behaviors of a planetary atmosphere.\n        \n\n          The Trump administration's chilling effect on science agencies affects more than just funding.\n        \n\n          The Cygnus spacecraft sustained damage on its way to the launch site and was deemed unfit to fly.\n        \nWe may earn a commission when you buy through links on our sites.\n©2025 GIZMODO USA LLC. All rights reserved.\nMode\n\n                Follow us\n              \nMode\n\n                Follow us\n              ",
        "keywords": [
           
            "the Sun",
            "Solar Orbiter",
            "solar wind",
            "The solar",
            "solar",
            "the solar wind",
            "The Solar Orbiter",
            "NASA Solar Orbiter",
            "from the Sun"
        ]
    },
  
    {
        "id": "849778af-f338-4f99-a74d-6a29042ec9e3",
        "type": "article",
        "domaine": "science",
        "titre": "Is Dark Energy Getting Weaker? New Evidence Strengthens the Case.",
        "url": "https://science.slashdot.org/story/25/03/20/1431243/is-dark-energy-getting-weaker-new-evidence-strengthens-the-case",
        "description": "Cosmologists have uncovered stronger evidence that dark energy -- the mysterious force accelerating cosmic expansion -- may be weakening over time. The Dark Energy Spectroscopic Instrument (DESI) collaboration presented their latest findings at the Global Phy…",
        "source": "Slashdot.org",
        "author": "msmash",
        "date_pub": "2025-03-20T15:00:00Z",
        "contenu": "\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tBecome a fan of Slashdot on Facebook\n\n\nNickname:\n\n\n\nPassword:\n\n\n\nNickname:\n\n\n\nPassword:\n\n\n\nThe Fine Print: The following comments are owned by whoever posted them.  We are not responsible for them in any way.\n\nI'll  be sad if there isn't a LUCY team.\nThere is.\nhttps://science.nasa.gov/missi... [nasa.gov]\nThe most simple solution to the problems faced here, is that we don't understand physics. In the same way Newton didn't understand the nature of gravity.\nThe most simple solution to the problems faced here, is that we don't understand physics. In the same way Newton didn't understand the nature of gravity.I have this sneaking suspicion that what we don't know about physics outweighs what we know by a substantial enough amount to make us seem like toddlers trying to understand calculus. Especially astrophysics. There's just so much more out there than we can wrap our puny little minds around, and we've likely barely scratched the surface on the experimentation necessary to understand even gravitational dynamics on the scale of galaxies or superclusters. \"Dark energy\" and \"dark matter\" today seem to just be placeholders for \"all that stuff we don't really have an explanation for yet.\" And while I look forward to seeing what we actually manage to discover, I don't have a lot of faith in us figuring it out within my lifetime. It's just too vast of a field for progress to suddenly speed up enough to actually sort it out that fast.\nThe most simple solution to the problems faced here, is that we don't understand physics. In the same way Newton didn't understand the nature of gravity.\nI have this sneaking suspicion that what we don't know about physics outweighs what we know by a substantial enough amount to make us seem like toddlers trying to understand calculus. Especially astrophysics. There's just so much more out there than we can wrap our puny little minds around, and we've likely barely scratched the surface on the experimentation necessary to understand even gravitational dynamics on the scale of galaxies or superclusters. \"Dark energy\" and \"dark matter\" today seem to just be placeholders for \"all that stuff we don't really have an explanation for yet.\" And while I look forward to seeing what we actually manage to discover, I don't have a lot of faith in us figuring it out within my lifetime. It's just too vast of a field for progress to suddenly speed up enough to actually sort it out that fast.\nWe know there are gaps, and we can identify specific gaps too. Such as a discrepancy between observation and the theoretical Hubble constant. That doesn't mean the theories are completely wrong, but there are factors that are missing.\nDark energy and dark matter are observed facts. They are not just placeholders, but the names we've given to a phenomena that comes up repeatedly in observations. It would be like being skeptical that lightning exists before it was discovered to be an electrical phenomenon. That lighting exists was never in dispute in the 18th century. Just like that dark matter exists as a phenomena should not be much of a surprise to anyone in the 21st century.\nThere is no proof whatsoever that either dark energy or dark matter exist.  There are phenomena that are not understood that may be explained by these, but there is no proof for either.\nYou misunderstood the above post. There is no proof that they have the same nature as \"common energy\" and \"common matter\", but there is overwhelming observational evidence that the universe doesn't behave as the Standard Model of cosmology predicts it should given the known amount and distribution of mass in the universe. That discrepancy between what is predicted and what is observed is called \"dark matter\", and you can't deny that the observations exist.\nQuote:\n\"Dark energy and dark matter are observed facts. They are not just placeholders\"\nThey are not observer facts and they are just placeholders.  There is plenty that we don't understand, these have been proposed as solutions.  Many proposals have been made for any number of things throughout history - most were wrong.  \"We call this thing that we have no idea what it is 'dark matter' because we have observational issues with galactic rotations\".  \"We call this thing that we have no idea at all what it is \nThey are not observer facts and they are just placeholders. There is plenty that we don't understand, these have been proposed as solutions. You seemed confused about the situation. Why do you think we have \"proposed solutions\" if there were no observable facts? There are observable facts; you just refuse to acknowledge they exist. Over a hundred years of observable facts suggest dark matter is real.\nThey are not observer facts and they are just placeholders. There is plenty that we don't understand, these have been proposed as solutions.\nYou seemed confused about the situation. Why do you think we have \"proposed solutions\" if there were no observable facts? There are observable facts; you just refuse to acknowledge they exist. Over a hundred years of observable facts suggest dark matter is real.\nI'm sorry, but your reply makes no sense at all.\nYou quote me as saying that there is plenty that we don't understand and that these have been proposed as solutions, but then somehow make the bizarre leap to me not acknowledging that these things exist.\nThen you go on to say:\n\"Over a hundred years of observable facts suggest dark matter is real.\"\nYes, things are happening that we have no explanation for.  Go science, figure it out.  Because after a hundred years, we still have no idea.  So 'dark matter' is syno \nYou quote me as saying that there is plenty that we don't understand and that these have been proposed as solutions, but then somehow make the bizarre leap to me not acknowledging that these things exist.Only you haven't thought about the situation clearly. Your assertion is that we have no observable facts yet we have proposed solutions. What are we trying to solve if there are no observable facts? That's like me proposing a solution to my current problem of a leaky faucet but I have never observed my faucet leaking.Yes, things are happening that we have no explanation for. Go science, figure it out. We do not have full explanation. You keep asserting we have zero information. We also know dark matter and energy are not regular matter or energyBecause after a hundred years, we still have no idea. So 'dark matter' is synonymous with \"well, we have to call it something, but really we have no idea what it is\".Again, not having FULL explanation is not the s\nYou quote me as saying that there is plenty that we don't understand and that these have been proposed as solutions, but then somehow make the bizarre leap to me not acknowledging that these things exist.\nOnly you haven't thought about the situation clearly. Your assertion is that we have no observable facts yet we have proposed solutions. What are we trying to solve if there are no observable facts? That's like me proposing a solution to my current problem of a leaky faucet but I have never observed my faucet leaking.\nYes, things are happening that we have no explanation for. Go science, figure it out. We do not have full explanation. You keep asserting we have zero information. We also know dark matter and energy are not regular matter or energyBecause after a hundred years, we still have no idea. So 'dark matter' is synonymous with \"well, we have to call it something, but really we have no idea what it is\".Again, not having FULL explanation is not the s\nYes, things are happening that we have no explanation for. Go science, figure it out.\nWe do not have full explanation. You keep asserting we have zero information. We also know dark matter and energy are not regular matter or energy\nBecause after a hundred years, we still have no idea. So 'dark matter' is synonymous with \"well, we have to call it something, but really we have no idea what it is\".Again, not having FULL explanation is not the s\nBecause after a hundred years, we still have no idea. So 'dark matter' is synonymous with \"well, we have to call it something, but really we have no idea what it is\".\nAgain, not having FULL explanation is not the s\n\"Over a hundred years of observable facts suggest dark matter is real.\"\nEqually so, how can the observed facts be \"of\" dark matter if in fact they only \"suggest\" it is real?\nI'm not trying ot be awkward - most of physics is like this. We almost never observe the thing directly. Most often that would be impossible. So we observe an effect that we think the thing, and if done under the right conditions we take that secondary observation (of the thing's effects, rather than the thig itself) to be evidence for th \nEqually so, how can the observed facts be \"of\" dark matter if in fact they only \"suggest\" it is real?I think the poster above is objecting to the semantics of what you're saying. My reading of it is that s/he doesn't disagree that there are observaitons of discrepencies in the galactic observations, and that these discrepent observations suggest (strongly, and almost exclusively) that dark matter is the cause, but this is not the same as saying \"Dark energy and dark matter are observed facts\".No, in this post and in another post, the poster is specifically saying \"there is no proof\" and \"there are no obser \nEqually so, how can the observed facts be \"of\" dark matter if in fact they only \"suggest\" it is real?\nI think the poster above is objecting to the semantics of what you're saying. My reading of it is that s/he doesn't disagree that there are observaitons of discrepencies in the galactic observations, and that these discrepent observations suggest (strongly, and almost exclusively) that dark matter is the cause, but this is not the same as saying \"Dark energy and dark matter are observed facts\".\nNo, in this post and in another post, the poster is specifically saying \"there is no proof\" and \"there are no obser \nChatGPT said: \"Suggested Refinement:If you want to make a similar point but avoid the gotcha tone, you could say:\n\"If future discoveries showed that another forceâ\"such as electromagnetism or a modification to gravityâ\"explains galaxy rotation curves without needing dark matter, how would that change your perspective? Would you still consider dark matter the best explanation, or would you be open to alternatives?\"\nThis way, you still challenge the assumption but invite an open-ended discussion rathe \nI agree with everything you've said. The only thing I (or the poster above, in my opinion) is objecting to is the statement that we have direct observational evidence for Dark Matter.\nI see nothing in their (or my) postings disputing the evidence or its objectivity, and my opinion is that by far the most likely explanation is indeed dark matter.\nThe dispute is, in my opinion, that the claim has gone beyond this when it says that Dark Matter is an \"observered fact\". It is an implied fact (through secondary obs \n \n... that another forceâ\"such as electromagnetism or a modification to gravityâ\"explains...\nDoes ChatGPT use an iPhone, or does it just hallucinate holding one? :-)\nI agree with everything you've said. The only thing I (or the poster above, in my opinion) is objecting to is the statement that we have direct observational evidence for Dark Matter.He said \"There is no proof whatsoever that either dark energy or dark matter exist.\" and \"They are not observer facts and they are just placeholders.\" He did not say we do not have direct observational evidence. He has specifically said \"no proof\" and \"no observable facts\". There is a difference between we have facts we cannot explain and we have no facts. He is leaning heavily into denialism.The dispute is, in my opinion, that the claim has gone beyond this when it says that Dark Matter is an \"observered fact\". It is an implied fact (through secondary observations - e.g. gravitaitonal lensing, galaxy rotations, etc.), and it might be strongly implied and storngly suggest Dark Matter. That is not the same as it being a \"fact\" that Dark Matter exists.Again, we have facts that something exists. We do not know what it is. It could be we are wrong about the nature of \nI agree with everything you've said. The only thing I (or the poster above, in my opinion) is objecting to is the statement that we have direct observational evidence for Dark Matter.\nHe said \"There is no proof whatsoever that either dark energy or dark matter exist.\" and \"They are not observer facts and they are just placeholders.\" He did not say we do not have direct observational evidence. He has specifically said \"no proof\" and \"no observable facts\". There is a difference between we have facts we cannot explain and we have no facts. He is leaning heavily into denialism.\nThe dispute is, in my opinion, that the claim has gone beyond this when it says that Dark Matter is an \"observered fact\". It is an implied fact (through secondary observations - e.g. gravitaitonal lensing, galaxy rotations, etc.), and it might be strongly implied and storngly suggest Dark Matter. That is not the same as it being a \"fact\" that Dark Matter exists.Again, we have facts that something exists. We do not know what it is. It could be we are wrong about the nature of \nThe dispute is, in my opinion, that the claim has gone beyond this when it says that Dark Matter is an \"observered fact\". It is an implied fact (through secondary observations - e.g. gravitaitonal lensing, galaxy rotations, etc.), and it might be strongly implied and storngly suggest Dark Matter. That is not the same as it being a \"fact\" that Dark Matter exists.\nAgain, we have facts that something exists. We do not know what it is. It could be we are wrong about the nature of \nDoes \"blue trane\" hallucinate that quoting the output from an unreliable reporter with a known habit of hallucinating or outright creating \"data\" makes for a meaningful contribution?Do you have anything meaningful to add to this conversation other than a bizarre and irrelevant tangent?\nDoes \"blue trane\" hallucinate that quoting the output from an unreliable reporter with a known habit of hallucinating or outright creating \"data\" makes for a meaningful contribution?\nDo you have anything meaningful to add to this conversation other than a bizarre and irrelevant tangent?\nI wrote. Obviously I think I do.\nOver a hundred years of observable facts suggest dark matter is real.\nHmmmm. While Hubble (and a number of others) were starting to get meaningful distances to various galaxies (and from that, the idea that there is a relationship which we call today the \"Hubble constant\") in the early~mid 1920s (so we're around their centenary now), those observations didn't themselves give estimates of the mass distribution within the galaxies - and hence the idea that the visible amount of mass and the gravitationally-ded \nI suppose you could add together the two strands of research to get more than a century of work. but in that case we'll be getting the bicentenary in the 2040sFrom Dr Becky, a PhD astrophycist, discussing A century's worth of evidence for the existence of dark matter.  [youtube.com]\n\nThis is just a sampling. There are more papers. Just because you only knew of 2 examples does not mean there were only 2 examples. \nSchmidt (1963)  [nature.com]  \nPenzias & Wilson (1964)  [harvard.edu]  \nRood (1965)  [harvard.edu]  \nMeekins (1971) [nature.com]\n \nRubin & Ford (1970) [harvard.edu]\n \nFreeman (1970) [harvard.edu]\n \nOstriker, Peebles, Yahil (1974)  [harvard.edu]\n \nEinasto, Saar, Kaasik, Chernin (1974)  [nature.com]\n \nWalsh, Carswell, Weymann (1979)  [nature.com]\n \nFaber & Gallagher (1979) [harvard.edu]  \nMilg [harvard.edu]\nI suppose you could add together the two strands of research to get more than a century of work. but in that case we'll be getting the bicentenary in the 2040s\nFrom Dr Becky, a PhD astrophycist, discussing A century's worth of evidence for the existence of dark matter.  [youtube.com]\n\nThis is just a sampling. There are more papers. Just because you only knew of 2 examples does not mean there were only 2 examples.\n \nSchmidt (1963)  [nature.com] \n \nPenzias & Wilson (1964)  [harvard.edu] \n \nRood (1965)  [harvard.edu] \n \nMeekins (1971) [nature.com]\n\n \nRubin & Ford (1970) [harvard.edu]\n\n \nFreeman (1970) [harvard.edu]\n\n \nOstriker, Peebles, Yahil (1974)  [harvard.edu]\n\n \nEinasto, Saar, Kaasik, Chernin (1974)  [nature.com]\n\n \nWalsh, Carswell, Weymann (1979)  [nature.com]\n\n \nFaber & Gallagher (1979) [harvard.edu] \n \nMilg [harvard.edu]\nNone of the dates for those papers goes back into the 1920s or '30s, probing my point about the present (vs approaching) centenary of dark matter research. A 1963 paper would be relevant evidence if I'd claimed there was only (2025-1963=62) years of research on the topic. But I didn't - I asserted that there was 85~90 years of resea \nI know who Dr Becky is. I haven't been able to see her \"NSN\" series for several weeks now, since YT started getting aggressive about it's advertising revenue. [Shrug] End of YT.That video is from 5 years ago.Why are you citing Penzias & Wilson's 1964 paper showing there existed a cosmic microwave background, and that it's properties were compatible with Gamow's 1947 (1948?) proposal of an early hot, high density state of the universe (now known as the \"big bang\", stealing an insult form Fred Hoyle).First of all, I didn't cite the paper. Dr. Becky cited the paper because Penzias and Wilson showed the universe had a beginning and therefore the properties of the starting universe like the distribution of mass is important. Penzias and Wilson showed that since CMB is generally uniform, matter distribution is as well. That's not really got anything to do with the establishment of \"dark energy\".My thread was talking about dark matter. Why are you discussing dark energy?\nI know who Dr Becky is. I haven't been able to see her \"NSN\" series for several weeks now, since YT started getting aggressive about it's advertising revenue. [Shrug] End of YT.\nThat video is from 5 years ago.\nWhy are you citing Penzias & Wilson's 1964 paper showing there existed a cosmic microwave background, and that it's properties were compatible with Gamow's 1947 (1948?) proposal of an early hot, high density state of the universe (now known as the \"big bang\", stealing an insult form Fred Hoyle).First of all, I didn't cite the paper. Dr. Becky cited the paper because Penzias and Wilson showed the universe had a beginning and therefore the properties of the starting universe like the distribution of mass is important. Penzias and Wilson showed that since CMB is generally uniform, matter distribution is as well. That's not really got anything to do with the establishment of \"dark energy\".My thread was talking about dark matter. Why are you discussing dark energy?\nWhy are you citing Penzias & Wilson's 1964 paper showing there existed a cosmic microwave background, and that it's properties were compatible with Gamow's 1947 (1948?) proposal of an early hot, high density state of the universe (now known as the \"big bang\", stealing an insult form Fred Hoyle).\nFirst of all, I didn't cite the paper. Dr. Becky cited the paper because Penzias and Wilson showed the universe had a beginning and therefore the properties of the starting universe like the distribution of mass is important. Penzias and Wilson showed that since CMB is generally uniform, matter distribution is as well. \nThat's not really got anything to do with the establishment of \"dark energy\".My thread was talking about dark matter. Why are you discussing dark energy?\nThat's not really got anything to do with the establishment of \"dark energy\".\nMy thread was talking about dark matter. Why are you discussing dark energy?\nbecause Penzias and Wilson showed the universe had a beginning\nNo. Le MaÃ®tre had shown that was the obvious interpretation of Hubble's isotropically receding galaxies observation in ... about 1932. (The infamous \"your maths is correct but your physics is abominable\" paper, per Einstein. Not the first time Einstein was wrong. Nor the last.) A few people tried to engineer alternative alternative solutions to Hubble's observations (in particular the afore-mentioned Hoyle), but that pretty much died a \nNo. Le Maître had shown that was the obvious interpretation of Hubble's isotropically receding galaxies observation in ..Again, I didn't cite the Penzias and Wilson. Please consult Dr. Becky.Slip of the keyboard. I was thinking about dark matter.Back to the subject at hand, do you admit there is over 100 years of evidence or are still assert that because you only know of two pieces of evidence, therefore only two pieces of evidence exist?/p?\nNo. Le Maître had shown that was the obvious interpretation of Hubble's isotropically receding galaxies observation in ..\nAgain, I didn't cite the Penzias and Wilson. Please consult Dr. Becky.\nSlip of the keyboard. I was thinking about dark matter.Back to the subject at hand, do you admit there is over 100 years of evidence or are still assert that because you only know of two pieces of evidence, therefore only two pieces of evidence exist?/p?\nSlip of the keyboard. I was thinking about dark matter.\nBack to the subject at hand, do you admit there is over 100 years of evidence or are still assert that because you only know of two pieces of evidence, therefore only two pieces of evidence exist?/p?\nFor someone asserting a concern with epistemiology, you pay very little attention to things on the screen in front of your face. I never denied the existence of one of of the papers the your cited (though with YT having my IP blocked.Your post says: \"I suppose you could add together the two strands of research to get more than a century of work. but in that case we'll be getting the bicentenary in the 2040s.\" There were more than two pieces of evidence. The first was from Kelvin in 1884. My math says 2019 (date of video) -1884 > 100. , I can't see what relevance DrBecky was drawing from a number of them w.r.t \"dark [anything]\"). You cannot see the evidence presented due to your own actions but are you still asserting that you were right? Or how about you might be wrong because you cannot evaluate all the evidence (again due to \nFor someone asserting a concern with epistemiology, you pay very little attention to things on the screen in front of your face. I never denied the existence of one of of the papers the your cited (though with YT having my IP blocked.\nYour post says: \"I suppose you could add together the two strands of research to get more than a century of work. but in that case we'll be getting the bicentenary in the 2040s.\" There were more than two pieces of evidence. The first was from Kelvin in 1884. My math says 2019 (date of video) -1884 > 100. \n, I can't see what relevance DrBecky was drawing from a number of them w.r.t \"dark [anything]\"). You cannot see the evidence presented due to your own actions but are you still asserting that you were right? Or how about you might be wrong because you cannot evaluate all the evidence (again due to \n, I can't see what relevance DrBecky was drawing from a number of them w.r.t \"dark [anything]\").\n You cannot see the evidence presented due to your own actions but are you still asserting that you were right? Or how about you might be wrong because you cannot evaluate all the evidence (again due to \nThe mass-to-light ratio is an observe fact that anyone can independently verify. There are really two choices, that General Relativity is horribly wrong by a few orders of magnitude. Or that there is a mass that cannot be accounted for, and we can confirm that it's not Baryonic matter. (that's complicated). At the end of the day, DM is observed to be ubiquitous in gravitationally-collapsed structures, from the galaxies equivalent in size to Milky Way to the smallest known galaxies.\nSo no. It's not a placeholder. It's not a theory. But we also do not have a complete explanation for what we observe. It's important to keep in the front of our mind that we keep seeing this and that it exists. And the next step is of course to find the underlying cause and mechanism.\nA somewhat long but informative video covers it pretty well for the layperson: dark matter is not a theory [youtube.com]\nI agree, it is not a theory, it is a postulate.  It irks me in the video that you linked when the person refers to 'the theory'.  There is no theory.  There is an observational basis only.  To get to the level of 'theory', a strong mathematical and experimentation basis have to be developed.\n\" DM is observed to be ubiquitous in gravitationally-collapsed structures, from the galaxies equivalent in size to Milky Way to the smallest known galaxies.\"\nChatGPT says:\nNot entirely. While dark matter is inferred to be present in most galaxies, the claim that it is ubiquitous in all gravitationally collapsed structures is an oversimplification. There are notable exceptions:\nGalaxies with Little to No Dark Matter\nSome galaxies, like NGC 1052-DF2 and NGC 1052-DF4, show velocity dispersions too low to require s \nThere are really two choices, that General Relativity is horribly wrong by a few orders of magnitude.False Dichotomy. Newtonian Physics works pretty darn well for a lot of situations, is simple, so much so, we still use it because it is practical. But it is wrong.For all we know, Einstein's equations may be suffering the same basic problem, we just haven't figured out why it isn't working where we see it not working as expected. But it works for a large number of scenarios that it is still usable.That is my current working theory ;-)\nThere are really two choices, that General Relativity is horribly wrong by a few orders of magnitude.\nFalse Dichotomy. Newtonian Physics works pretty darn well for a lot of situations, is simple, so much so, we still use it because it is practical. But it is wrong.\nFor all we know, Einstein's equations may be suffering the same basic problem, we just haven't figured out why it isn't working where we see it not working as expected. But it works for a large number of scenarios that it is still usable.\nThat is my current working theory ;-)\nSo no. It's not a placeholder. It's not a theory.It does not bother you that the only way to define Dark Matter is by what it is NOT rather what it IS?Same with Dark Energy.Unexplained mass that has none of the properties of normal mass indicates a flawed understanding rather than a new state of matter that has no classical underpinnings.\nSo no. It's not a placeholder. It's not a theory.\nIt does not bother you that the only way to define Dark Matter is by what it is NOT rather what it IS?\nSame with Dark Energy.\nUnexplained mass that has none of the properties of normal mass indicates a flawed understanding rather than a new state of matter that has no classical underpinnings.\nYou misunderstood the above post. There is no proof that they have the same nature as \"common energy\" and \"common matter\", but there is overwhelming observational evidence that the universe doesn't behave as the Standard Model of cosmology predicts it should given the known amount and distribution of mass in the universe. That discrepancy between what is predicted and what is observed is called \"dark matter\", and you can't deny that the observations exist.Right, it's a split between theory and reality. We call it \"dark energy\" and \"dark matter\" because that's easier than writing a dissertation every time you want to discuss the big glaring gaps in our knowledge, but we still are talking about the difference between theory and observation. We literally don't know what we don't know when it comes to this, and people that think of it as \"observed fact\" rather than a gap in knowledge are on the dangerous knife edge of assuming theoretical gaps in knowledge with \nYou misunderstood the above post. There is no proof that they have the same nature as \"common energy\" and \"common matter\", but there is overwhelming observational evidence that the universe doesn't behave as the Standard Model of cosmology predicts it should given the known amount and distribution of mass in the universe. That discrepancy between what is predicted and what is observed is called \"dark matter\", and you can't deny that the observations exist.\nRight, it's a split between theory and reality. We call it \"dark energy\" and \"dark matter\" because that's easier than writing a dissertation every time you want to discuss the big glaring gaps in our knowledge, but we still are talking about the difference between theory and observation. We literally don't know what we don't know when it comes to this, and people that think of it as \"observed fact\" rather than a gap in knowledge are on the dangerous knife edge of assuming theoretical gaps in knowledge with \nThere is no proof whatsoever that either dark energy or dark matter exist. There are phenomena that are not understood that may be explained by these, but there is no proof for either.By \"no proof\" do you mean we have over a hundred years of evidence [youtube.com] for dark matter? The first evidence was from Lord Kelvin in 1884. Remember science is not math; evidence, not proof, is the measure to evaluate. Granted we do not have full understanding about the nature of dark matter today. That does not mean we do not have evidence.\nThere is no proof whatsoever that either dark energy or dark matter exist. There are phenomena that are not understood that may be explained by these, but there is no proof for either.\nBy \"no proof\" do you mean we have over a hundred years of evidence [youtube.com] for dark matter? The first evidence was from Lord Kelvin in 1884. Remember science is not math; evidence, not proof, is the measure to evaluate. Granted we do not have full understanding about the nature of dark matter today. That does not mean we do not have evidence.\nIf your statement is:\n\"Something that we do not understand is clearly happening, but we have no idea what is causing these things.  Let's just all it 'dark matter' for the time being\".\nThen I have no problem with that.  If 'dark matter' is just a placeholder term, and nothing more, than that is fine by me.\nAnd, btw, the link to Dr. Becky, she states that we have no idea what dark matter is.  Simply that this question has been unresolved for a long time.\n\"Something that we do not understand is clearly happening, but we have no idea what is causing these things. Let's just all it 'dark matter' for the time being\".Your original statement: \"There is no proof . . . \" is factually incorrect. We have evidence. Over a hundred years of evidence. We do not have full understanding. You keep confusing evidence with full understanding. They are not the same thing.And, btw, the link to Dr. Becky, she states that we have no idea what dark matter is. Simply that this question has been unresolved for a long time.\nAgain we do not have full understanding. We do know it is not normal, baryonic matter. We have over a hundred years of evidence.\n\"Something that we do not understand is clearly happening, but we have no idea what is causing these things. Let's just all it 'dark matter' for the time being\".\nYour original statement: \"There is no proof . . . \" is factually incorrect. We have evidence. Over a hundred years of evidence. We do not have full understanding. You keep confusing evidence with full understanding. They are not the same thing.\nAnd, btw, the link to Dr. Becky, she states that we have no idea what dark matter is. Simply that this question has been unresolved for a long time.\nAgain we do not have full understanding. We do know it is not normal, baryonic matter. We have over a hundred years of evidence.\nAnd, btw, the link to Dr. Becky, she states that we have no idea what dark matter is. Simply that this question has been unresolved for a long time.\n\nAgain we do not have full understanding. We do know it is not normal, baryonic matter. We have over a hundred years of evidence.\nYes - exactly.  Now you understand.  We have over a hundred years of observations that can not be explained.  This is evidence that there is something that is not explained.  In fact, my original statement is exactly correct:\n\"There is no proof whatsoever that either dark energy or dark matter exist. There are phenomena that are not understood that may be explained by these, but there is no proof for either.\"\nBy proof, I mean either experimental,  errr ahhh what's the word, oh \"evidence\".  Show me one experim \nYes - exactly. Now you understand. We have over a hundred years of observations that can not be explained. This is evidence that there is something that is not explained. In fact, my original statement is exactly correct:No. You said \"there is no proof\". That is false. You did not say, 'there is no explanation.\"By proof, I mean either experimental, errr ahhh what's the word, oh \"evidence\". Show me one experiment.Wow you understanding of science is lacking. Experiments is not the totality of evidence. Observations are also evidence. You seem not to understand that. By your logic, none of planets in this solar system exist because we have not created one in an experiment as we can only observe them. Show me one theoretical framework. There are none.We call the things that have been observed for over a hundred years that can not be explained by any theory or experiment \"dark matter\".You logic is completely binary. If we do not have full explanations for something, they do not exist in your world. We have eviden \nYes - exactly. Now you understand. We have over a hundred years of observations that can not be explained. This is evidence that there is something that is not explained. In fact, my original statement is exactly correct:\nNo. You said \"there is no proof\". That is false. You did not say, 'there is no explanation.\"\nBy proof, I mean either experimental, errr ahhh what's the word, oh \"evidence\". Show me one experiment.Wow you understanding of science is lacking. Experiments is not the totality of evidence. Observations are also evidence. You seem not to understand that. By your logic, none of planets in this solar system exist because we have not created one in an experiment as we can only observe them. Show me one theoretical framework. There are none.We call the things that have been observed for over a hundred years that can not be explained by any theory or experiment \"dark matter\".You logic is completely binary. If we do not have full explanations for something, they do not exist in your world. We have eviden \nBy proof, I mean either experimental, errr ahhh what's the word, oh \"evidence\". Show me one experiment.\nWow you understanding of science is lacking. Experiments is not the totality of evidence. Observations are also evidence. You seem not to understand that. By your logic, none of planets in this solar system exist because we have not created one in an experiment as we can only observe them.\n Show me one theoretical framework. There are none.We call the things that have been observed for over a hundred years that can not be explained by any theory or experiment \"dark matter\".You logic is completely binary. If we do not have full explanations for something, they do not exist in your world. We have eviden \n Show me one theoretical framework. There are none.We call the things that have been observed for over a hundred years that can not be explained by any theory or experiment \"dark matter\".\nYou logic is completely binary. If we do not have full explanations for something, they do not exist in your world. We have eviden \nThis is a bot like argument. All you have to picture is the new imaginary gravitonic wave collider seeing the new particles of dark matter being released when gravity is just so, apply the theory to the cosmos for the match and aha! Now all the gaps get filled in, we know about gravity conditional particles and dark matter is no more. Until that time it is obviously a place holder, and it just as likely we do not actually understand the laws of physics and these particles do not exist.\n(I see you gave a YT link. YT have my IP address blocked, probably because I block their adverts. Use textual sources.)\nWait, what - who is roping Kelvin into dark matter? He was dead long before the question was a real question. . In fact, I think he was dead before the existence of galaxies outside our own, separated by large, very empty spaces was clearly established.You do understand that evidence can exist before detailed scientific knowledge exists, right?  Ben Franklin and many others were experimenting with electricity long before humans understand the nature of atomic particles.In fact, I think he was dead before the existence of galaxies outside our own, separated by large, very empty spaces was clearly established.And how is that remotely relevant to Kelvin's evidence? Kelvin was velocity of stars in the Milky Way. Even then there was discrepancy between what he could measure and the observable stellar mass in the Milky Way in keeping the system stable. This suggest there was way more unknown and dar \nWait, what - who is roping Kelvin into dark matter? He was dead long before the question was a real question. . In fact, I think he was dead before the existence of galaxies outside our own, separated by large, very empty spaces was clearly established.\nYou do understand that evidence can exist before detailed scientific knowledge exists, right?  Ben Franklin and many others were experimenting with electricity long before humans understand the nature of atomic particles.\nIn fact, I think he was dead before the existence of galaxies outside our own, separated by large, very empty spaces was clearly established.And how is that remotely relevant to Kelvin's evidence? Kelvin was velocity of stars in the Milky Way. Even then there was discrepancy between what he could measure and the observable stellar mass in the Milky Way in keeping the system stable. This suggest there was way more unknown and dar \nIn fact, I think he was dead before the existence of galaxies outside our own, separated by large, very empty spaces was clearly established.\nAnd how is that remotely relevant to Kelvin's evidence? Kelvin was velocity of stars in the Milky Way. Even then there was discrepancy between what he could measure and the observable stellar mass in the Milky Way in keeping the system stable. This suggest there was way more unknown and dar \nYou are right but I think we are now just getting very smart people to make up mathematics that matches what we see as opposed to actually understanding it. Dark matter and dark energy seem to me to be just oh our models don't quite work lets just add this then say it works. We know something is missing but we are stuck on what and it doesn't seem to me that these this are particularity good solutions.\nDark matter and dark energy are absolutely not facts.  Theyâ(TM)re are things we canâ(TM)t explain in the universe today that currently seem best explained by the existence of more matter that we canâ(TM)t see; and some energy causing inflation to accelerate, but there are absolutely alternative explanations that donâ(TM)t need those things to exist.  One competing theory to dark matter is MOND where instead of claiming that thereâ(TM)s more matter we claim that Newtonâ(TM)s la \nOne competing theory to dark matter is MOND where instead of claiming that there's more matter we claim that Newton's laws of gravity (and Einstein's) are incorrect at very low accelerations.\nMOND might help to do away with the need for \"dark matter\" (it is still very much argued ; few astrophysicists find MOND useful, regardless of whether it is \"interesting\"). But changing the predicted behaviour at low accelerations does precisely nothing to explain the observations of the phenomenon now called \"dark ener \nSuch as a discrepancy between observation and the theoretical Hubble constant.\nI think you're misremembering something. While I'm sure plenty of people have attempted to deduce what the \"Hubble Constant\" should be, I'm less sure that anyone would get in the least bit concerned if such a prediction turned out to differ from reality. Theoreticians - meh.\n\nWhat I think you're misremembering is the so-called \"Hubble Tension\", in which two different methods of estimating the \"Constant\" from observational data dis\n\"Dark energy\" and \"dark matter\" today seem to just be placeholders for \"all that stuff we don't really have an explanation for yet.\"Not \"seem\", that's literally what they are.\n\"Dark energy\" and \"dark matter\" today seem to just be placeholders for \"all that stuff we don't really have an explanation for yet.\"\nNot \"seem\", that's literally what they are.\nWell kinda yeah\nThere's basically two things which are odd that we absolutely definitely do not understand. Firstly galaxies rotate faster then we expect based on what we can observe in them. Secondly, the universe appears to be expanding ever faster where you'd expect the opposite to be the case as gravity pulls it back together.\nThe former has alternative hypotheses, like MOND. But invisible mass so far fits the observations better than MOND, so it's regarded as the best hypothesis.\nI'm the second case, well \nThe former has alternative hypotheses, like MOND. But invisible mass so far fits the observations better than MOND, so it's regarded as the best hypothesis.The problem for MOND is while it provides a possible solution without invoking dark matter, it fails to adequately explain known phenomena like relativity, gravitational lensing, cosmic microwave background radiation, etc. As such, few astrophysicists work on it as there are many problems to overcome.\nThe former has alternative hypotheses, like MOND. But invisible mass so far fits the observations better than MOND, so it's regarded as the best hypothesis.\nThe problem for MOND is while it provides a possible solution without invoking dark matter, it fails to adequately explain known phenomena like relativity, gravitational lensing, cosmic microwave background radiation, etc. As such, few astrophysicists work on it as there are many problems to overcome.\nThat, and there are some galaxies out there that *do* rotate at the speed we expect them to, or that rotate faster.  Those observations seem to require something that can vary locally (like the amount and arrangement of dark matter), rather than one universal cosmic rule.\nWell kinda yeahThere's basically two things which are odd that we absolutely definitely do not understand. Firstly galaxies rotate faster then we expect based on what we can observe in them. Secondly, the universe appears to be expanding ever faster where you'd expect the opposite to be the case as gravity pulls it back together.Ever consider our ability to be accurate when talking about everything related to what we absolutely definitely do NOT understand?We speak of things “rotating faster”, and all we have to prove that is human instrumentation calibrated by the “experts” who abuse marketing* for the massive majority of shit they absolutely definitely do NOT understand.We speak of a universe “expanding”, and all we have to prove that is human instrumentation calibrated by the “experts \nWell kinda yeah\nThere's basically two things which are odd that we absolutely definitely do not understand. Firstly galaxies rotate faster then we expect based on what we can observe in them. Secondly, the universe appears to be expanding ever faster where you'd expect the opposite to be the case as gravity pulls it back together.\nEver consider our ability to be accurate when talking about everything related to what we absolutely definitely do NOT understand?\nWe speak of things “rotating faster”, and all we have to prove that is human instrumentation calibrated by the “experts” who abuse marketing* for the massive majority of shit they absolutely definitely do NOT understand.\nWe speak of a universe “expanding”, and all we have to prove that is human instrumentation calibrated by the “experts \nThat's not a solution. That's giving up.\nThey're chasing this because they don't know what dark energy is. Scientists didn't stop trying to understand gravity after Newton's description, and they didn't stop after Einstein produced a better one. And for whomever figures out dark energy (if anyone does), scientists aren't going to stop with that.\nThe phrase that most often leads to scientific breakthroughs in our understanding of the universe isn't \"Eureka!\", but rather, \"Huh... that's weird...\"\nFinding out that our models fail at a spot we didn't expect them to fail helps us to create more comprehensive theories that better explain the things we don't understand.\n\"Eureka!\" and \"That's weird\" occur at different points.  \"That's weird\" is where you start looking for a new anwser, \"Eureka\" is when you find an answer that fits all your data.\n(Yeah, it's a nice quote, but it's wrong.)\nScientists also came up with more incorrect explanations than correct ones.\nInfinitely more in fact.  The key is that each explanation is more correct than the last.\nHow do you know you're not in an epicycular trap?\nSomeone said in another comment: \"But so far no one has cone up with an explanation which fits the data better [...]\"\nFor how long did epicyclists say that?\n\"Each needs some very wild postulates to be true.\"\nSo before you could detect parallax motion of the stars with your instruments, would you reject Aristarchus's heliocentric theory because it was just too wild for the stars to be so far away that their parallax motion was beyond the resolution of your instruments, and wild postulates are best kept down for purely social control reasons?\n\n I do not claim that wild postulates have to be kept down, nor do I myself postulate any social control reasons. I just call them wild, because they have no independent evidence, and we don't have any clue how to verify them.\n\n\nAnd I don't know where you get the social control idea from. If they have no independent evidence, and at the same time, the effects are so miniscule that we have no idea how to verify them, how should denying them in some way help social control?\n\n\nDon't \nWe almost certainly *are* in an epicycular trap, but *even then* each explanation is more correct than the last.  Each one models reality slightly better than the last, and is able to make predictions slightly better than the last.  It may well be that at some point we'll take a significant step by completely rejigging how the model works, but that doesn't change the fact that each one improves the situation.\nThey're chasing this because they don't know what dark energy is. They are trying to figure out why their mathematical model of the universe doesn't add up. \"Dark energy\" is just a number to plug in to make the model work. My bet is that this is a little like the complicated formulas used to explain how the sun and stars rotate around the earth.\nThey're chasing this because they don't know what dark energy is.\nThey are trying to figure out why their mathematical model of the universe doesn't add up. \"Dark energy\" is just a number to plug in to make the model work. My bet is that this is a little like the complicated formulas used to explain how the sun and stars rotate around the earth.\nThe most simple solution to the problems faced here, is that we don't understand everything about physics. In the same way Newton didn't understand the nature of gravity in all circumstances. FTFY. Certainly we understand many things about physics and Newton understood the nature of gravity but not in a relativistic frame.\nThe most simple solution to the problems faced here, is that we don't understand everything about physics. In the same way Newton didn't understand the nature of gravity in all circumstances.\nFTFY. Certainly we understand many things about physics and Newton understood the nature of gravity but not in a relativistic frame.\nThat is definitely not the simplest solution.\n\"n the same way Newton didn't understand the nature of gravity.\"\nAnd you think we do?\n\nRichard Feynman said the same about Quantum Physics back in the 1970ies. And still, we can handle Quantum Physics with a precision which allows LIGO and measuring changes of the magnitude on a thousandth of a proton's diameter. I don't have any issue with the \"not understanding\" part, as long as the predictions we make work out.\n... it certainly sounds like dark energy and cosmological inflation might be the same phenomenon, representing a single field or mechanism which weakens by many orders of magntiude with respect to time/density.\nAnyone here have any less-Dunning-Kruger takes on the topic? :)\nMy take:They're parts of the same process in the current models.  The inflation is what we see signs of (as in measured distances to supernovae, etc.).  Dark energy is how the inflation is explained.The thing that bothers me is the big bang itself.  I don't see how inflation can explain getting through a Schwarzschild barrier, the big bang was clearly dense enough to put the universe within that barrier, and I've been assured that we can't be living within a black hole.  ISTM that ONE of those has to be wro \nI don't see that as a problem at all?  Surely the expansion of space (or something that creates the effect that's perceived as the of the expansion of space) directly offsets inspiraling, no?  Surely if inflation is sufficiently high at such extreme mass densities, there's no barrier at all, no?\nThat would work if the universe being inside a black hole were possible.  But I've been told that that's not compatible with current theories.\nI didn't understand the explanation.  Actually I've had a least two different explanations as to why that wasn't possible, and didn't understand either of them, but one of them was by someone that I trust to know what he's talking about.  (And possibly both explanations were the same reason from different approaches.)  It's been too long since I've even looked at tensor calculus, so I *can't* form my own opinion, I have to rely on someone else's..\nI can't imagine anyone could make any sorts of confident statements. Kerr himself (of Kerr Black Holes fame, aka essentially all real-world black holes) believes that singularities may well not exist, as (even if you ignore new forces) Penrose's \"proof\" has implicit presumptions of space/time relations that are not guaranteed to hold. There are radically different theories on the nature or even absence of singularities and the nature of event horizons.\nYou'd have to have a pretty weird curve describing its strength. It would almost certainly require fewer parameters to just have separate fields.\nCan't see that it'd be weirder than say the strength of the strong force with respect to distance.\nYes, and that requires eight gluons, six charges, and six quarks, with all the parameters for their fields and interactions. Quite a step up from lambda, for a constant cosmological constant, or or w_0 and w_a for a simply varying one.\nParameter counting isn't the best measure of theoretical simplicity. A model with two disconnected phenomena (inflation then dark energy) might use fewer mathematical terms but actually represents a more complex universe where two entirely different mechanisms produce very similar effects at different epochs. A unified field with time/density-dependent behavior offers provide more explanatory power, even if its mechanism is more complex.  There is nothing at all unusual about time/density-dependent effects \nArbitrarily taking an immensely strong field that caused exponential expansion and then turned off and making it almost-but-not-quite-to-parts-per-zillion turn off and then decay very slowly doesn't \"reveal deeper physical connections.\"\nAnd yes, electroweak unification should not have been accepted if it was just an arbitrary mashing together of two things without any evidence.\nThat's an impressive straw man there.  The entire theory of quintessential inflation is that it didn't turn off - that its intensity just declined by many orders of magnitude with density/time, and continues to decay with density/time.  You're the one inserting \"turned off\" into the picture.\n(And yes, just to head you off, there are numerous papers on reheating with respect to quintessential inflation, and there's a surprisingly large number of viable mechanisms)\nAnd yes, electroweak unification should not ha \nTo me, your \"better to have two independent mechanisms that just-so exist with just-so parameters, than one mechanism driven by a more complex underlying process\", comes across as the same as saying:\n\"Hmm, when I drop this rock it goes down but when I release this balloon it goes up... rather than trying to unify the two, which would have to deal with things like density and interactions with the surrounding atmosphere, I'll just say there are two separate forces, one which pulls rocks down and one which lif \nYou seem pretty emotionally involved in this. Little weird.\nQuintessence is an explanation for dark energy that, wait for it, adds an additional field, called quintessence.\nLook up what strawman means. Read carefully. Inflation turning off is widely assumed because it's the simplest assumption that fits the evidence. That doesn't mean it's true, and I (explicitly) didn't say it was.\nBack in the mid 80's when I was working on my degree I had discussions with professors about the implications of Hawking Radiation (evaporative black holes), primordial black holes (created as part of the immense pressures a tiny fraction after the big bang) and quantum relativity.  It pains me when dark energy was first proposed I never thought to consider that primordial black holes could be the source.\nIf they are, which has recently been proposed, than you would predict that the strength of dark matter/e \nyou would predict that the strength of dark matter/energy would weaken over time as the number of primordial black holes decrease over time.\nThis implies that the number of primordial BHs is decreasing with time.\n\nBut, the decay of a primordial BH by emissions of Hawking radiation would produce a very distinctive signature of the decay in time-frequency-intensity observation space. So people started looking for BH decays in the data processing pipelines for experiments such as MACHO and OGLE, starting around \nSeems dark energy was/is highly suspect to begin with. A compensation, to another compensation and now they even need variation in dark energy to make it all fit. Seems dark energy is a completely wrong approach. YMMV.Then how do you explain the decades of evidence that there is an energy that physicists cannot directly measure but seems to fit the data that exists?\nSeems dark energy was/is highly suspect to begin with. A compensation, to another compensation and now they even need variation in dark energy to make it all fit. Seems dark energy is a completely wrong approach. YMMV.\nThen how do you explain the decades of evidence that there is an energy that physicists cannot directly measure but seems to fit the data that exists?\n\"I fully believe in this model so the fact that there's this misprediction means there must be some energy not included. I will just add that without any further explanation and call it dark energy.\"No one in science \"believes\" in models. That's religious phrasing. Some models better fit the data that is observed. If a better model comes along, then scientists will use that model.. Of course if you really believe everything else is correct it might make sense, but it could also be other parts of the model are broken and then all you have done is making a matthematical hack.Again scientists do \"believe\". Scientists use the model that best fits. It is how Einstein's Theory of General Relativity replaced Newton's Classical Mechanics. When Einstein first proposed his model, no one \"believed\" him either. Over time, evidence showed his model better fit what scientists could measure and observe. For ex \n\"I fully believe in this model so the fact that there's this misprediction means there must be some energy not included. I will just add that without any further explanation and call it dark energy.\"\nNo one in science \"believes\" in models. That's religious phrasing. Some models better fit the data that is observed. If a better model comes along, then scientists will use that model.\n. Of course if you really believe everything else is correct it might make sense, but it could also be other parts of the model are broken and then all you have done is making a matthematical hack.Again scientists do \"believe\". Scientists use the model that best fits. It is how Einstein's Theory of General Relativity replaced Newton's Classical Mechanics. When Einstein first proposed his model, no one \"believed\" him either. Over time, evidence showed his model better fit what scientists could measure and observe. For ex \n. Of course if you really believe everything else is correct it might make sense, but it could also be other parts of the model are broken and then all you have done is making a matthematical hack.\nAgain scientists do \"believe\". Scientists use the model that best fits. It is how Einstein's Theory of General Relativity replaced Newton's Classical Mechanics. When Einstein first proposed his model, no one \"believed\" him either. Over time, evidence showed his model better fit what scientists could measure and observe. \nFor ex \nDark energy is the observation that the best fit line on this graph has a greater slope than expected:\nhttps://www.e-education.psu.ed... [psu.edu]\nVariable dark energy is the observation that the line might actually be a curve.\nDark energy isn't an \"approach.\" It's an observation.\nVariable dark energy is the observation that the line might actually be a curve.Or a straight line with a slope that changes over time.\nHere's an idea:\n1. Our universe exists within a black hole.\n2. There is probably \"something\" outside this black hole (an accretion disk in the higher order universe, for example).\n3. The effects of this external matter influence the curvature of the space within our universes black hole.\n4. Over time, the matter in this accretion disk changes (ejected, whatever) in that higher order universe, changing the curvature of our space.\nVariable dark energy is the observation that the line might actually be a curve.\nOr a straight line with a slope that changes over time.\n\nHere's an idea:\n\n1. Our universe exists within a black hole.\n2. There is probably \"something\" outside this black hole (an accretion disk in the higher order universe, for example).\n3. The effects of this external matter influence the curvature of the space within our universes black hole.\n4. Over time, the matter in this accretion disk changes (ejected, whatever) in that higher order universe, changing the curvature of our space.\n> Or a straight line with a slope that changes over time.\nYou MAY want to look at an elementary-level geometry text and see if you can find a definition for 'straight line' and 'curve'.\nThe x axis on that graph is effectively \"time.\" So something that changes in strength over time will trace out a curve. Something that is constant in time will be straight. \"A straight line that changes slope over time\" doesn't make sense.\nThe x axis on that graph is effectively \"time.\"Right. But that's not the \"straight line\" I was referring to. Straight line as in the contribution of dark energy to the acceleration of matter in our universe. Which turns out not to be so straight if the influence of DE isn't constant. In simplistic models, the characteristic of acceleration due to a constant force is a straight line (untill you approach relatavistic speeds). Add some complexity in the form of non-uniform mass distribution in either space or time and galaxies further away (earlier in time \nThe x axis on that graph is effectively \"time.\"\nRight. But that's not the \"straight line\" I was referring to. Straight line as in the contribution of dark energy to the acceleration of matter in our universe. Which turns out not to be so straight if the influence of DE isn't constant. In simplistic models, the characteristic of acceleration due to a constant force is a straight line (untill you approach relatavistic speeds). Add some complexity in the form of non-uniform mass distribution in either space or time and galaxies further away (earlier in time \n1. Our universe exists within a black hole.\nIt may (or may not ; I don't particularly care) be true that some estimates of the mass-energy content of the universe, and it's alleged radius (from what observations, I forget) are not inherently inconsistent with that radius being the event horizon of a black hole of the universe's apparent mass-energy. Great, fine marvellous.\n\nBut in the universe we can see, we know of no force which can stop the collapse of material within a black hole into ever-increasing den\nGetting weaker because the bag is full.\nThere may be more comments in this discussion. Without JavaScript enabled, you might want to turn on Classic Discussion System in your preferences instead.\nApple Shakes Up AI Executive Ranks in Bid to Turn Around Siri\nPebble Founder Warns of Limited iPhone Compatibility for Revived Smartwatch\nFunction reject.",
        "keywords": [
            "dark matter",
            "Dark energy",
            "Dark",
            "suggest dark matter",
            "matter",
            "dark matter exist",
            "evidence",
            "facts suggest dark",
            "energy",
            "Facebook Nickname"
        ]
    },
    {
        "id": "a2556b79-548f-4a6f-89b0-957845c827d8",
        "type": "article",
        "domaine": "science",
        "titre": "Inside arXiv - the Most Transformative Platform in All of Science",
        "url": "https://science.slashdot.org/story/25/03/27/1456239/inside-arxiv---the-most-transformative-platform-in-all-of-science",
        "description": "Paul Ginsparg, a physics professor at Cornell University, created arXiv nearly 35 years ago as a digital repository where researchers could share their findings before peer review. Today, the platform hosts more than 2.6 million papers, receives 20,000 new su…",
        "source": "Slashdot.org",
        "author": "msmash",
        "date_pub": "2025-03-27T14:55:00Z",
        "contenu": "\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tCatch up on stories from the past week (and beyond) at the Slashdot story archive\n\n\nNickname:\n\n\n\nPassword:\n\n\n\nNickname:\n\n\n\nPassword:\n\n\n\nThe Fine Print: The following comments are owned by whoever posted them.  We are not responsible for them in any way.\n\nGood for him.   It seems that a) objectivity, b) basic utility, and c) lack of the drive to monetize  has some value after all.\nIt seems that a) objectivity, b) basic utility, and c) lack of the drive to monetize has some value after all.\nYes....but recently arXiv has taken actions that cannot be argued to be objective at all. It banned Jorge Hirsch [science.org] a theoretical physicist from posting for 6-months because it claimed that he posted \"inflammatory\" papers.\n \nThese were papers that criticized claims of the discovery of room temperature superconductivity in high pressure metal hydrides. If you actually read the papers - which many of us even outside the field did because of the controversial ban - what you read was a clear, well-constructed scientific argument raising objective problems and concerns with the published data. The only way that the papers could said to be inflamatory is that they raised objective concerns, grounded in clear scientific arguments about other published papers...but this is something that is a key part of the scientific process: you _have_ to allow objective criticism of results because nobody is above making a mistake.\n \nAs it turned out there is now clear evidence that the results were not only wrong but that at least some of the data were fabricated leading to paper retractions and the dismissal of one of the key authors. [nature.com] So not only was arXiv wrong in principle to silence the voice of someone raising objective concerns with the results is was also objectively wrong to do so (although nobody knew that for certain at the time). In essence arXiv became an obstacle to science correcting itself rather than a mechanism that helps it do so.\n \nThere is no doubt that arXiv has been incredibly useful and was very innovative - although claiming it is the most transformative platform ever for science is utter nonsence since the web, which arXiv uses and which was invented at CERN, has clearly been far more transformative and not just for science. However, like Google's \"don't be evil\" motto - what starts as a great thing can often grow to the point where significant problems start to appear and sadly we may be starting to see that with arXiv if incidents like this are repeated.\nIt seems that a) objectivity, b) basic utility, and c) lack of the drive to monetize has some value after all.\n\nYes....but recently arXiv has taken actions that cannot be argued to be objective at all. It banned Jorge Hirsch [science.org] a theoretical physicist from posting for 6-months because it claimed that he posted \"inflammatory\" papers.\n \nThese were papers that criticized claims of the discovery of room temperature superconductivity in high pressure metal hydrides. If you actually read the papers - which many of us even outside the field did because of the controversial ban - what you read was a clear, well-constructed scientific argument raising objective problems and concerns with the published data. The only way that the papers could said to be inflamatory is that they raised objective concerns, grounded in clear scientific arguments about other published papers...but this is something that is a key part of the scientific process: you _have_ to allow objective criticism of results because nobody is above making a mistake.\n \nAs it turned out there is now clear evidence that the results were not only wrong but that at least some of the data were fabricated leading to paper retractions and the dismissal of one of the key authors. [nature.com] So not only was arXiv wrong in principle to silence the voice of someone raising objective concerns with the results is was also objectively wrong to do so (although nobody knew that for certain at the time). In essence arXiv became an obstacle to science correcting itself rather than a mechanism that helps it do so.\n \nThere is no doubt that arXiv has been incredibly useful and was very innovative - although claiming it is the most transformative platform ever for science is utter nonsence since the web, which arXiv uses and which was invented at CERN, has clearly been far more transformative and not just for science. However, like Google's \"don't be evil\" motto - what starts as a great thing can often grow to the point where significant problems start to appear and sadly we may be starting to see that with arXiv if incidents like this are repeated.\narXiv isn't really special. It's just a preprint server - a server where people can post their papers for review before they undergo formal peer review and then publication.\nIt's just it's one of the more popular ones around so people post their preprint (and often final draft) papers on there, and once it's published, many others find the draft papers on arXiv to avoid paying for the journal to get a copy of the paper.\nBut in the end, it's still a preprint server. It's just a popular one where people from al \nA velvet-roped archive where truth waits behind a paywall, and progress pays rent—that is the alternative to arXiv. Yes, it is messy—built on idealism, duct tape, and volunteer resolve. But that mess is freedom. That mess is science in motion.  Criticizing arXiv for imperfect moderation is like accusing a public library of censorship for declining to archive manifestos scrawled in crayon and invective—then demanding they be shelved next to The Feynman Lectures on Physics. It is not censors \nA velvet-roped archive where truth waits behind a paywall, and progress pays rent—that is the alternative to arXiv.\nThat's not really true anymore - many journals are now open access and many institutes have deals that allow for free submission of papers by faculty making their work freely available to all if it passes peer review.arXiv's moderation is imperfect, but rooted in transparent, field-specific standards....The ban targeted tone, not dissent.\nThere is no physics standard that Hirsh's papers failed to meet and the tone of the papers was exactly consistent with that of many other papers that arXiv happily accepts: it raised problems with previously published papers based on solid scientific reasoning. arXiv's moderation may not be i \nA velvet-roped archive where truth waits behind a paywall, and progress pays rent—that is the alternative to arXiv.\n\nThat's not really true anymore - many journals are now open access and many institutes have deals that allow for free submission of papers by faculty making their work freely available to all if it passes peer review.\narXiv's moderation is imperfect, but rooted in transparent, field-specific standards....The ban targeted tone, not dissent.\nThere is no physics standard that Hirsh's papers failed to meet and the tone of the papers was exactly consistent with that of many other papers that arXiv happily accepts: it raised problems with previously published papers based on solid scientific reasoning. arXiv's moderation may not be i \narXiv's moderation is imperfect, but rooted in transparent, field-specific standards....The ban targeted tone, not dissent.\n\nThere is no physics standard that Hirsh's papers failed to meet and the tone of the papers was exactly consistent with that of many other papers that arXiv happily accepts: it raised problems with previously published papers based on solid scientific reasoning. arXiv's moderation may not be i \nHow do you pronounce it?\nHow do you pronounce it?From Wikipedia [wikipedia.org], \"arXiv (pronounced as \"archive\"—the X represents the Greek letter chi )\".\nHow do you pronounce it?\nFrom Wikipedia [wikipedia.org], \"arXiv (pronounced as \"archive\"—the X represents the Greek letter chi )\".\nHow do you pronounce it?The \"X\" in arXive is the greek letter Chi, pronounced with a hard \"k\".  As Paul Ginsparg explained in interviews (and as noted in the Wired article, if you haven't read it yet) he originally considered calling it “archive,” but the domain was taken. So, he and his wife stylized it as arXiv, with \"X\" standing in for the Greek Chi, keeping it symmetrical and clever.\nHow do you pronounce it?\nThe \"X\" in arXive is the greek letter Chi, pronounced with a hard \"k\".  As Paul Ginsparg explained in interviews (and as noted in the Wired article, if you haven't read it yet) he originally considered calling it “archive,” but the domain was taken. So, he and his wife stylized it as arXiv, with \"X\" standing in for the Greek Chi, keeping it symmetrical and clever.\nSo, funding is now from the Simons Foundation, after being donated from Cornell's library and then the Computing and Information Science division.  That's good that they now have the funding to hire software engineers and buy cloud resources.  It's also interesting that the original code was in Perl but recently was rewritte in Python.\nThere may be more comments in this discussion. Without JavaScript enabled, you might want to turn on Classic Discussion System in your preferences instead.\nNintendo Unveils Digital Game Sharing\nChina Built Hundreds of AI Data Centers To Catch the AI Boom. Now Many Stand Unused.\nFunction reject.",
        "keywords": [
            "Fine Print",
            "papers",
            "arXiv",
            "story archive Nickname",
            "Slashdot story archive",
            "published papers",
            "Slashdot story",
            "Password",
            "archive Nickname",
            "Nickname"
        ]
    },
   
    {
        "id": "cc488106-942a-4afa-9af1-f0127f3cd8af",
        "type": "article",
        "domaine": "science",
        "titre": "Retrotechtacular: Better Living Through Nuclear Chemistry",
        "url": "https://hackaday.com/2025/03/08/retrotechtacular-better-living-through-nuclear-chemistry/",
        "description": "The late 1950s were such an optimistic time in America. World War II had been over for less than a decade, the economy boomed thanks to pent-up demand after years of privation, and everyone was hav…",
        "source": "Hackaday",
        "author": "Dan Maloney",
        "date_pub": "2025-03-09T06:00:07Z",
        "contenu": "The late 1950s were such an optimistic time in America. World War II had been over for less than a decade, the economy boomed thanks to pent-up demand after years of privation, and everyone was having babies — so many babies. The sky was the limit, especially with new technologies that promised a future filled with miracles, including abundant nuclear power that would be “too cheap to meter.”\nIt didn’t quite turn out that way, of course, but the whole “Atoms for Peace” thing did provide the foundation for a lot of innovations that we still benefit from to this day. This 1958 film on “The Armour Research Reactor” details the construction and operation of the world’s first privately owned research reactor. Built at the Illinois Institute of Technology by Atomics International, the reactor was a 50,000-watt aqueous-homogenous design using a solution of uranyl sulfate in distilled water as its fuel. The core is tiny, about a foot in diameter, and assembled by hand right in front of the camera. The stainless steel sphere is filled with 90 feet (27 meters) of stainless tubing to circulate cooling water through the core. Machined graphite reflector blocks surrounded the core and its fuel overflow tank (!) before the reactor was installed in “biological shielding” made from super-dense iron ore concrete with walls 5 feet (1.5 m) thick — just a few of the many advanced safety precautions taken “to ensure completely safe operation in densely populated areas.”\nWhile the reactor design is interesting enough, the control panels and instrumentation are what really caught our eye. The Fallout vibe is strong, including the fact that the controls are all right in the room with the reactor. This allows technicians equipped with their Cutie Pie meters to insert samples into irradiation tubes, some of which penetrate directly into the heart of the core, where neutron flux is highest. Experiments included the creation of radioactive organic compounds for polymer research, radiation hardening of those new-fangled transistors, and manufacturing radionuclides for the diagnosis and treatment of diseases.\nThis mid-century technological gem might look a little sketchy to modern eyes, but the Armour Research Reactor had a long career. It was in operation until 1967 and decommissioned in 1972, and similar reactors were installed in universities and private facilities all over the world. Most of them are gone now, though, with only five aqueous-homogenous reactors left operating today.\n\n\nif I’m not mistaken, properly reconstructing this reactor was part of the entrance exam for vault tech University wasn’t it? :-)\n“homogenous” is my favourite typo, when people usually mean “homogeneous”.\nThe definitions seem suspiciously similar, like cognates spelled differently on either side of the pond. Another meaning is antiquated but still sounds (very nearly) synonymous\nIt’s also interesting to note that the heating fuel used in many American homes was coal.  It’s hard for us to imagine these days that you actually had to go down and shovel something that was delivered via a filthy chute into your basement into a furnace by hand.  It also did not exactly produce the cleanest heat, and there was often a veneer of coal dust on everything.  My grandmother told me the happiest day in her life was when they converted their home to natural gas in the early 1970s.  Their electricity oddly csme from a nuclear plant.\nThere was also this contemporary reactor, which subsequently had many serious accidents.\nhttps://en.wikipedia.org/wiki/Santa_Susana_Field_Laboratory\nOh my god.  Rocket fuel and nuclear waste.  Shooting at barrels of radioactive sodium with a shotgun “dispose” of them.\nIn the end, running a handful of test reactors at the site sounds like the safest thing they did.\n“The late 1950s were such an optimistic time in America. World War II had been over for less than a decade”\nOoooh, super embarrassing and right out of the gate too.  That’s gotta hurt and it’s gonna cost him with the judges.  Perhaps the new math was too late.  Alexa, ask Suri when ChatGPT would say WWII ended.\nConsidering that this is practically the only part of history that anybody in this country knows these days, I suspect they know perfectly well and were going off the number “1950,” forgetting the “late” in front of it\nSo knowing history by not knowing it.  Gotcha.  The dogwalker’s friend, the no-plastic-bag.\nNope, 100% correct. It HAD been over for less than a decade. Later it was over for more than a decade.\n“The licensing agreement highlights a long-standing relationship between Intel and Sandia in the development of advanced technologies. Intel provided similar rights to Sandia in the 1980s for the Intel 8085 and 8051 microcontrollers. ”\nhttps://www.sandia.gov/media/rhp.htm\nSandia hardware crm designers in the 1980s were required to retrieve their radiation experiments.\nWe could identify them by their radiation exposure  badges.\nEmbedded controller forth for the 8051 family is software part of Sandia  Labs  8051 rad hard project.\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "Armour Research Reactor",
            
            "Reactor",
            "Armour Research",
            "owned research reactor",
            "reactors",
            "World War",
            "Research",
            "Sandia",
            "core"
        ]
    },
    {
        "id": "5e62f594-9c4e-4b18-8c58-ae19ab3b61ec",
        "type": "article",
        "domaine": "science",
        "titre": "Chemistry Meets Mechatronics in This Engaging Art Piece",
        "url": "https://hackaday.com/2025/03/20/chemistry-meets-mechatronics-in-this-engaging-art-piece/",
        "description": "There’s a classic grade school science experiment that involves extracting juice from red cabbage leaves and using it as a pH indicator. It relies on anthocyanins, pigmented compounds that give …read more",
        "source": "Hackaday",
        "author": "Dan Maloney",
        "date_pub": "2025-03-20T11:00:00Z",
        "contenu": "There’s a classic grade school science experiment that involves extracting juice from red cabbage leaves and using it as a pH indicator. It relies on anthocyanins, pigmented compounds that give the cabbage its vibrant color but can change depending on the acidity of the environment they’re in, from pink in acidic conditions to green at higher pH. And anthocyanins are exactly what power this unusual kinetic art piece.\nEven before it goes into action, [Nathalie Gebert]’s Anthofluid is pretty cool to look at. The “canvas” of the piece is a thin chamber formed by plexiglass sheets, one of which is perforated by an array of electrodes. A quartet of peristaltic pumps fills the chamber with a solution of red cabbage juice from a large reservoir, itself a mesmerizing process as the purple fluid meanders between the walls of the chamber and snakes around and between the electrodes. Once the chamber is full, an X-Y gantry behind the rear wall moves to a random set of electrodes, deploying a pair of conductors to complete the circuit. When a current is applied, tendrils of green and red appear, not by a pH change but rather by the oxidation and reduction reactions occurring at the positive and negative electrodes. The colors gently waft up through the pale purple solution before fading away into nothingness. Check out the video below for the very cool results.\nWe find Anthofluid terribly creative, especially in the use of such an unusual medium as red cabbage juice. We also appreciate the collision of chemistry, electricity, and mechatronics to make a piece of art that’s so kinetic but also so relaxing at the same time. It’s the same feeling that [Nathalie]’s previous art piece gave us as it created images on screens of moving thread.\n\nSomeone should make a clock out of that\n*I should make a clock out of that\n*I already have too many projects\n*Someone should make a clock out of that\nI absolutely love this\nI’d imagine you can make primitice images in rbg doing this in cells all at once (or timed) to create a, say, 32×32 image ?\nSo much art. So much wow.\nI assume the reaction products are both less dense than the baseline solution, which is why they form trails upwards during the energization. For some reason I find that surprising; I guess I figured one of them would end up heavier since the oxygen added to the oxidized product would either be heavier or lighter than what it replaced or joined too (depending on the chemistry). But I guess not. Maybe the products are getting heated by the process and are thus less dense? Some many questions. And I want to watch it for longer to get into the slow mental space I’m assuming it would elicit. Very cool.\nOxidation in this case is the loss of an electron, not gain of oxygen. An interesting review of anthocyanin chemistry (in the professional literature, but there are some nice chemical structures to showcase what is happening) is here: https://pmc.ncbi.nlm.nih.gov/articles/PMC7504512/ . I am speculating as to why they would both float up, but it may be due to the potential used in the electrolysis. If it is just high enough to convert water to oxygen at the anode and hydrogen at the cathode, then microbubbles of gases might be formed, and these bubbles are causing the convection. One can see some bubbles forming on one of the green-colored electrode in the cover picture. We’d need to learn more about the applied potentials to confirm.\nPlease be kind and respectful to help make the comments section excellent. (Comment Policy)\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\t\t\t\t\t\tBy using our website and services, you expressly agree to the placement of our performance, functionality and advertising cookies. Learn more",
        "keywords": [
            "classic grade school",
            "grade school science",
            "school science experiment",
            "involves extracting juice",
            "red cabbage leaves",
            "red cabbage juice",
            "classic grade",
            "grade school",
            "school science",
            "science experiment"
        ]
    },
  
    {
        "id": "5b5d4f6c-fb52-49c7-af71-b071eefc1d05",
        "type": "article",
        "domaine": "science",
        "titre": "'Studying chemistry helped me sell millions of oat milk bottles'",
        "url": "https://uk.finance.yahoo.com/news/oato-fresh-oat-milk-round-supermarket-060047084.html",
        "description": "Chemistry graduate Carl Hopwood is founder of Oato, the only fresh oat milk in UK supermarkets.",
        "source": "Yahoo Entertainment",
        "author": "Rod Gilmour",
        "date_pub": "2025-03-22T06:00:47Z",
        "contenu": "Something went wrong\nA chemistry degree has helped Carl Hopwood sell over 25 million bottles of his British-made oat milk brand — along with plenty of trial, error and toil to produce the elements needed for start-up success.\nFrom a testing kit at home in Lancashire where Hopwood launched his business in late 2019, Oato now supplies doorsteps via traditional milk rounds and is the only fresh oat milk in UK supermarkets.\n“I knew there was a product to make but I didn’t necessarily know how to get there,” says Hopwood. “It was about conducting multiple experiments and not being put off by failure.”\nRead More: 'I couldn't find a babysitter so I set up a £10m childcare business' \nGrowing up in Exeter, Hopwood attended Steiner school and a local community college before studying chemistry at Edinburgh University. It was his first time in Scotland as he sought to get away from the West Country.\n“It was an interesting four years and chemistry teaches you to be quite analytical in how you work and not to be too afraid of working hard,\" he tells Yahoo Finance UK. \"I knew it wasn’t for me but it was a good, gruelling academic experience.”\nA high proportion of chemists tend to go on to do accounting, but he instead opted for sales. “It’s a good base before you start a business,” says Hopwood, who also co-founded a customised garment business while at university.\nHopwood started work for a small US firm called Tech Soft 3D as their European business manager, where he would sell 3D visualisation software from his North West base.\n“It was a great experience negotiating for the long-term and building up a relationship,” he adds, “having a pipeline of people who were maybe interested in your product, who you can keep the communication up and also learn about marketing.”\nRead More: 'I paid myself £4 an hour to get my deodorant brand off the ground'\nAt their office, employees purchased their own cow’s milk and over eight years had switched to an oat milk barista for their coffee machine. “When you used the cow’s milk, you put the bottle into recycling, but with the Tetrapak cartons there was no way to recycle them and so the used ones were just stacking up outside the door,” recalls Hopwood.\n“I thought there must be a better way to distribute this product than in a non-recycled Tetrapak. That was my first inspiration and creating a liquid product is quite similar to the backbones of chemistry.”\nHopwood purchased a table top stove with a magnetic stirrer where he could blend oats, water and enzymes together at home. Through trial and error he was able to land upon a recipe he and his housemates were happy with.\nHaving trialled a bigger batch at a local college, Hopwood then partnered with a brewery which could produce 5,000 bottles a week.\n“On the production and chemistry side, I was trialling different batches at home and, on the business side, I set up a brand, registered the company, created a website and marketed it on Facebook as ‘Try a free pint delivered by a milkman’ before we had a route to market,” says the entrepreneur.\nHe quickly acquired a list of 1,500 who were interested in trialling oat milk. Location also proved key, with small, family-run dairies some of the few still existing in the UK who would wash and refill bottles with cow’s milk.\nOato was then able to team up with the dairies on the days no milk was bottled to produce its own product, using milkmen in Kendle and Lancaster where the fledgling company had 1,200 signed up for the trials.\n“I thought if that was the volume across that population, what would it be across the UK? It was a good estimate of the potential scale,” adds Hopwood.\n“We now want to be in 50% of fridges in the UK. We realised we could get a long way there through the milk rounds. If we want to reach everybody we need to supply retail.”\nOato now operates from a 55,000 sq ft facility in Preston. The difference, says Hopwood, is that he was previously paying per litre that was packed whereas now it is fixed overheads and staff costs to name but two.\n“Although we have a much larger capacity, which we hope to optimise, there is definitely the concern when you are taking on a premises like that with a lot of outlay,” admits Hopwood.\n“But I think what we’re doing is quite unique in the UK, coming in with a new product in single use packaging. Because we are a fresh product, it’s a much more tasty product to consume. It has that advantage.\nRead More: How Jeff Dewing went from bankruptcy to £70m fortune\n“In retail, we are a small brand in terms of the awareness but our rate of sale is good in supermarkets because of the familiarity and the price point we can do.”\nHopwood is now setting a goal of crossing the 100 million bottles sold barrier within the next few years.\n“It’s important to set goals that are achievable in the short term,” he admits.\n“Being a single business founder and not taking on loads of investment [£60,000 to date] and not having a board of VCs saying to make that target bigger, which I am quite happy for, it means we can be quite realistic about the next target.”\nBusiness hero Yvon Chouinard, Patagonia founder\nHe created a brand out of his own need, saw a small market and scaled it. It doesn’t feel like he's grown a brand out of greed but out of authenticity. Sustainability has been a key factor in his focus for growth; the more you can spread the product out, the more sustainable people’s choices are.\nWith oat milk consumers and what we’ve done in creating a sustainable product, in terms of CO2 output it is one tenth of the dairy milk output.\nA lot of oat milk doesn’t use British oats, whereas we use 100% British oats, while Tetrapaks aren’t sustainable due to not being recyclable.\nThe reused life span of a single Oato bottle is used by an average 28 households, with a 97% return rate. Producing a sustainable product in reusable glass was a combination of two things that has allowed us to accelerate our growth.\nWe had some push back going into the plastics, but the product itself is still very sustainable.\nRead more:\n'My sofa took six months to arrive — so I built a £20m business'\n'Dragons' Den failure sparked my alcohol-free brand's rise'\n'Want to grow an iconic brand? CEOs have to value CMOs as servant leaders'\nDownload the Yahoo Finance app, available for Apple and Android.\nSign in to access your portfolio",
        "keywords": [
            "Hopwood",
            "oat milk",
            "milk",
            "British-made oat milk",
            "helped Carl Hopwood",
            "Carl Hopwood sell",
            "product",
            "brand",
            "oat milk brand"
        ]
    },
    {
        "id": "1f866cee-e6e5-48cd-a972-e824adaa26be",
        "type": "article",
        "domaine": "science",
        "titre": "How a Cup of Tea Laid the Foundations for Modern Statistical Analysis",
        "url": "https://www.wired.com/story/how-a-cup-of-tea-laid-the-foundations-for-modern-statistical-analysis-adam-kucharski-proof-book/",
        "description": "Scientific experiments run today are based on research practices that evolved out of a British tea-tasting experiment in the 1920s.",
        "source": "Wired",
        "author": "Adam Kucharski",
        "date_pub": "2025-03-26T12:00:00Z",
        "contenu": "If you buy something using links in our stories, we may earn a commission. Learn more.\nIn the early 1920s, a trio of scientists sat down for a break at Rothamsted agricultural research station in Hertfordshire, UK. One of them, a statistician by the name of Ronald Fisher, poured a cup of tea, then offered it to his colleague Muriel Bristol, an algae specialist who would later have the plant C. muriella named after her. Bristol refused, as she liked to put the milk in before the tea. Fisher was skeptical. Surely it didn’t matter? Yes, she said, it did. A cup with milk poured first tasted better.\n“Let’s test her,” chipped in the third scientist, who also happened to be Bristol’s fiancé. That raised the question of how to assess her tasting abilities. They would need to make sure she was given both types of tea, so she could make a fair comparison. They settled on pouring several cups, some tea-then-milk and others milk-then-tea, then getting her to try them one at a time. But there were still a couple of problems. Bristol might try to anticipate the sequence they’d chosen, which meant cups needed to arrive in a genuinely random order. And even if the ordering was random, she might get a few correct by chance. So there would need to be enough cups to ensure this was sufficiently unlikely.\nFisher realized that if they gave her six cups—three with milk first and three with milk second—there were 20 different ways they could be randomly ordered. Therefore, if she simply guessed, one in 20 times she’d get all six correct. What about using eight cups instead? In this situation, Fisher calculated there were 70 possible combinations, meaning there was a one in 70—or 1.4 percent—probability she’d get the sequence right by sheer luck. This was the experiment they decided to run with Bristol. They poured eight cups, four of each type, and got her to test them in a random order. She named the four she preferred, and the four she disliked, then they compared her conclusions with the true pattern. She’d got all eight correct.\nBuy this book at:\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\nThe reason for Bristol’s success was ultimately down to chemistry. In 2008, the Royal Society of Chemistry reported that tea-then-milk will give the milk a more burnt flavour. “If milk is poured into hot tea, individual drops separate from the bulk of the milk and come into contact with the high temperatures of the tea for enough time for significant denaturation to occur,” they noted. “This is much less likely to happen if hot water is added to the milk.”\nFisher later described the tea-tasting experiment in a 1935 book titled simply The Design of Experiments. Among other things, the book summarized the crucial techniques they’d pioneered in that Rothamsted tea room. One was the importance of randomization; it wouldn’t have been a rigorous test of Bristol’s ability if the ordering of the cups was somehow predictable. Another was how to arrive at a scientific conclusion. Fisher’s basic statistical recipe was simple: start with an initial theory—he called it the “null hypothesis”—then test it against data. In the Rothamsted tea room, Fisher’s null hypothesis had been that Bristol couldn’t tell the difference between tea-then-milk and milk-then-tea. Her success in the resulting experiment showed Fisher had good reason to discard his null hypothesis.\nBut what if she’d only got seven out of eight correct? Or six, or five? Would that mean the null hypothesis was correct and she couldn’t tell the difference at all? According to Fisher, the answer was no. “It should be noted that the null hypothesis is never proved or established, but is possibly disproved, in the course of experimentation,” he later wrote. “Every experiment may be said to exist only in order to give the facts a chance of disproving the null hypothesis.” If Bristol had got one or two wrong, it didn’t necessarily mean she had zero ability to distinguish milk order. It just meant the experiment hadn’t provided strong enough evidence to reject Fisher’s initial view that it made no difference.\nIf Fisher wanted experiments to challenge null hypotheses, he needed to decide where to set the line. Statistical findings have traditionally been deemed “significant” if the probability of obtaining a result that extreme by chance (i.e. the p-value) is less than 5 percent. But why did a p-value of 5 percent become such a popular threshold?\nIt came down to a combination of copyright and convenience. In a 1908 paper, the statistician William Sealy Gosset had investigated how randomness in data could influence data analysis, with the paper containing pages of statistical tables on the influence of randomness. Fisher was keen to draw upon this research, but was cautious about lifting the copyrighted tables directly. So instead he reframed them, and found that a suitable p-value for determining statistical significance suggested by the work—of around 4.6 percent—lined up neatly with some calculations he had already been doing. It was easy to round it up to 5 percent.\nWhen Muriel Bristol picked those cups, there was a 1.4 percent chance she would get that many correct. In Fisher’s eyes, this provided “significant” evidence that his null hypothesis was wrong. As he would later put it, a p-value below 5 percent meant “either an exceptionally rare chance has occurred or the theory is not true.”\nThe statistical comparison used in that tea-room experiment would become known as “Fisher’s exact test,” but not everyone was convinced Fisher had got his approach exactly right. In his experiments, Fisher was interested in testing whether the null hypothesis was wrong, not in deciding which hypothesis was correct. Suppose Muriel Bristol had got a couple of cups wrong. On balance, should we conclude that she couldn’t tell the difference? Or that she could? As we’ve seen, Fisher’s test dodges making a choice in this situation; it doesn’t come to any conclusion.\nStatisticians Jerzy Neyman and Egon Pearson (the son of Karl Pearson, who first coined the p-value) didn’t think this was good enough. If they started with two hypotheses—such as whether someone can or can’t tell the difference between cups of tea—they didn’t want a method that refuses to choose. According to Neyman and Pearson, researchers need a way to decide which hypothesis to accept and which to reject.\nThis decision-based attitude to statistics is analogous to the approach taken in legal cases. Much like legal decisions, Neyman and Pearson’s approach requires us to decide on the burden of proof: faced with a particular piece of evidence, how skeptical should we be? If we’re easily persuaded, we’ll end up accepting many hypotheses, whether or not they’re true. In contrast, if we set the bar for evidence very high, we’ll throw out most hypotheses that are false, but also disregard many that are true.\nTo deal with this trade-off, Neyman and Pearson introduced two concepts that would go on to plague statistics students: type I and type II errors. The first error occurs when we incorrectly accept the false hypothesis; the second happens when we incorrectly reject the true hypothesis.\nConsider the Blackstone ratio, which suggests that it’s better to have 10 guilty people incorrectly released than have one innocent person imprisoned. In essence, the ratio is saying that, when it comes to criminal justice, the chance of a type I error should be 10 times smaller than the chance of a type II error. In medical studies, a ratio 4 is commonly used instead: the popular threshold for a type I error is a probability of 5 percent (thanks to Fisher) but 20 percent for a type II error. We don’t want to miss a treatment that works, but we really don’t want to conclude that a treatment works when it doesn’t.\nFisher did not take Neyman and Pearson’s criticisms well. In response, he called their methods “childish” and “absurdly academic.” In particular, Fisher disagreed with the idea of deciding between two hypotheses, rather than calculating the “significance” of available evidence, as he’d proposed. Whereas a decision is final, his significance tests gave only a provisional opinion, which could be later revised. Even so, Fisher’s appeal for an open scientific mind was somewhat undermined by his insistence that researchers should use a 5 percent cutoff for a “significant” p-value, and his claim that he would “ignore entirely all results which fail to reach this level.”\nAcrimony would give way to decades of ambiguity, as textbooks gradually muddled together Fisher’s null hypothesis testing with Neyman and Pearson’s decision-based approach. A nuanced debate over how to interpret evidence, with discussion of statistical reasoning and design of experiments, instead became a set of fixed rules for students to follow.\nMainstream scientific research would come to rely on simplistic p-value thresholds and true-or-false decisions about hypotheses. In this role-learned world, experimental effects were either present or they were not. Medicines either worked or they didn’t. It wouldn’t be until the 1980s that major medical journals finally started breaking free of these habits.\nIronically, much of the shift can be traced back to an idea that Neyman coined in the early 1930s. With economies struggling in the Great Depression, he’d noticed there was growing demand for statistical insights into the lives of populations. Unfortunately, there were limited resources available for governments to study these problems. Politicians wanted results in months—or even weeks—and there wasn’t enough time or money for a comprehensive study. As a result, statisticians had to rely on sampling a small subset of the population. This was an opportunity to develop some new statistical ideas. Suppose we want to estimate a particular value, like the proportion of the population who have children. If we sampled 100 adults at random and none of them are parents, what does this suggest about the country as a whole? We can’t say definitively that nobody has a child, because if we sampled a different group of 100 adults, we might find some parents. We therefore need a way of measuring how confident we should be about our estimate. This is where Neyman’s innovation came in. He showed that we can calculate a “confidence interval” for a sample which tells us how often we should expect the true population value to lie in a certain range.\nConfidence intervals can be a slippery concept, given they require us to interpret tangible real-life data by imagining many other hypothetical samples being collected. Like those type I and type II errors, Neyman’s confidence intervals address an important question, just in a way that often perplexes students and researchers. Despite these conceptual hurdles, there is value in having a measurement that can capture the uncertainty in a study. It’s often tempting—particularly in media and politics—to focus on a single average value. A single value might feel more confident and precise, but ultimately it is an illusory conclusion. In some of our public-facing epidemiological analysis, my colleagues and I have therefore chosen to report only the confidence intervals, to avoid misplaced attention falling on specific values.\nSince the 1980s, medical journals have put more focus on confidence intervals rather than standalone true-or-false claims. However, habits can be hard to break. The relationship between confidence intervals and p-values hasn’t helped. Suppose our null hypothesis is that a treatment has zero effect. If our estimated 95 percent confidence interval for the effect doesn’t contain zero, then the p-value will be less than 5 percent, and based on Fisher’s approach, we will reject the null hypothesis. As a result, medical papers are often less interested in the uncertainty interval itself, and instead more interested in the values it does—or doesn’t—contain. Medicine might be trying to move beyond Fisher, but the influence of his arbitrary 5 percent cutoff remains.\nExcerpt adapted from Proof: The Uncertain Science of Certainty, by Adam Kucharski. Published by Profile Books on March 20, 2025, in the UK.\nIn your inbox: Upgrade your life with WIRED-tested gear\nHow to avoid US-based digital services, and why you might want to\nThe Big Story: Inside Elon Musk’s ‘digital coup’\n‘Airport theory’ will make you miss your flight\nSpecial Edition: How to get computers—before computers get you\nMore From WIRED\nReviews and Guides\n© 2025 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices",
        "keywords": [
        
            "Fisher",
            "Neyman and Pearson",
           
           
            "Bristol"
        ]
    },
    {
        "id": "4e6895fd-d034-4618-b960-14ffff21f62d",
        "type": "article",
        "domaine": "science",
        "titre": "NASA's Curiosity Rover Detects Largest Organic Molecules Yet Found on Mars",
        "url": "https://science.slashdot.org/story/25/03/25/018216/nasas-curiosity-rover-detects-largest-organic-molecules-yet-found-on-mars",
        "description": "NASA's Curiosity rover has detected the largest organic molecules ever found on Mars -- decane, undecane, and dodecane -- suggesting that complex prebiotic chemistry may have occurred in the planet's ancient lakebeds. The findings have been published in the P…",
        "source": "Slashdot.org",
        "author": "BeauHD",
        "date_pub": "2025-03-25T07:00:00Z",
        "contenu": "\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tSlashdot is powered by your submissions, so send in your scoop\n\t\t\t\t\t\n\t\t\t\t\n\nNickname:\n\n\n\nPassword:\n\n\n\nNickname:\n\n\n\nPassword:\n\n\n\nThe Fine Print: The following comments are owned by whoever posted them.  We are not responsible for them in any way.\n\nIt's okay, DEI is gone now you can go back to using \"unacceptable\" terms like fatty-acids. ... Oh wait that one may be taken.\nYou just gave all the Maggots erections.\nThe term is \"Big-boney acids\".\n\nReport for re-education.Speaking of re-education. It's \"Acids with great personality.\"\nThe term is \"Big-boney acids\".\n\nReport for re-education.\nSpeaking of re-education. It's \"Acids with great personality.\"\nNo need to explore Mars if their chicks are fat. Let's try Venus.\nIntelligent life might be rare however, it certainly seems to be the case given a cursory glance around our homeworld.\nWhy, there is a bunch of intelligent life forms on Earth. Dogs and wolves, dolphins and whales, some monkeys and apes.\nBut Earth evolved advanced trolls via survival of the trolliest.\nOn a serious note, I suspect Earth life originated on Mars because Mars grew hospitable before the Earth did because its volcanos mellowed out earlier, being a smaller planet. Then a meteorite may have later blasted that life toward Earth, when it was ready.\nWhich is a universal problem with the concept of panspermia, rendering it functionally useless as a theory. By cast \n... we figure out how life actually started - ie went from a soup of organic molecules into chemistry that could reproduce itself and evolve then its all just what-if hand waving. For all we know there could have been some very special short lived conditions on early earth that allowed it to occur. Or, alternatively its an emergency property of certain chemical conditions. We just don't know.\nFscking auto correct - \"EMERGENT property\"\nI liked \"emergency property\". It has an air of molecules getting together and feeling like they ought to get the show on road before some other planet beats them to it.\nAncient explorers used that water to bathe then flew away in their space ship.\n... we figure out how life actually started - ie went from a soup of organic molecules into chemistry that could reproduce itself and evolve then its all just what-if hand waving. This is helping us narrow down the range over which we have to do that handwaving. The Miller-Urey hypothesized process for how life started is simple organic molecules --> larger organic molecules --> very large organic molecules --> self-replicating organic molecules --> life. But we have now seen larger organic molecules on Mars, and amino acids in meteorites and asteroidal surface samples. So, we're narrowing down the area we need to explore.The path from large molecules to self-replicating molecules (such as DNA or RNA) is yet to be found.For all we know there could have been some very special short lived conditions on early earth that allowed it to occur. Or, alternatively its an emergency property of certain chemical conditions. We just don't know.Which is why we're looking.\n... we figure out how life actually started - ie went from a soup of organic molecules into chemistry that could reproduce itself and evolve then its all just what-if hand waving.\nThis is helping us narrow down the range over which we have to do that handwaving. The Miller-Urey hypothesized process for how life started is simple organic molecules --> larger organic molecules --> very large organic molecules --> self-replicating organic molecules --> life. But we have now seen larger organic molecules on Mars, and amino acids in meteorites and asteroidal surface samples. So, we're narrowing down the area we need to explore.\nThe path from large molecules to self-replicating molecules (such as DNA or RNA) is yet to be found.\nFor all we know there could have been some very special short lived conditions on early earth that allowed it to occur. Or, alternatively its an emergency property of certain chemical conditions. We just don't know.Which is why we're looking.\nFor all we know there could have been some very special short lived conditions on early earth that allowed it to occur. Or, alternatively its an emergency property of certain chemical conditions. We just don't know.\nWhich is why we're looking.\n... entirely plausible and the hypothesis surrounding these topics are generally regarded as sound. Fundamental cell mechanisms as essentially the same in all of life on earth. That's a clear indicator of LUCA. The rest is likely just \"emergence\" of Eukarya multi-cell organisms. Perhaps even starting off by single-cells \"merely\" co-operating. Let's not forget that humans are living in a nano-second of life on earth and that we live in a quite very tight symbiosis with the microorganisms inside us.\nLive has b \n... entirely plausible and the hypothesis surrounding these topics are generally regarded as sound.Just a comment here that a plausible hypothesis is not the same as a confirmed hypothesis.The jump from \"molecule\" to \"self-replicating molecule\" is the one we have yet to get a good handle on. Once you get self-replication, you get evolution by natural selection to kick in, and emergence of eukaryotic organisms is, in comparison, much better understood.\n... entirely plausible and the hypothesis surrounding these topics are generally regarded as sound.\nJust a comment here that a plausible hypothesis is not the same as a confirmed hypothesis.\nThe jump from \"molecule\" to \"self-replicating molecule\" is the one we have yet to get a good handle on. Once you get self-replication, you get evolution by natural selection to kick in, and emergence of eukaryotic organisms is, in comparison, much better understood.\nIt's a strong indicator that life on earth has a LUCA.  It's not yet proof.\nPerhaps the evolution from large molecules to RNA is easy, and there's really only one likely way to do it.  I sure wouldn't argue that that's the case, but one needs to consider that it MIGHT be.\nMy personal belief is that the evolution of life from a collection of large organic molecules is strongly dependent on WHICH large organic molecules.  (That seems extremely likely.)  And that it's also difficult enough that we're unlikely to \nDammit, I left out the major point.  I suspect the choice of base-pair to amino acid correspondence is arbitrary.\n I suspect the choice of base-pair to amino acid correspondence is arbitrary.\nVery likely it's not arbitrary. The assignment of codon triples to types of amino acid (more or less hydrophobic; compactness or length of side chain) is thought unlikely to be \"arbitrary\" but has considerable resilience to substitutions. Flip one codon and you might get a different amino acid, but it's likely to have a similar hydrophobicity, or a similar side-chain length. For some of the commonest amino acids, flip that third ba \nIIUC, your argument is assuming the same ribosome mechanism.  But the ribosome, itself, is part of the evolved machinery.  I don't think we have a good idea of just how it evolved.  And some experiments have shown that the selection of amino acids used can be altered.  So ISTM that live that evovolved independently might will use a different selection of amino acids, and different coding systems.  (Nobody seems to be suggesting alternative nucleotides, though.)\nIIUC, your argument is assuming the same ribosome mechanism.\nSince it is the ribosome which does the binding onto (and so, to some degree, selection of) the base-pair triple, before offering up an amino acid monomer to the growing protein chain, that effectively means that for each triple of base pairs (codons) you need a different ribozyme and a different base-pair sequence. So that would be between 23 and 40-several different ribozymes structures and sequences. Some of the ribozymes could be insensitive to \nPerhaps the evolution from large molecules to RNA is easy, and there's really only one likely way to do it.\nOr perhaps not.\n\nThe mechanism of action of RNA molecules is thought to be (well, shown to be, in plenty of cases) by the shape of a cavity in the folded RNA matching the shape of a precursor molecule. It's unlikely that there is a single molecule (RNA sequence, leaving aside the complexities of folding and elimination of water of hydration) that sufficiently-well catalyses that reaction (say, splicing \nThe rest is likely just \"emergence\" of Eukarya multi-cell organisms.\nMost strains of eukaryotes are multicellular, probably - it's harder to say \"different species\" with a unicellular organism than it is with, say, an insect.\nPerhaps even starting off by single-cells \"merely\" co-operating.\nWhile all multicellular animals are eukaryotes, a high proportion of prokaryotes spend a lot of their lives living in multicellular colonies (frequently multi-species ; often multi-genera, if those categories map well onto\nSo there!\ndecane, undecane, and dodecaneWashington State needs to tax it.\ndecane, undecane, and dodecane\nWashington State needs to tax it.\nThere may be more comments in this discussion. Without JavaScript enabled, you might want to turn on Classic Discussion System in your preferences instead.\nFirefly Aerospace Selects Blue Origin Unit To Explore Volcanic Formations On Moon\nSoftware Maker SAP Becomes Europe's Largest Company\nFunction reject.",
        "keywords": [
            "Fine Print",
            "organic molecules",
            "molecules",
            "large organic molecules",
            "scoop Nickname",
            "organic",
            "life",
            "Earth",
            "Password",
            "Nickname"
        ]
    }
]