[
    {
        "id": "11111",
        "title": "Analog circuits",
        "domain": "engineering",
        "type": "course",
        "author": "SEMICONDUCTOR ENGINNEERING",
        "description": "Analog integrated circuits are integrated circuits that make a representation of continuous signals in electrical form.",
        "url": "https://semiengineering.com/knowledge_centers/integrated-circuit/ic-types/analog-circuits/",
        "image": "https://i0.wp.com/semiengineering.com/wp-content/uploads/2018/11/digitalvsanalog.png?ssl=1",
        "content": [
            {
                "element": "Description",
                "section": "Before digital circuits were invented, there were analog circuits. One of the two main types of integrated circuits, the analog integrated circuit is a completely different beast from the digital integrated circuit in several ways.\nAn analog circuit works with analog signals: the full signal (a continuously variable signal) in the form of a wave has more data in it—because it is a continuous wave—as opposed to digitized waveform that is made up of binary ups and downs (or pulses). We live in an analog world. All the waves in the electromagnetic spectrum are analog. Furthermore, the world “analog” means proportional: the analog circuit makes a proportional representation of the real-world signal in electronic voltage or current. Since the way we hear and see things is a continuous wave, an analog circuit makes an electronic representation of our physical world. Again, the signal isn’t being translated into binary pulses or some other approximation of the real world signal, as a digital integrated circuit would. Another way to see it is analog waves are smooth, whereas digital is jagged.\nYou can make analog circuits by soldering discrete components on a breadboard more easily than making a digital circuit on a breadboard. Although integrating that analog circuit onto a chip puts all those components onto one substrate just as with a digital integrated circuit, the analog ICs are notoriously hard to design well and require a different approach, much of which stems from designer experience rather than a heavy reliance on tools. Analog circuit design is not automated as much as digital circuit design is, which can have an effect on error rate. Also, analog is sensitive to noise in the environment.\nReports show that analog content causes the most test failures and contributes significantly more than digital to field returns. This error rate is caused by high complexity, an error-prone process, full-custom design, variability, limited systematic verification to assess robustness, and much less automation compared to its digital counterpart. Some of it is due to the maturity of analog design and verification. While great strides have been made in digital circuitry, analog design automation and verification methodologies have lagged. In addition, leading-edge nodes make it increasingly difficult to construct reliable analog circuitry.\nStandards are finally catching up. IEEE P2427, “A Standard for Analog Defect Modelling and Coverage,” will define how to model faults and calculate test coverage. The standard should accelerate the development and deployment of tools for analog fault simulation of test coverage in 2019.\nAnalog circuitry stopped following Moore’s Law a long time ago. Unlike digital circuits, analog circuitry does not scale well. Analog is, therefore, behind digital in node shrinkage. Analog transistors often need to be larger to ensure that loads, power distribution and signal fidelity are all well maintained within an application.\nOne advantage of analog is staying in older nodes, which saves money and hassle. With less pressure to shrink the transistors and move analog to next nodes, analog engineers can continue to build experience with older nodes. "
            },
            {
                "element": "How analog integrated circuits are similar to digital integrated circuits?",
                "section": " Analog circuits consist of combination of transistors, resistors, capacitors, and so on. For some basic analog circuit configurations, see National Instruments page Basic Analog Circuits.\nAnalog and digital circuits sometimes do the same thing. For instance, memory storage circuits have analog and digital flavors.\nIntellectual property (IP) can be purchased for analog, digital and mixed-signal circuits."
            },
            {
                "element": " Examples of analog integrated circuits",
                "section": "Although analog may seem like a dinosaur, it is not just an antiquated world for hardcore, old-school analog engineers. Analog circuits are used in many communications devices and being debated now are questions of whether analog has significant performance advantages over digital for some applications. For the base stations, for instance, the choice is whether to use digital versus analog for beamforming.\nExamples of analog ICs:\nsome memory chips,\npower supply chips,\nsome sensors,\nwideband RF and some 5G applications, AFEs—analog front end (AFE) solutions.\noperational amplifiers (op-amps)\nRC low pass and high pass filters dynamic signal acquisition (DSA) devices "
            },
            {
                "element": " Changing the signal",
                "section": "The continuous signal that analog circuits work with can be manipulated to decrease noise, increase (amplify) or decrease the signal.\nsensors, which take an analog signal such as sound waves or other vibrations, may use a transducer that changes the size of the signal by amplitude or frequency, or may just use the signal without modification.\namplifiers increase voltage, current, or power of a signal. "
            }
        ],
        "keywords": [
            "analog",
            "analog circuits",
            "digital",
            "circuit",
            "digital integrated circuit",
            "signal",
            "integrated circuit",
            "analog circuit makes",
            "digital circuits"
        ]
    },
    {
        "id": "22222",
        "title": "Signal Processing",
        "domain": "engineering",
        "type": "course",
        "author": "IEEE Signal Processing Society",
        "description": "Discover how signal processing powers modern technology—from speech recognition and image analysis to autonomous vehicles and data science. This course offers a comprehensive introduction to the fundamental concepts and real-world applications of signal processing in engineering.",
        "url": "https://signalprocessingsociety.org/our-story/signal-processing-101",
        "image": "https://www.researchgate.net/publication/375879233/figure/fig3/AS:11431281277469192@1726106686807/Audio-processing-for-digital-signal-processing.png",
        "content": [
            {
                "element": "What is Signal Processing?",
                "section": "The technology we use, and rely on, in our everyday lives–including computers, radios, video devices, cell phones, smart connected devices and more–is enabled by signal processing, a branch of electrical engineering that models and analyzes data representations of physical events as well as data generated across multiple disciplines. Hence, signal processing is at the heart of our modern world. It’s at the intersection of biotechnology, entertainment, and social interactions. It enhances our ability to communicate and share information. Signal processing is the science behind our digital lives.\nHave you shared what’s on your mind with Facebook friends or searched the Internet today? These are just two of the myriad ways we use machine learning every day. Machine learning brings together signal processing, computer science, and statistics to harness predictive power, and provides the technology behind many applications, including detection of credit card fraud, medical diagnostics, stock market analysis, and speech recognition among many others.\nRecently, machine learning techniques have been applied to aspects of signal processing, blurring the lines between the sciences, and causing many shared applications between the two."
            },
            {
                "element": "Speech and Audio Processing",
                "section": " Every telephone, smart or not, relies heavily on speech processing techniques to make voice communication between two (or more) people possible. From analog-to-digital conversion to speech enhancement (filtering, echo-, noise-, and automatic gain control) to speech encoding on recording side to speech decoding to speech enhancement (typically filtering and gain control) to digital-to-analog conversion on the playback side. Signal processing is the tool of choice every step of the way. Without signal processing, modern digital assistants, such as Siri, Google Now, and Cortana, would not be able to recognize a user’s voice.\nAudio compression techniques, such as MP3 and AAC, have revolutionized the way we listen to music. We can now hold the world’s music musical catalog in the palm of our hands and enjoy listening to music on-the-go, even completely untethered via Bluetooth. Again, signal processing made this happen."
            },
            {
                "element": " Speech Recognition",
                "section": "Speech recognition is a vital application of signal processing; it’s also likely the easiest to understand. Signal processing manipulates information content in signals to facilitate automatic speech recognition (ASR). It helps extract information from the speech signals and then translates it into recognizable words. Speech recognition technology is found in fighter aircraft, “talk to text” applications on smart phones, therapeutic applications, language translation and learning, and recognition programs for people with disabilities. "
            },
            {
                "element": " Hearing Aids",
                "section": "Can you hear us now? The core of hearing aid technology is four synchronized parts: microphone, processor, receiver and power source. Signal processing is involved in picking up sounds in the environment, and processing them to enhance and amplify what the wearer hears. Without delay, sounds are converted from analog to digital and back to analog before sound is projected into the ear.\nWhile the fundamental components of the technology will remain the same, hearing aids are becoming increasingly more advanced – reducing noise and feedback from the surrounding environment to help people hear crisp, clear sounds. Signal processing also helps reduce sudden loud noises, such as horns, and even allows hearing aids to connect wirelessly with a cell phone or TV."
            },
            {
                "element": " Autonomous Driving",
                "section": "Once the stuff of science fiction, autonomous cars are now reality. To work properly, these self-driving vehicles rely on input from a multi-modular system of sensors, including ultrasound, radar and cameras –and  to prevent crashing, they must convert the acquired information and filter it into data needed to control action. Signal processing is integral to the technology. It helps decide whether the car needs to stop or go and is part of the radar used to decipher weather conditions like rain or fog."
            },
            {
                "element": "Image Processing and Analysis",
                "section": "Seeing is believing. The omnipresence of digital cameras and screens in our daily lives, such as in our smartphones, cars, drones, surveillance systems, airplanes, hospitals, and our living room, translates our ever growing need to see, share and interact with our visual environment, with increasing levels of detail. In medicine almost all diagnosis nowadays involve some sort of imaging. However, this rapidly emerging part of the iceberg hides an important number of lesser-known, but highly essential applications, notably in the cultural, military, health and scientific research domains. Signal processing is key to a wide range of applications, from acquisition to display:\nDigital restoration of images and videos\nCompressed sensing acquisition (e.g. single-pixel cameras)Image enhancement during acquisition (within camera chips)\nImage reconstruction from non-image sensors\nImage quality assessment\nCompression and transmission across networks and devices\nImage to display technologies (Color mapping, 3D to 2D projection)"
            },
            {
                "element": "Wearables",
                "section": "The wearables market is emerging and already thriving. Technology and sensors built into clothing and accessories track fitness levels, heart rates, physical location (GPS), sleep patterns and more. Signal processing helps collect this information and translate it into useful data to be leveraged in myriad ways – such as reporting heart rate to your doctor or upping your workout routine to lose weight."
            },
            {
                "element": "Data Science",
                "section": "Every time you search on the Internet or post on Twitter, you’re adding data to what is popularly called “Big Data” sets. Companies utilize this data to extract information, learn about behaviors and create solutions to make our lives more efficient. Neuroscience and medicine relies on machine learning tools mixing imaging date with medical records and genomic to better understand and phenotype degenerative processes and diseases, predict responses to treatment, and cluster patients into subgroups, for example.\n“Big Data” is a rapidly emerging field, but we’re faced with the challenge of studying large sets of technically difficult data. What’s the key component for analyzing data and solving complex problems? Signal processing.\nLike signal processing, data science touches our daily lives in more ways than we think. Whether it’s using new data sources like emerging social media platforms, predicting changes in the stock market, or studying data to solve medical problems ranging from diabetes to heart problems, signal processing makes it possible to analyze data that enriches our lives every day."
            },
            {
                "element": "Communications Systems and Networks",
                "section": "Have you ever thought about communicating with extraterrestrial beings? Signal processing is integral in searching for life beyond Earth. An important aspect to effective communications across satellite, video, radio and wireless systems, signal processing makes the processing and transmission of data more efficient.\nWhen you’re on the go and need web access or using GPS to find your way, signal processing is the behind-the-scenes technology transforming and analyzing signals to help us communicate and learn from the technology we use on a daily basis – including cell phones, WiFi, TVs, GPS devices, radar, sonar, radio, and cloud and mobile computing."
            }
        ],
        "keywords": [
            "signal processing",
            "processing",
            "signal",
            "data",
            "signal processing makes",
            "speech",
            "technology",
            "speech recognition",
            "machine learning",
            "speech processing techniques"
        ]
    },
    {
        "id": "33333",
        "title": " Power Electronics",
        "domain": "engineering",
        "type": "course",
        "author": "Synopsys ",
        "description": "The increasing focus on electrification for a cleaner environment has fueled the need for electric power in different forms. Power electronics is the branch of electrical engineering that deals with the processing of high voltages and currents to deliver power that supports a variety of needs. From household electronics to equipment in space applications, these areas all need stable and reliable electric power with the desired specifications. Power supply in one form is processed using power semiconductor switches and control mechanisms to another form, supplying a regulated and controlled power. While switched-mode power supplies are a common application of power electronics where power density, reliability, and efficiency are of prime importance, motor control is gearing up with more electrification in transportation systems. Precise control and efficiency are key characteristics for power control applications. The study of power electronics is thus multidisciplinary, involving semiconductor physics, electrical motors, mechanical actuators, electromagnetic devices, control systems, and so on.",
        "url": "https://www.synopsys.com/glossary/what-are-power-electronics.html",
        "image": "https://www.elprocus.com/wp-content/uploads/2014/09/major-power-electronic-blocks-in-automotive-electronics.jpg",
        "content": [
            {
                "element": "What is Signal Processing?",
                "section": "In power generation, especially in renewable energy, the generated power must be processed to meet the AC voltage specification of the power grid. For instance, a solar cell generates DC power whose output power varies with the operating voltage and incident solar irradiation. It is important to extract the maximum power available at the output of the cell and transfer it to the grid with the highest possible efficiency. So, the interface that connects the solar cell to the grid should provide AC power that matches the grid specifications and draws input power that operates the solar cell at its maximum power point. In addition to this, the conversion of this DC power to AC power should be with higher efficiency to minimize the losses in power generation. This is possible using power semiconductor devices with advanced control mechanisms that monitor the output and input parameters and control the switches.\nAdvancements in power semiconductor devices have paved the path for newer devices such as silicon carbide, gallium nitride field effect transistors (FETs), and power diodes. These devices have superior characteristics in terms of wide band gap that allows for high-voltage operation, thermal management, and efficiency. This has resulted in widespread usage of power electronics even in noise-sensitive areas, replacing the lossy linear power supplies and voltage regulators. The main advantage of these devices is that they can withstand high voltage when compared to the silicon devices. Thus, the systems can be designed with high-voltage capabilities, which, in turn, reduces the current and improves efficiency, for the same power to be delivered. In addition to this, operating the devices at higher switching frequencies helps in reducing the size of passive components, making the systems compact. The ability to handle higher temperatures simplifies thermal designs."
            },
            {
                "element": "How Do Power Electronics Work?",
                "section": " Power electronic systems are used in a variety of applications, such as:\nPower Generation\nPower Transmission\nPower Distribution\nPower Control\nIn all these applications, the input voltages and currents are switched using power semiconductor devices to provide desired outputs. The construction of basic semiconductor devices such as diodes, FETs, and bipolar junction transistors (BJTs) are altered to withstand high voltages and currents. As a result, we have silicon-controlled thyristors (SCRs), power diodes, power metal oxide semiconductor field effect transistors (MOSFETs), power BJTs, insulated gate bipolar transistors (IGBTs), gate turn-off thyristors (GTOs), and so on. The device selection is based on the power levels, the switching frequency requirements, efficiency, and the nature of inputs and outputs. For instance, in an EV powertrain, the power handled is of the order of kW. In such applications, power MOSFETs which can withstand the high voltage and switch at higher frequencies are commonly used. In the case of power transmission, where the handled power is of the order of few megawatts, silicon-controlled rectifiers (SCRs) are used.\nThe primary element in a power electronic system is a switching power converter. The power converter consists of power semiconductor devices that are turned on and off at high frequencies. This operation switches the voltage and current through the devices, delivering a controlled power at the output. In addition to this, the power drawn from the input can also be controlled. An ideal device switches the voltage and current instantaneously and offers zero resistance once turned on and infinite resistance when turned off. But in the real world, no device can be switched instantaneously. The switching converters are associated with two types of power losses in the devices:\nSwitching Losses\nConduction Losses\nThe switching losses occur during turn on and off. For instance, when a switch turns on, the voltage across the switch goes to a low value from the voltage that was being blocked when it was in the off state. At the same time, the current through the device goes from zero to the load current level. Since this process takes finite time and the voltage and current are transitioning, power loss takes place. The transition is reversed when the switch is turning off. These losses constitute the switching losses. The switching losses increase with the switching frequency. To minimize these losses, several methods, such as zero voltage switching and zero current switching, are implemented using additional capacitors and inductors.\nConduction losses are a result of the finite on-state voltage drop across the switches during conduction. Availability of newer semiconductor devices and advancements in device structures are helping to reduce the conduction losses.\nTo control the switches, a control circuit, commonly known as a compensation circuit, is used. This block plays a pivotal role in minimizing the losses, delivering power efficiently and with good quality. The control block gets the reference and feedback signals as input and gives switching signals as outputs. Present-day controllers are mostly digital where the feedback is converted from an analog to digital signal and input to a signal processor. Compensation logic is implemented in the software that runs on the processor, and appropriate switching signals are generated. These signals are passed through drivers to provide sufficient power to drive the switching devices. Traditionally, analog circuits using operational amplifiers and comparators are used in compensation circuits. While providing appropriate gating signals to the switches, the control circuits also monitor the health of the system and inhibit the power output when faults occur."
            },
            {
                "element": " Types of Power Electronic Circuits",
                "section": "As mentioned in the previous sections, power electronic circuits control the input and output power. There are several types of power converters based on the type of application. When we consider the power source, there are two main types of power sources, namely alternating current (AC) and direct current (DC). This forms four basic types of power electronics circuits\n1. AC-to-DC Converters\nThe input AC voltage is converted to DC voltage at required levels. A diode bridge rectifier is traditionally used for these applications. But this configuration results in currents that have high peak values and high harmonic content. Boost converters are commonly used to draw currents that are in phase with the AC voltage.\n2. DC-to-DC Converters\nThe DC power input, whether unregulated or regulated, is converted to regulated DC power at the output. Without power electronic converters, it is very difficult to generate variable DC power. With the availability of different configurations of DC-to-DC converters, DC power at desired levels has become indispensable. Buck, boost, and buck-boost converters are three basic converters that can step down, step up, and provide both levels, respectively.\n3. DC-to-AC Converters (commonly known as inverters)\nThe input DC power from batteries is inverted to provide AC power. This AC power is used to control AC motors with precision and efficiency. A combination of AC-to-DC and DC-to-AC converters are used in high-power transmission where two different grids are connected without worrying about synchronization.\n4. AC-to-AC Converters (commonly known as cycloconverters)\nThe AC input that has a variable magnitude and frequency is processed to provide an AC output that has both regulated magnitude and frequency. Wind power generation is a popular application of these types of converters. The output of the wind generator varies in both magnitude and frequency depending on the wind speed. To connect this power to the grid or a load, the voltage and frequency need regulation. This functionality is provided by the AC-to-AC converters.\nOther classifications of power converters include the following:\n1. Based on the isolation between input and output:\nNon-isolated Converters\nIsolated Converters\n2. Based on the type of switching:\nHard-switched Converters\nSoft-switched Converters\n3. Based on the connection to the power grid:\nGrid-connected Converters\nOffline Converters"
            },
            {
                "element": "The Importance of Power Electronics",
                "section": "The drive towards more electrification has resulted in the need for more electric power. Apart from power generation, power processing plays a key role in efficient utilization of the available power. It is important that the raw power is converted to a form that is usable in different applications. Power electronics plays a pivotal role in providing power based on the desired specifications. The basic application which shows the significance of power electronics in our day-to-day life is the fan regulator. Before the advent of solid-state fan regulators, bulky and lossy resistive fan regulators were used. To control the fan speed, the AC mains voltage is passed through a resistor that is connected in series with the fan. So, when the fan is on, there is constant power dissipation in the series resistor. Research has come up with more innovative ways of controlling the fans or motors, in general, by controlling voltage and frequency. This is possible with the availability of power semiconductor devices.\nIn aerospace applications, especially in space applications, size, weight, and reliability are critical parameters. If power is handled at low frequencies, the transformers and other energy storage elements occupy a huge amount of space. With switching converters that work at high switching frequencies, the size of the energy storage elements is drastically reduced.  The size of these components is inversely proportional to the switching frequency. So, devices with shorter switching times help to reduce the overall size and weight of systems.\nState-of-the-art power electronic systems are capable of handling power from a few watts to several megawatts, enabling efficient and reliable interfaces between raw power and regulated power. As a result,  hydraulic and mechanical actuators are being replaced with electric motors that can be controlled precisely using power electronic interfaces."
            },
            {
                "element": "The Benefits of Power Electronics ",
                "section": "Electric power is scarce, and it is of prime importance to deliver the power to the loads with minimum losses. Advancements in power semiconductor research has resulted in more efficient chemistries such as silicon carbide and gallium nitride. The benefits of power electronics are:\nHigh power density power supplies\nImproved efficiency of up to 99% in power conversion\nNoise-sensitive applications such as in medical devices are also transitioning to switching power supplies because of the efficiency and reliability\nPower can be made available in the desired form and level as per specifications\nIncreased clean power generation using power electronic interfaces to connect the sources to grid\nWireless power transfer"
            },
            {
                "element": "Power Electronics and Synopsys",
                "section": "The study of power electronics is multi-disciplinary, and simulation is vital to having a comprehensive understanding of such systems. Virtual verification of the systems saves a lot of time and costs. But the characteristics of the power electronics systems are highly non-linear.\nSynopsys Saber™ is a solution of high-performance virtual prototyping tools for multi-domain power electronics design that consists of SaberRD, SaberEXP, and SaberES Designer. Saber allows an engineer to run complex simulations with varying component tolerances, generate best and worst-case results, and easily conduct “what-if” studies. Industry-leading accuracy lowers development costs by reducing the number of prototypes required.\nSaberEXP is a piecewise linear (PWL) quick converging simulator for power electronics, with seamless export into SaberRD.\nSaberRD adds an integrated design and simulation environment for mechatronic systems, with best-in-class analysis for power electronics validation. Key features such as characterization tools for modeling MOSFETs, IGBTs, Silicon Carbide (SiC), batteries, etc. helps to create schematics easily.\nAdditional features like co-simulation with tools such as Virtualizer and Silver provide a virtual prototyping solution for comprehensive simulation of power electronic-based systems."
            }
        ],
        "keywords": [
            "power",
            "power electronics",
            "converters",
            "power semiconductor devices",
            "switching",
            "voltage",
            "devices",
            "power semiconductor",
            "power generation",
            "switching power converter"
        ]
    },
    {
        "id": "44444",
        "title": "The Basic Laws and Theorems in Electrical Circuit Network Analysis",
        "domain": "engineering",
        "type": "course",
        "author": "cadence ",
        "description": "Electrical circuit network analysis is the process by which the circuit's electrical parameters are calculated. \nNodal analysis is the method used in circuit analysis to determine the voltages at nodes in a circuit. \nMesh analysis is governed by Kirchhoff’s voltage law and is suitable for planar circuits or networks. ",
        "url": "https://resources.pcb.cadence.com/blog/2023-the-basic-laws-and-theorems-in-electrical-circuit-network-analysis",
        "image": "https://www.electronicsandyou.com/blog/wp-content/uploads/2013/11/electronic-circuit-1.jpg",
        "content": [
            {
                "element": "Electrical Circuit",
                "section": "Many practical circuits are made up of memoryless elements such as resistors, capacitors, and inductors. The elements in these electric circuits are connected to each other and consume power from the voltage or current sources. These interconnected elements form electric circuits and can be solved using the concepts of series and parallel circuits to obtain quantities of interest such as voltage, current, power, etc. Unfortunately, such techniques are time-consuming in large networks. To make electrical circuit network analysis easier, several techniques can be used. "
            },
            {
                "element": "Electrical Circuit Network Analysis",
                "section": " Electric circuits can be DC circuits, AC circuits, or a combination of both. In practical applications, we use both AC and DC circuits involving inductors, capacitors, and resistors. Depending on the application, the number of passive components (resistors, inductors, and capacitors) in the circuit varies.\nElectrical circuit network analysis can be defined as the process by which the circuit's electrical parameters, such as voltage, current, equivalent resistance, total power losses, etc., are calculated. Using the known elements or parameters, the unknown parameters or quantities in the circuit are determined through analysis.\nAll circuits can be analyzed as either series circuits or parallel circuits. However, in doing so, the time taken to solve the circuit increases with the increase in complexity of the circuit. It is essential to use techniques that make circuit analysis easier.\nLet’s look at the basic laws used in electric circuit problem-solving before we discuss the various methods of circuit analysis."
            },
            {
                "element": " Ohm’s Law",
                "section": "George Ohm formulated the relation between electromotive force to the current flowing in the circuit, called Ohm's Law. By applying Ohm’s Law to circuits, the electrical resistance offered by the circuit to the flow of current can be determined.\nElectrical resistance is an important physical property associated with circuits. Based on the calculation of the electrical resistance of the circuit, the parts of the circuit can be classified as conductors, insulators, or resistors.\nUsing Ohm’s law equation V=IR, the current flowing through the circuit can be calculated. Ohm’s law is applied in circuits where the equivalent resistance and voltage applied are known. Based on the calculated current value, the conductor size and component current rating can be selected. The power loss of the circuit, otherwise called Joule heating loss, can be evaluated using the calculated current."
            },
            {
                "element": "Kirchhoff’s Laws",
                "section": "Kirchhoff’s laws are two basic, essential laws needed to perform electrical circuit network analysis. The two laws are Kirchoff’s current law and Kirchoff’s voltage law.\nKirchhoff’s Current Law (KCL)\nAccording to Kirchhoff’s current law, the algebraic sum of currents meeting at a junction in an electric circuit is zero. The law can be otherwise stated as the sum of incoming currents at a junction in an electric circuit is equal to the sum of outgoing currents. KCL is also called Kirchhoff’s junction, or nodal rule. KCL is based on the law of conservation of charge.\nKirchhoff’s Voltage Law (KVL)\nAccording to Kirchhoff’s voltage law, in a closed mesh, the algebraic sum of potential differences or voltages is zero. In a resistive electric current, KVL can be defined as the algebraic sum of voltage drops that access the resistors and voltage sources equal to zero. By using KVL, the current flowing through any closed loop can be calculated, provided the component value and voltage sources are known.\nNodal Analysis and Mesh Analysis\nNodal analysis is the method used in circuit analysis to determine the voltages at nodes in a circuit. Nodes are the meeting point of two or more components. The voltage at the nodes can be calculated in terms of branch currents using nodal analysis. KCL governs nodal analysis.\nMesh analysis is the method used in circuit analysis to determine the current flowing in closed loops present in the circuit. When you have to solve the circuit without a calculator, using mesh analysis is best. It forms simultaneous equations with unknown variables and the solution gives the current values in each mesh. Mesh analysis is governed by Kirchhoff’s voltage law and is suitable only for planar circuits or networks."
            },
            {
                "element": "Theorems Used for Electrical Circuit Network Analysis ",
                "section": "There are various theorems used to simplify circuit analysis:\nSuperposition Theorem\nThevenin’s Theorem\nNorton’s Theorem\nUnderstanding basic quantities such as voltage, current, resistance, power, inductor, capacitors, fundamental laws, and theorems simplifies the process of electrical circuit network analysis.\nAnalyzing circuit parameters is critical when designing circuits. Cadence’s suite of tools can help you design circuits for any application. Leading electronics providers rely on Cadence products to optimize power, space, and energy needs for a wide variety of market applications. If you’re looking to learn more about our innovative solutions, talk to our team of experts or subscribe to our YouTube channel."
            }
        ],
        "keywords": [
            "circuit",
            "analysis",
            "current",
            "circuit network analysis",
            "circuit analysis",
            "Law",
            "voltage",
            "electrical circuit network",
            "voltage law"
        ]
    },
    {
        "id": "55555",
        "title": "Embedded systems",
        "domain": "engineering",
        "type": "course",
        "author": "TechTarget ",
        "description": "This course provides a comprehensive overview of embedded systems, covering their definition, components, characteristics, architecture, and applications across industries. It also explores the historical evolution and future trends, including the integration of AI and IoT. ",
        "url": "https://www.techtarget.com/iotagenda/definition/embedded-system#:~:text=An%20embedded%20system%20is%20a,or%20have%20a%20fixed%20functionality.",
        "image": "https://externlabs.com/blogs/wp-content/uploads/2021/10/iot-embedded-system-prev.webp",
        "content": [
            {
                "element": "What is an embedded system?",
                "section": "An embedded system is a combination of computer hardware and software designed for a specific function. Embedded systems might also function within a larger system. These systems can be programmable or have a fixed functionality. Embedded systems are used today to control numerous devices. For example, they're used in industrial machines, consumer electronics, agricultural and processing industry devices, automobiles, medical devices, cameras, digital watches, household appliances, airplanes, vending machines, toys and mobile devices.\nEmbedded systems typically contain a microprocessor -- or a microcontroller-based system, memory and input/output (I/O) devices, all of which share a dedicated function within a larger system. While embedded systems are computing systems, they can range from having no user interface (UI) -- for example, on devices designed to perform a single task -- to complex graphical user interfaces (GUIs), such as in mobile devices. UIs can include buttons, light-emitting diodes (LEDs) and touchscreen sensing. Some systems use remote user interfaces as well.\nAccording to Global Markets Insight, the embedded systems market was valued at $110.3 billion in 2023 and is predicted to grow to more than $190 billion by 2032. Chip manufacturers for embedded systems include many well-known technology companies, such as Apple, IBM, Intel and Texas Instruments. The expected growth is partially due to the continued investment in artificial intelligence (AI), mobile computing and the need for chips designed for high-level processing."
            },
            {
                "element": "Examples of embedded systems",
                "section": "Embedded systems are used in a wide range of technologies across an array of industries. Some examples include the following:\nAutomobiles. Modern cars commonly consist of many computers, or embedded systems, designed to perform different tasks within the vehicle. Some of these systems perform basic utility functions and others provide entertainment or user-facing functions. As modern cars become more computerized, the number of embedded systems increases. Some embedded systems in consumer vehicles include cruise control, backup sensors, suspension control, navigation systems, alarm systems and airbag systems.\nMobile phones. These consist of many embedded systems, including GUI software and hardware, operating systems (OSes), cameras, microphones, and Universal Serial Bus I/O modules.\nIndustrial machines. These contain embedded systems, such as sensors, and can be embedded systems themselves. Industrial machines often have embedded automation systems that perform specific monitoring and control functions.\nMedical equipment. These contain embedded systems such as sensors and control mechanisms. Medical equipment, such as industrial machines, must also be user-friendly so that human health isn't jeopardized by preventable machine mistakes. This means these systems often include a more complex OS and GUI designed for an appropriate UI.\nFitness trackers. These wearable devices contain embedded systems that collect data on the user such as heart rate, blood and oxygen levels and number of steps."
            },
            {
                "element": " How does an embedded system work?",
                "section": "Embedded systems always function as part of a complete device. They're low-cost, low-power consuming, small computers that are embedded in other mechanical or electrical systems. Generally, they comprise a processor, power supply, and memory and communication ports. Embedded systems use the communication ports to transmit data between the processor and peripheral devices -- often, other embedded systems -- using a communication protocol. The processor interprets this data with the help of minimal software stored in the memory. The software is usually highly specific to the function that the embedded system serves.\nThe processor might be a microprocessor or microcontroller. Microcontrollers are simply microprocessors with peripheral interfaces and integrated memory included. Microprocessors use separate integrated circuits for memory and peripherals instead of including them on the chip. Both can be used, but microprocessors typically require more support circuitry than microcontrollers because they're less integrated into the microprocessor. The term system-on-a-chip (SoC) is often used. SoCs typically include multiple processors and interfaces on one chip. They're often used for high-volume embedded systems. Some examples of SoC types are the application-specific integrated circuit (ASIC) and the field-programmable gate array (FPGA).\nOften, embedded systems are used in real-time operating environments and use a real-time operating system (RTOS) to communicate with the hardware. Near-real-time approaches are suitable at higher levels of chip capability, defined by designers who have increasingly decided the systems are generally fast enough and the tasks tolerant of slight variations in reaction. In these instances, stripped-down versions of the Linux OS are commonly deployed, although other OSes have been pared down to run on embedded systems, including Embedded Java and Microsoft Windows IoT -- formerly Microsoft Windows Embedded.\nEmbedded system designers often also use compilers, assemblers and debuggers to develop embedded system software."
            },
            {
                "element": "Characteristics of embedded systems",
                "section": "The main characteristic of embedded systems is that they're task-specific. They often include the following additional characteristics:\nThey typically consist of hardware, software and firmware.\nThey can be embedded in a larger system to perform a specific function, as they're built for specialized tasks within the system, not various tasks.\nThey can be either microprocessor-based or microcontroller-based -- both are integrated circuits that give the system compute power.\nThey often use ASIC and FPGA SoCs.\nThey're often used for sensing and real-time computing in internet of things (IoT) devices, which are devices that are internet-connected and don't require a user to operate.\nThey can vary in complexity and function, which affects the type of software, firmware and hardware they use.\nThey're often required to perform their function under a time constraint to keep the larger system functioning properly."
            },
            {
                "element": "Structure of embedded systems ",
                "section": "Embedded systems vary in complexity but, generally, consist of the following three main elements:\nHardware. The hardware of embedded systems is based around microprocessors and microcontrollers. Microprocessors are similar to microcontrollers and, typically, refer to a central processing unit (CPU) that's integrated with other basic computing components, such as memory chips and digital signal processors. Microcontrollers have those components built into one chip.\nSoftware and firmware. Software for embedded computing systems can vary in complexity. However, industrial-grade microcontrollers and embedded IoT systems usually run simple software that requires little memory.\nRTOSes. These aren't always included in embedded systems, especially smaller-scale systems. RTOSes define how the system works by supervising the software and setting rules during program execution.\nIn terms of hardware, a basic embedded system consists of the following elements:\nSensors. These components convert physical sense data into an electrical signal.\nAnalog-to-digital converters. A-D converters change an analog electrical signal into a digital one.\nProcessors. These process digital signals and store them in memory.\nDigital-to-analog converters. D-A converters change the digital data from the processor into analog data.\nActuators. These components control the mechanical motion of the embedded system by converting electrical signals into physical actions.\nThe sensor reads external inputs, the converters make that input readable to the processor, and the processor turns that information into useful output for the embedded system."
            },
            {
                "element": "Types of embedded systems ",
                "section": "Embedded system types differ in their functional requirements. They include the following:\nMobile embedded systems are small systems that are designed to be portable. Digital cameras, smartphones and laptops are examples.\nNetworked embedded systems are connected to a network to provide output to other systems. Examples include home security systems and point-of-sale systems.\nStandalone embedded systems aren't reliant on a host system. Like any embedded system, they perform a specialized task. However, they don't necessarily belong to a host system, unlike other embedded systems. A calculator or MP3 player are examples.\nReal-time embedded systems give the required output in a defined time interval. They're often used in medical, industrial and military sectors because they're responsible for time-critical tasks. A traffic control system is an example.\nEmbedded systems can also be categorized by the following performance requirements:\nSmall-scale embedded systems often use no more than an 8-bit microcontroller.\nMedium-scale embedded systems use a larger 16-32-bit microcontroller and often link microcontrollers together.\nSophisticated-scale embedded systems often use several algorithms that result in software and hardware complexities and might require more complex software, a configurable processor and a programmable logic array.\nThere are several common embedded system software architectures, which become necessary as embedded systems grow and become more complex in scale. These include the following:\nSimple control loops call subroutines, which manage a specific part of the hardware or embedded programming.\nInterrupt controlled systems have two loops: a main one and a secondary one. Interruptions in the loops trigger tasks.\nCooperative multitasking is essentially a simple control loop located in an application programming interface.\nPreemptive multitasking or multithreading is often used with an RTOS and features synchronization and task-switching strategies.\nVery large-scale integration (VLSI) describes the complexity of an integrated circuit (IC). VLSI is the process of embedding hundreds of thousands of transistors into a chip, whereas large-scale integration (LSI) microchips contain thousands of transistors, medium-scale integration (MSI) contains hundreds of transistors, and small-scale integration (SSI) contains tens of transistors. Ultra-large-scale integration (ULSI) refers to placing millions of transistors on a chip.\nVLSI circuits are a common feature of embedded systems. Many ICs in embedded systems are VLSIs, and the use of the VLSI acronym has largely fallen out of favor."
            },
            {
                "element": "History of embedded systems ",
                "section": "Embedded systems date back to the 1960s. Charles Stark Draper developed an integrated circuit in 1961 to reduce the size and weight of the Apollo Guidance Computer, the digital system installed on the Apollo Command Module and Lunar Module. The first computer to use integrated circuits, it helped astronauts collect real-time flight data.\nIn 1965, Autonetics, now a part of Boeing, developed the D-17B, the computer used in the Minuteman I missile guidance system. It's widely recognized as the first mass-produced embedded system. When the Minuteman II went into production in 1966, the D-17B was replaced with the NS-17 missile guidance system, known for its concentrated use of integrated circuits. In 1968, the first embedded system for a vehicle was released; the Volkswagen 1600 used a microprocessor to control its electronic fuel injection system.\nBy the late 1960s and early 1970s, the price of integrated circuits dropped and usage surged. The first microcontroller was developed by Texas Instruments in 1971. The TMS1000 series, which became commercially available in 1974, contained a 4-bit processor, read-only memory and random-access memory, or RAM, and it initially cost around $2 each in bulk orders.\nAlso, in 1971, Intel released what's widely recognized as the first commercially available processor, the 4004. The 4-bit microprocessor was designed for use in calculators and small electronics, though it required external memory and support chips. The 8-bit Intel 8008, released in 1972, had 16 KB of memory; the Intel 8080 followed in 1974 with 64 KB of memory. The 8080's successor, the x86 series, was released in 1978 and is still largely in use today.\nIn 1987, the first embedded OS, the real-time VxWorks, was released by Wind River, followed by Microsoft's Windows Embedded CE in 1996. By the late 1990s, the first embedded Linux products began to appear. Today, Linux is used in almost all embedded devices.\nThroughout the 1990s and 2000s, processing power increased due to the transition from 8- and 16-bit microcontrollers to 32- and 64-bit processors.\nThe 2010s saw an increased focus on security features in embedded devices, possibly driven by the rise of IoT and connected devices.\nToday, due to technological advancements, embedded systems have also begun to integrate with AI and machine learning (ML) systems. Also called embedded AI, this is the integration of AI into resource-limited devices such as smartphones or autonomous vehicles."
            },
            {
                "element": "Embedded system trends ",
                "section": "While some embedded systems can be relatively simple, others are becoming more complex and can either supplant human decision-making or offer capabilities beyond what a human could provide. For instance, some aviation systems, including those used in drones, can integrate sensor data and act upon that information faster than a human could, permitting new kinds of operating features.\nThe embedded system is expected to continue growing rapidly, driven in large part by IoT. Expanding IoT applications, such as wearables, drones, smart homes, smart buildings, video surveillance, three-dimensional printers and smart transportation, are expected to fuel embedded system growth.\nOther embedded system trends include the following:\nAI and ML. This is a currently growing trend of integrating AI and ML systems into devices such as smartphones, autonomous vehicles, industrial automation devices and wearable devices.\nEdge computing. Edge computing, which pushes the processing of data closer to the source device, is also becoming more prevalent in embedded systems, as it can lower latency and bandwidth usage -- especially in real-time applications.\nSecurity. As security becomes an increasing concern for many, security features such as encryption and secure boot mechanisms are being integrated into embedded systems."
            }
        ],
        "keywords": [
            "Embedded systems",
            "embedded",
            "system",
            "devices",
            "embedded system software",
            "software",
            "memory",
            "Microsoft Windows Embedded",
            "integrated"
        ]
    }
]